{"timestamp": 1760215259.7561028, "data": {"url": "https://www.aljazeera.com/news/2025/9/19/impact-of-climate-change-a-harsh-reality-facing-pakistan", "title": "‘Crisis of justice’ as floods devastate: Pakistan’s climate change minister", "text": "Islamabad, Pakistan – As Pakistan reels from one of the worst flooding to have hit the country in decades, where more than 1,000 people have been killed and more than two million displaced, Pakistan’s climate change minister has slammed the “crisis of justice” facing his country.\n\nThe United Nations said more than six million people in all have been affected after local officials said cloudbursts and a heavier-than-usual monsoon caused landslides and massive flooding since June 26. More than 12,500 houses have been damaged and 6,500 livestock lost in addition to the widespread destruction of crops across the country, according to the National Disaster Management Authority.\n\nRecommended Stories\n\nlist of 4 items\n\nlist 1 of 4‘Intense’ monsoon rain, flooding continue to engulf Pakistan’s Punjab\n\nlist 2 of 4Pakistan facing ‘crisis of injustice’ in fight against climate change\n\nlist 3 of 4Why is Pakistan flooding, and what is the solution?\n\nlist 4 of 4Has India ‘weaponised water’ to deliberately flood Pakistan?\n\nend of list\n\nClimate change is seen as one of the several factors contributing to the deluge. Pakistan ranks among the top 10 most climate-vulnerable nations, but it contributes less than 1 percent of global emissions.\n\nIn an interview with Al Jazeera, Pakistan’s climate change minister Musadik Malik also questioned the “lopsided allocation” of funding that the country has received from the international community to fight the impact of climate change.\n\nAl Jazeera: Pakistan is highly dependent on agriculture. How big a threat is climate change, particularly the melting of glaciers, to this vital sector?\n\nMalik: Around 50 to 55 percent of Pakistan’s population is engaged in agriculture. Our agricultural system is predominantly sustained by canals and rivers, with some reliance on rainfall. Pakistan is home to some 13,000 glaciers. If these glaciers, due to global warming and increased carbon emissions primarily from developed economies, begin to melt erratically and at a much faster rate – and there’s substantial evidence that the melting rate is accelerating – imagine the impact on our river system, our barrages and subsequently our canal network.\n\nThis would have catastrophic consequences for Pakistan’s agricultural economy, which is the backbone of our GDP and, more significantly, a major source of employment. From an economic and agricultural standpoint alone, the potential for devastation is immense.\n\nAl Jazeera: Beyond the agricultural impact, what are the broader consequences of climate-induced floods in Pakistan?\n\nMalik: The devastation extends far beyond agriculture and livelihoods. The immediate and most premium concern is the loss of life. We’ve seen an alarming increase in the number, pattern and erratic nature of floods over the past 10 to 15 years. When these floods hit, they cause immense mortality, morbidity and widespread displacement. Just a few years ago in Sindh, thousands of years of civilisation were literally washed away – mosques, temples, schools, hospitals, old buildings and monuments.\n\nThe sequelae of such devastation are profound: loss of education, limited access to healthcare and safe drinking water, a surge in waterborne and other diseases, and increased infant and child mortality. All of this is not theoretical, it’s a harsh reality we face.\n\nAl Jazeera: What other environmental issues is Pakistan facing?\n\nMalik: Firstly, there’s air pollution. What used to be mist or fog has now become smog, particularly for two to three months in many cities of Punjab [province]. Visibility is severely hampered, leading to accidents and making travel difficult. When you land in these cities, your lungs burn for a good 30 seconds before adjusting.\n\nSecondly, we are facing water pollution. Our flowing waters, once considered pristine and a symbol of civilisation, are now largely poisoned. When we were growing up, children would jump into canals and elders would say flowing water was safe to drink. Today, you wouldn’t dare drink directly from a canal. Even in elite areas of Islamabad, where real estate is most expensive, no one would risk drinking tap water. Imagine the situation in less developed areas.\n\nFinally, there’s solid waste. The numerous landfills we’re building are sources of ammonia and other pollutants, contributing to temperature increases, which in turn exacerbate glacier melting and floods. This also contributes to erratic climate change, taking away the predictability vital for agriculture.\n\nAl Jazeera: You’ve often spoken about the global inequality in climate change responsibility and financing. Can you elaborate on Pakistan’s perspective?\n\nMalik: It’s an open secret that two countries [China and the US] alone produce 45 percent of the world’s carbon emissions and one of them [the US] has even pulled out of international treaties. The top 10 countries account for more than 70 percent of the global carbon burden. Yet, astonishingly, 85 percent of the world’s green financing for building climate resilience and adaptation infrastructure goes to these same 10 countries. The remaining 180-plus countries, like ours, receive only 10 to 15 percent. This is a joke. What resilience or adaptation can we build with such negligible financing?\n\nI don’t view this as a crisis of climate. I view it as a crisis of justice. The very countries consuming and polluting the environment are not investing in solutions where the suffering and vulnerabilities are most acute. We are the ones facing erratic climate changes, floods, agricultural devastation, even though our per capita carbon emission is so minuscule you wouldn’t even find Pakistan on a map.\n\nWhile we are responsible for our own water pollution and the health of our people, who is consuming the environment on a global scale? Who is smoking it out?\n\nThis lopsided allocation of green funding is not a funding gap, it’s a moral gap. Unless there is an equitable and reasonable distribution of financing to strengthen resilience, adaptation, forestation and various projects from micro to macro, it is complete injustice and high-handedness.\n\nAl Jazeera: What, then, is Pakistan’s strategy to address climate change within its own resources?\n\nMalik: Our children are our responsibility so we will address these challenges whether we receive adequate funding or not. We are embracing our vulnerability, not just lamenting it.\n\nWe are going to slowly move towards adaptation because there’s little we can do about reducing global temperature increases. What resilience can we build to stop the climate from being consumed or carbon emissions from rising? This dialogue about resilience, for countries like us, protecting things from happening and bringing down global temperatures, is somewhat misplaced. What we need is sensible justice.\n\nAl Jazeera: You mentioned a disconnect in language and priorities between developed nations and countries like Pakistan. Can you explain this?\n\nMalik: There’s a fundamental difference in our understanding and priorities. For us, the issue revolves around access, affordability and sustainability. We are very poor people. When we think of energy, our primary concern is providing access – access to clean air, safe drinking water and sanitation. And this access must be affordable. For us, the priorities are access, affordability and sustainability.\n\nThey [many of the major emitting countries] don’t speak the same language as we do. They imagine poverty from a distance, perhaps based on books. I challenge them to come here and apply their theories to Pakistan. When their books don’t apply, it simply reveals that they are speaking a language that treats billions of people in the world as vagabonds living at the periphery, like exotic wildlife.\n\nThis interview was edited for clarity and brevity.\n\nThis story was produced in partnership with the Pulitzer Center.", "authors": ["Faras Ghani"], "published_date": "2025-09-19T00:00:00", "top_image": "https://www.aljazeera.com/wp-content/uploads/2025/08/AFP__20250820__69YC8CT__v3__HighRes__TopshotPakistanEnvironmentClimate-1755757798.jpg?resize=1920%2C1440", "summary": "end of list Climate change is seen as one of the several factors contributing to the deluge.\nIn an interview with Al Jazeera, Pakistan’s climate change minister Musadik Malik also questioned the “lopsided allocation” of funding that the country has received from the international community to fight the impact of climate change.\nHow big a threat is climate change, particularly the melting of glaciers, to this vital sector?\nThis also contributes to erratic climate change, taking away the predictability vital for agriculture.\nAl Jazeera: What, then, is Pakistan’s strategy to address climate change within its own resources?", "keywords": ["devastate", "minister", "climate", "change", "pakistan’s", "floods", "crisis", "justice", "pakistan", "countries", "water", "global", "al", "jazeera", "malik", "list", "access", "facing", "agricultural", "carbon", "there’s", "resilience", "flooding", "country", "emissions", "funding", "agriculture", "devastation", "financing", "adaptation", "nations", "impact", "melting", "glaciers", "developed"], "success": true, "error": null}}