{"timestamp": 1760215256.910458, "data": [{"title": "‘We don’t want to disappear’: Tuvalu fights for climate action and survival", "description": "Pacific island nation explores new ways to survive climate change but needs help to build protective sea walls now.", "content": "Tuvalus Minister of Climate Change Maina Talia has told Al Jazeera that his country is fighting to stay above rising sea levels and needs real commitments from other countries that will allow Tuvalua… [+6326 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/we-dont-want-to-disappear-tuvalu-fights-for-climate-action-and-survival", "source": "Al Jazeera English", "published_at": "2025-10-10T01:07:30Z", "relevance_score": 0.5}, {"title": "‘Crisis of justice’ as floods devastate: Pakistan’s climate change minister", "description": "Pakistan ranks among top 10 most climate-vulnerable nations but contributes less than 1 percent of global emissions.", "content": "Islamabad, Pakistan As Pakistan reels from one of the worst flooding to have hit the country in decades, where more than 1,000 people have been killed and more than two million displaced, Pakistans c… [+7419 chars]", "url": "https://www.aljazeera.com/news/2025/9/19/impact-of-climate-change-a-harsh-reality-facing-pakistan", "source": "Al Jazeera English", "published_at": "2025-09-19T05:02:28Z", "relevance_score": 0.43500000000000005}, {"title": "‘Dumbphones’ are getting smarter and more premium. Are they the solution for disillusioned phone addicts?", "description": "The feature phone market is contracting, but a healthy marketplace for premium models is catering to people who want to make the change with fewer...", "content": "The odds are youre reading this on your phone. You may have come here via social media, the CNN app, an email or a good old-fashioned browser. The chances are you did not open your smartphone with th… [+10680 chars]", "url": "https://www.cnn.com/world/dumphones-feature-phones-spc", "source": "CNN", "published_at": "2025-09-30T08:15:02Z", "relevance_score": 0.42500000000000004}, {"title": "Photos: Afghan returnees struggle amid economic and climate crises", "description": "The fragile economy is struggling to absorb the influx as millions return home after being ejected by Iran and Pakistan.", "content": "Herat, Afghanistan At the Islam Qala border, the relentless wind carries stinging dust that clings to skin as temperatures soar to 40 degrees Celsius (104 degrees Fahrenheit), transforming the ground… [+2482 chars]", "url": "https://www.aljazeera.com/gallery/2025/9/18/afghan-returnees-face-harsh-struggles-amid-economic-and-climate-crises", "source": "Al Jazeera English", "published_at": "2025-09-18T06:13:09Z", "relevance_score": 0.42500000000000004}, {"title": "Human-caused climate change led to unusual heat worldwide, report shows", "description": "Human-caused climate change led to extreme heat worldwide between June and August, a new report by Climate Central shows. Kristina Dahl, vice president for science at Climate Central, joins with more details.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/human-caused-climate-change-led-to-unusual-heat-worldwide-report-shows/", "source": "CBS News", "published_at": "2025-09-17T16:33:00Z", "relevance_score": 0.39}, {"title": "Did climate change cause 16,500 extra deaths in Europe this summer?", "description": "Study covering 854 European cities finds that officially reported heat deaths remain 'significantly underestimated'.", "content": "This summer was one of the hottest on record in Europe, with temperatures soaring above 46 degrees Celsius (114 degrees Fahrenheit), triggering wildfires and causing the deaths of thousands of people… [+5089 chars]", "url": "https://www.aljazeera.com/news/2025/9/17/did-climate-change-cause-16500-extra-deaths-in-europe-this-summer", "source": "Al Jazeera English", "published_at": "2025-09-17T10:01:23Z", "relevance_score": 0.37500000000000006}, {"title": "Tens of thousands rally in Berlin against German support for Israel", "description": "More than 100,000 people protest in Berlin, urging a German policy change on Israel’s war on Gaza.", "content": "More than 100,000 people rallied in Berlin, protesting against German support for Israels genocide in the Gaza Strip.\r\nDemonstrators marched from Berlins City Hall to the Grosser Stern on Saturday, f… [+2280 chars]", "url": "https://www.aljazeera.com/gallery/2025/9/28/tens-of-thousands-rally-in-berlin-against-german-support-for-israel", "source": "Al Jazeera English", "published_at": "2025-09-28T10:41:41Z", "relevance_score": 0.34}, {"title": "How to manage climate change anxiety", "description": "Americans are grappling with climate change anxiety as worries grow about global warming. Thomas Doherty, the author of \"Surviving Climate Anxiety,\" joins CBS News with more.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/how-to-manage-climate-change-anxiety/", "source": "CBS News", "published_at": "2025-09-26T13:42:00Z", "relevance_score": 0.33}, {"title": "COP30 urged to link climate justice with reparations for historical crimes", "description": "Letter urges UN climate meeting in Brazil to consider costs of climate crisis, colonialism, slavery.", "content": "Hundreds of environmental and human rights groups and activists have penned a letter urging the upcoming UN climate conference, COP30, in Brazil to place justice and reparations for people unfairly a… [+3927 chars]", "url": "https://www.aljazeera.com/news/2025/9/27/cop30-urged-to-link-climate-justice-with-reparations-for-historical-crimes", "source": "Al Jazeera English", "published_at": "2025-09-27T06:52:32Z", "relevance_score": 0.315}, {"title": "Tropical Storm Humberto is here and another storm is likely. These areas should pay attention", "description": "Tropical Storm Humberto has sprung to life, and there could be a double-dose of tropical trouble in the coming days: Another storm is likely to form near the...", "content": "Tropical Storm Humberto has sprung to life in the Atlantic, and there could be a double dose of tropical trouble in the coming days: Another storm is likely to form near the Bahamas and put the East … [+4060 chars]", "url": "https://www.cnn.com/2025/09/24/weather/atlantic-hurricane-season-tropical-systems-forecast-climate", "source": "CNN", "published_at": "2025-09-25T02:54:59Z", "relevance_score": 0.31}, {"title": "Dubai chocolate bars are more than a trend. They disrupted the confectionery market", "description": "Some flavor crazes flirt with us and fade. Others stay and make themselves at home.\n\n\n\nIt’s too soon to tell for sure, but the Dubai chocolate movement seems to have put down roots and is spreading at a brisk clip. The sweet flavors and thick texture that hav…", "content": "Some flavor crazes flirt with us and fade. Others stay and make themselves at home.\r\nIts too soon to tell for sure, but the Dubai chocolate movement seems to have put down roots and is spreading at a… [+3231 chars]", "url": "https://apnews.com/article/dubai-chocolate-bars-7e951b8efcca8ceb38e481f6c2718d21", "source": "Associated Press", "published_at": "2025-10-06T19:15:00Z", "relevance_score": 0.31}, {"title": "Climate change wreaking havoc on world’s water cycle: UN", "description": "Last year's record heat led to prolonged droughts and extreme floods across the globe.", "content": "Climate change is making the Earths water cycle increasingly erratic, resulting in extreme swings between deluge and drought across the world, the United Nations has warned.\r\nThe UNs World Meteorolog… [+2657 chars]", "url": "https://www.aljazeera.com/news/2025/9/18/climate-change-wreaking-havoc-on-worlds-water-cycle-un", "source": "Al Jazeera English", "published_at": "2025-09-18T08:37:45Z", "relevance_score": 0.29000000000000004}, {"title": "Malawi presidential elections: Who is running and what’s at stake?", "description": "The small African country is still reeling from the fallout of last year's region-wide drought that devastated harvests.", "content": "Malawians are voting to elect their next president amid a deepening economic crisis in one of Africas poorest and most climate-vulnerable countries.\r\nThe small Southeast African nation has been hit w… [+8034 chars]", "url": "https://www.aljazeera.com/economy/2025/9/16/malawi-presidential-elections-who-is-running-and-whats-at-stake", "source": "Al Jazeera English", "published_at": "2025-09-16T08:45:51Z", "relevance_score": 0.28500000000000003}, {"title": "Florida’s move to end vaccine mandates may deepen skepticism in Black communities, health experts warn", "description": "Kiva Williams lives in Tampa, Florida, but she’s worried the state is going to turn into the “wild, Wild West.”", "content": "Kiva Williams lives in Tampa, Florida, but shes worried the state is going to turn into the wild, wild West.\r\nFlorida officials announced their intent to end all vaccine mandates this month, which wo… [+8522 chars]", "url": "https://www.cnn.com/2025/09/14/us/florida-vaccine-mandate-black-community", "source": "CNN", "published_at": "2025-09-14T11:00:05Z", "relevance_score": 0.28}, {"title": "Major Russian drone, missile attack hits Ukraine, Kyiv, causing casualties", "description": "Media reports and independent monitor describe the latest strikes on Ukraine as ‘one of the heaviest’ since war began.", "content": "At least nine people have been reported injured as Russia launched a major drone and missile attack on the Ukrainian capital and the surrounding region.\r\nAn air raid alert was in place over the Kyiv … [+2164 chars]", "url": "https://www.aljazeera.com/news/2025/9/28/major-russian-drone-missile-attack-hits-ukraine-kyiv-causing-casualties", "source": "Al Jazeera English", "published_at": "2025-09-28T06:00:15Z", "relevance_score": 0.28}, {"title": "LDS church member raises more than $300K for family of gunman in deadly chapel attack", "description": "David Butler, a member of the Church of Jesus Christ of Latter-day Saints, is raising money for the family of a man who allegedly attacked a Michigan chapel.", "content": "When a gunman attacked a Church of Jesus Christ of Latter-day Saints chapel in Michigan on Sunday, killing four people and injuring eight others, David Butler, a member of the Mormon church from Utah… [+3216 chars]", "url": "https://abcnews.go.com/US/day-saints-church-member-raises-300000-family-gunman/story?id=126160910", "source": "ABC News", "published_at": "2025-10-02T23:31:20Z", "relevance_score": 0.28}, {"title": "Netherlands threatens to boycott Eurovision 2026 if Israel participates", "description": "Dutch broadcaster AVROTROS says it may not take part in next year's event, citing 'severe human suffering in Gaza'.", "content": "The Netherlands has announced it will boycott the 2026 Eurovision in Vienna if Israel participates, joining other European countries that have threatened to withdraw from the song contest over Israel… [+2836 chars]", "url": "https://www.aljazeera.com/news/2025/9/12/netherlands-threatens-to-boycott-eurovision-2026-if-israel-participates", "source": "Al Jazeera English", "published_at": "2025-09-12T19:13:53Z", "relevance_score": 0.28}, {"title": "Federal judge lifts administration halt of offshore wind farm in New England", "description": "A federal judge has ruled that a nearly complete offshore wind project halted by the Trump administration can resume, dealing President Donald Trump a setback in his ongoing effort to restrict the U.S. offshore wind industry. Work on the Revolution Wind proje…", "content": "WASHINGTON (AP) A federal judge ruled Monday that a nearly complete offshore wind project halted by the administration can resume, dealing President Donald Trump a setback in his ongoing effort to re… [+5130 chars]", "url": "https://apnews.com/article/trump-renewable-energy-offshore-wind-revolution-wind-f1cbe85a829e3d5e5496f834bcb617d1", "source": "Associated Press", "published_at": "2025-09-22T22:45:54Z", "relevance_score": 0.275}, {"title": "More than 350 trekkers escape blizzard-hit Everest, hundreds still stranded", "description": "Rescued trekkers reach China's Qudang township while 200 others still face treacherous Everest conditions awaiting help.", "content": "Rescuers have guided more than 350 people to safety after they were stranded by blizzard-like conditions on the Tibetan side of Mount Everest, Chinese state media reported on Sunday.\r\nIn total, more … [+2526 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/more-than-350-trekkers-escape-blizzard-hit-everest-hundreds-still-stranded", "source": "Al Jazeera English", "published_at": "2025-10-06T01:01:28Z", "relevance_score": 0.25}, {"title": "Lewis Moody: MND", "description": "Former England rugby captain Lewis Moody discusses his diagnosis with Motor Neurone Disease, a condition causing messages from the brain to gradually stop reaching the muscles", "content": "Former England rugby captain Lewis Moody discusses his diagnosis with Motor Neurone Disease, a condition causing messages from the brain to gradually stop reaching the muscles More", "url": "https://www.bbc.co.uk/iplayer/episode/m002kt68/lewis-moody-mnd?at_medium=RSS&at_campaign=rss", "source": "BBC News", "published_at": "2025-10-06T06:00:00Z", "relevance_score": 0.23000000000000004}, {"title": "“Polarised” politics to blame for US govt shutdown", "description": "White House columnist at The Hill, explains how political polarisation in the US has meant more frequent govt shutdowns.", "content": "The thing thats behind [the shutdown] is the two parties becoming more and more far apart and more willing to embrace confrontational approaches.\r\nNiall Stanage, White House columnist at The Hill, ex… [+110 chars]", "url": "https://www.aljazeera.com/video/quotable/2025/10/1/polarised-politics-to-blame-for-us-govt-shutdown", "source": "Al Jazeera English", "published_at": "2025-10-01T11:08:01Z", "relevance_score": 0.22500000000000003}, {"title": "Spread of diseases overwhelms Khartoum hospitals in war-ravaged Sudan", "description": "More than 5,000 cases of malaria, typhoid and dengue fever, causing dozens of deaths, were reported in last month.", "content": "Khartoum, Sudan In the corridors of Omdurman Hospital in Khartoum, Sudan, the corridors have turned into a makeshift ward for patients with dengue fever amid an outbreak of the disease spread by mosq… [+2398 chars]", "url": "https://www.aljazeera.com/news/2025/9/23/spread-of-diseases-overwhelms-khartoum-hospitals-in-war-ravaged-sudan", "source": "Al Jazeera English", "published_at": "2025-09-23T09:01:59Z", "relevance_score": 0.21500000000000002}, {"title": "How Israeli actions caused famine, visualized", "description": "Israel’s war in Gaza led to more than half a million Palestinians being stuck in a cycle of ‘starvation, destitution and death,’ a UN-backed initiative said. Five charts explain how.", "content": "Israels nearly two-year war pushed parts of Gaza into man-made famine, according to a report published in August by a United Nations-backed initiative, deepening the Palestinians struggle for surviva… [+10934 chars]", "url": "https://www.cnn.com/2025/10/02/middleeast/gaza-famine-causes-vis-intl", "source": "CNN", "published_at": "2025-10-02T09:23:50Z", "relevance_score": 0.21500000000000002}, {"title": "Overnight Israeli attack on residential building in Gaza sparks fires", "description": "Israeli forces bombed a residential building causing fires in an intense night of Israeli strikes on Gaza City.", "content": "NewsFeed\r\nIsraeli forces bombed a residential building causing fires to spread in an intense night of Israeli strikes on Gaza City. The army says its forces are increasing the pace of attacks and tol… [+53 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/9/13/overnight-israeli-attack-on-residential-building-in-gaza-sparks-fires", "source": "Al Jazeera English", "published_at": "2025-09-13T12:33:04Z", "relevance_score": 0.195}, {"title": "WATCH: North Texas hammered by hail during severe thunderstorms", "description": "Hail hammered parts of North Texas on Sunday as severe storms swept through the region. The risk for severe weather is ongoing, with storms possibly returning to the area on Tuesday.", "content": "<ul><li>President Trump and RFK Jr. make announcement on autism, Tylenol, and vaccines\r\n</li><li>What should pregnant moms do after Tylenol announcement?\r\n</li><li>Jimmy Kimmel to return to air Tuesd… [+4585 chars]", "url": "https://abcnews.go.com/world-news-tonight-with-david-muirT/video/north-texas-hammered-hail-severe-thunderstorms-125832982", "source": "ABC News", "published_at": "2025-09-23T02:37:38Z", "relevance_score": 0.19}, {"title": "China, world’s largest carbon polluting nation, announces new climate goal", "description": "China will cut emissions by 7-10 percent in the next 10 years, President Xi Jinping tells a UN climate summit.", "content": "China will cut emissions by 7-10 percent by 2035, President Xi Jinping told a high-level climate summit on Wednesday, as the worlds largest carbon-polluting nation announced an ambitious target.\r\nAlo… [+3649 chars]", "url": "https://www.aljazeera.com/news/2025/9/24/china-worlds-largest-carbon-polluting-nation-announces-new-climate-goal", "source": "Al Jazeera English", "published_at": "2025-09-24T22:44:59Z", "relevance_score": 0.19}, {"title": "What caused Nepal’s devastating flood damage and how was it contained?", "description": "Karki government has been praised for issuing early warnings and imposing road closures in response to flood forecasts.", "content": "Heavy rains have resulted in severe flooding and landslides in Nepal and Indias eastern Himalayan city of Darjeeling in the past few days.\r\nDozens of people have been killed in landslides in Nepals e… [+9498 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/what-caused-nepals-devastating-flood-damage-and-how-was-it-contained", "source": "Al Jazeera English", "published_at": "2025-10-07T12:08:16Z", "relevance_score": 0.19}, {"title": "Council seeks more time to name new prosecutor in Georgia election interference case", "description": "The council tasked with naming a prosecutor to replace Fani Willis in Georgia's election interference case against President Trump and others has asked for an extension.", "content": "A day after the trial judge overseeing Georgia's election interference case against President Donald Trump and others set a 14-day deadline for the appointment of a new prosecutor following the dismi… [+2824 chars]", "url": "https://abcnews.go.com/US/council-seeks-time-replace-fani-willis-prosecutor-georgia/story?id=126264300", "source": "ABC News", "published_at": "2025-10-06T21:48:12Z", "relevance_score": 0.19}, {"title": "‘Operation Sindoor’: How cricket became latest India-Pakistan weapon of war", "description": "The India-Pakistan rivalry turned the Asia Cup into a battlefield for nationalist politics. Is there hope for change?", "content": "Islamabad, Pakistan When Indian Prime Minister Narendra Modi addressed parliament on July 29, more than two months after the four-day May clash with Pakistan, he hailed Indias military action dubbed … [+13423 chars]", "url": "https://www.aljazeera.com/news/2025/9/30/operation-sindoor-how-cricket-became-latest-india-pakistan-weapon-of-war", "source": "Al Jazeera English", "published_at": "2025-09-30T05:02:01Z", "relevance_score": 0.19}, {"title": "'I'm giving my opinion': Trump deviates from own FDA in autism remarks", "description": "As Trump cautioned pregnant women about the possible links between Tylenol and autism in children, his remarks went beyond available scientific evidence and even the FDA.", "content": "As President Donald Trump rambled and ad-libbed through an announcement meant to caution pregnant women about the possible links between the use of Tylenol and autism in children, his comments went b… [+4294 chars]", "url": "https://abcnews.go.com/Health/im-giving-opinion-trump-deviates-scientific-evidence-fda/story?id=125846554", "source": "ABC News", "published_at": "2025-09-23T18:03:17Z", "relevance_score": 0.19}, {"title": "Pakistan floods spark cholera fears amid other rising health risks", "description": "Health experts warn of rising cholera cases in Pakistan amid catastrophic floods and strained healthcare.", "content": "As floods continue to cause massive devastation across Pakistan, health experts have warned of potential health risks, including a cholera outbreak, if immediate preventive measures are not taken.\r\nS… [+3342 chars]", "url": "https://www.aljazeera.com/news/2025/9/23/pakistan-floods-spark-cholera-fears-amid-other-rising-health-risks", "source": "Al Jazeera English", "published_at": "2025-09-23T01:59:58Z", "relevance_score": 0.185}, {"title": "WATCH: College freshman lives out his dream of playing football at age 58", "description": "Tom Cillo, a 58-year-old college freshman at Lycoming College in Pennsylvania, is gunning to become the oldest college football player to see the field in more than a decade.", "content": "<ul><li>Shutdown showdown: White House threatens mass layoffs\r\n</li><li>More Americans blame Trump, GOP for shutdown than Democrats: Poll\r\n</li><li>Firefighters battle large fire at Chevron refinery … [+4785 chars]", "url": "https://abcnews.go.com/Sports/video/college-freshman-lives-dream-playing-football-age-58-126163287", "source": "ABC News", "published_at": "2025-10-03T01:50:02Z", "relevance_score": 0.185}, {"title": "WATCH: Sen. Chris Murphy shares how Democrats feel about government shutdown", "description": "\"Until we sit down and have a real negotiation, nothing is going to happen here,\" Democratic Sen. Chris Murphy told ABC News' Jay O'Brien about the government shutdown.", "content": "<ul><li>GOP congressman blames 'radical Democrats' for government shutdown\r\n</li><li>SCOTUS allows Lisa Cook to stay on Fed into 2026\r\n</li><li>Part of Bronx high-rise apartment building collapses, n… [+4466 chars]", "url": "https://abcnews.go.com/US/video/sen-chris-murphy-shares-democrats-feel-government-shutdown-126123710", "source": "ABC News", "published_at": "2025-10-01T16:55:53Z", "relevance_score": 0.185}, {"title": "WATCH: Israeli Prime Minister Netanyahu rejects formal recognition of Palestinian state", "description": "Israeli PM Benjamin Netanyahu was unequivocal in his rejection of the U.K., Canada and Australia recognizing a Palestinian state, saying in a statement Sunday, \"There will be no Palestinian state.\"", "content": "<ul><li>What to know about planned announcement by Trump on autism\r\n</li><li>Trump announcement about autism could 'raise so much fear,' says autism researcher\r\n</li><li>Jimmy Kimmel to return to air… [+4388 chars]", "url": "https://abcnews.go.com/International/video/israeli-prime-minister-netanyahu-rejects-formal-recognition-palestinian-125828319", "source": "ABC News", "published_at": "2025-09-22T19:56:28Z", "relevance_score": 0.185}, {"title": "WATCH: Tens of thousands attend Charlie Kirk memorial", "description": "Tens of thousands of people paid tribute to Charlie Kirk at his memorial on Sunday. Kirk was hailed a \"martyr\" by President Donald Trump and other leading conservative figures.", "content": "<ul><li>What Trump's call to prosecute enemies means for the justice system\r\n</li><li>WHO director on how a Palestinian state would impact humanitarian crisis\r\n</li><li>What it means to recognize a P… [+4362 chars]", "url": "https://abcnews.go.com/Travel/video/tens-thousands-attend-charlie-kirk-memorial-125818105", "source": "ABC News", "published_at": "2025-09-22T15:49:51Z", "relevance_score": 0.185}, {"title": "WATCH: Israel says it plans to double size of West Bank settlement", "description": "In response to countries recognizing Palestine as a state, Israel says it plans to expand one of its West Bank settlements.", "content": "<ul><li>Trump urges AG Bondi to investigate political enemies\r\n</li><li>Trump speaks at Charlie Kirk memorial\r\n</li><li>Several countries to formally recognize Palestinian statehood\r\n</li><li>Trump a… [+4303 chars]", "url": "https://abcnews.go.com/International/video/israel-plans-double-size-west-bank-settlement-125810547", "source": "ABC News", "published_at": "2025-09-22T12:13:20Z", "relevance_score": 0.18}, {"title": "‘Underwhelming’: China’s new climate target falls far short, experts say", "description": "Pledge to cut emissions by 7-10 percent does not go far enough, though renewables rollout a cause for hope, expert say.", "content": "Chinas new target for cutting greenhouse-gas emissions has been branded disappointing and underwhelming by climate experts, who warn the pledge falls far short of the action needed to avert climate c… [+5183 chars]", "url": "https://www.aljazeera.com/economy/2025/9/25/underwhelming-chinas-new-climate-target-falls-far-short-experts-say", "source": "Al Jazeera English", "published_at": "2025-09-25T04:23:13Z", "relevance_score": 0.165}, {"title": "Indonesia’s climate ambitions can’t shine in the dark", "description": "The Indonesian government cannot pursue an ambitious climate agenda while neglecting its human rights obligations.", "content": "On August 28, just before inequality protests spread like wildfire across Indonesia, the police blocked a peaceful climate march on the streets of Jakarta. Indigenous peoples, farmers, fisherfolk and… [+4235 chars]", "url": "https://www.aljazeera.com/opinions/2025/9/15/indonesias-climate-ambitions-cant-shine-in-the-dark", "source": "Al Jazeera English", "published_at": "2025-09-15T12:46:02Z", "relevance_score": 0.165}, {"title": "WATCH: Sean 'Diddy' Combs sentenced to 50 months in prison", "description": "Sean Combs sat expressionless in his seat when the judge sentenced him to just over four years in prison Friday for his conviction on two prostitution-related offenses.", "content": "<ul><li>Sean 'Diddy' Combs sentenced to more than 4 years in prison\r\n</li><li>Prince William opens about family, legacy and the future of the royals \r\n</li><li>Trump tells Israel to stop bombing afte… [+4736 chars]", "url": "https://abcnews.go.com/Entertainment/video/sean-diddy-combs-sentenced-50-months-prison-126211133", "source": "ABC News", "published_at": "2025-10-04T10:37:29Z", "relevance_score": 0.165}, {"title": "Scientists went hunting for freshwater deep beneath the Atlantic Ocean. What they found could have global implications", "description": "An international team of scientists spent three months at sea drilling into a huge, mysterious reservoir of freshwater under the salty ocean. They hope it...", "content": "This summer scientists drilled deep below the Atlantic Ocean off the coast of northeastern US and tapped into a huge, mysterious reservoir of freshwater what they discovered could have big implicatio… [+5767 chars]", "url": "https://www.cnn.com/2025/09/17/climate/freshwater-aquifer-atlantic-ocean-water-crisis", "source": "CNN", "published_at": "2025-09-17T11:00:06Z", "relevance_score": 0.16}, {"title": "Israel-Gaza live updates: Hamas says it will accept peace deal, with terms", "description": "U.S. President Donald Trump hosted Israeli Prime Minister Benjamin Netanyahu at the White House on Monday, proposing a Gaza ceasefire agreement.", "content": "The health system in Gaza is overwhelmed, with 42,000 Palestinians suffering life-changing injuries, according to the World Health Organization.\r\nThat includes more than 10,000 children, as the \"heal… [+905 chars]", "url": "https://abcnews.go.com/International/live-updates/israel-gaza-live-updates-missile-launched-israel-yemen/?id=126029953", "source": "ABC News", "published_at": "2025-10-03T20:09:50Z", "relevance_score": 0.16}, {"title": "What makes this year’s UN General Assembly so significant?", "description": "The United Nations General Assembly meets amid Gaza genocide, Ukraine war and global volatility.", "content": "The United Nations General Assembly meets amid Gaza genocide, Ukraine war and global volatility.The United Nations General Assembly is due to hold debates next week.\r\nCrises, including the Gaza genoc… [+492 chars]", "url": "https://www.aljazeera.com/video/inside-story/2025/9/16/what-makes-this-years-un-general-assembly-so-significant", "source": "Al Jazeera English", "published_at": "2025-09-16T20:10:08Z", "relevance_score": 0.16}, {"title": "At least nine dead in severe weather in Ukraine’s Odesa as war rumbles on", "description": "More than 350 people have been rescued after southern Ukrainian city was hit by two months of rain in just seven hours.", "content": "At least nine people, including one child, have been killed after a severe rainstorm and flooding in the southern Ukrainian city of Odesa, according to the countrys emergency services.\r\nA total of 36… [+3075 chars]", "url": "https://www.aljazeera.com/news/2025/10/1/at-least-9-dead-in-severe-weather-in-ukraines-odesa-as-war-rumbles-on", "source": "Al Jazeera English", "published_at": "2025-10-01T06:39:11Z", "relevance_score": 0.16}, {"title": "Super Typhoon Ragasa makes landfall in Philippines", "description": "Thousands seek shelter from gale-force winds as Typhoon Ragasa makes landfall on its way to southern China.", "content": "At least three people have been killed and thousands have been evacuated from villages and schools in Northern Philippines, while offices were closed, as one of this years strongest typhoons threaten… [+1512 chars]", "url": "https://www.aljazeera.com/gallery/2025/9/23/super-typhoon-ragasa-makes-landfall-in-philippines", "source": "Al Jazeera English", "published_at": "2025-09-23T07:34:47Z", "relevance_score": 0.16}, {"title": "US and China provoke sharp fall in global outlook for renewable power", "description": "Lowered support means capacity now expected to grow to no more than 4,600GW by 2030, 900GW lower than 2024 estimate.", "content": "The International Energy Agency (IEA) has scaled back its forecast for renewable power growth to 2030, citing weaker outlooks in the United States and China.\r\nThe Paris-based agency now projects tota… [+2136 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/us-and-china-provoke-sharp-fall-in-global-outlook-for-renewable-power", "source": "Al Jazeera English", "published_at": "2025-10-07T08:37:03Z", "relevance_score": 0.16}, {"title": "Dolphins’ Tyreek Hill suffers severe knee injury against Jets in NFL", "description": "The Miami Dolphins wide receiver suffered what is believed to be a season-ending injury against the New York Jets.", "content": "Dolphins standout receiver Tyreek Hill was carted off the field early in the third quarter of Miamis Monday game against the New York Jets with a potentially serious left knee injury.\r\nThe Dolphins q… [+1611 chars]", "url": "https://www.aljazeera.com/sports/2025/9/30/dolphins-tyreek-hill-suffers-severe-knee-injury-against-jets-in-nfl", "source": "Al Jazeera English", "published_at": "2025-09-30T05:06:59Z", "relevance_score": 0.16}, {"title": "Dismissed as a joke, UK's first rice crop ripe for picking after hot summer", "description": "Paddy fields are thriving in a quiet part of east England and might help feed us in the future.", "content": "\"I'm actually amazed because they are big, happy, bushy plants,\" she says, warning me not to fall over when we step into the calf-deep water.\r\nShe points out her favourites. \"This is Estrella from Co… [+1435 chars]", "url": "https://www.bbc.co.uk/news/articles/c1wgeq702dyo", "source": "BBC News", "published_at": "2025-09-28T07:44:07Z", "relevance_score": 0.155}, {"title": "WATCH: Landslide wipes out backyards of California homes", "description": "Part of a coastal bluff collapsed damaging several backyards and threatening homes in Rancho Palos Verdes, California.", "content": "<ul><li>GOP congressman blames 'radical Democrats' for government shutdown\r\n</li><li>SCOTUS allows Lisa Cook to stay on Fed into 2026\r\n</li><li>Part of Bronx high-rise apartment building collapses, n… [+4472 chars]", "url": "https://abcnews.go.com/US/video/landslide-wipes-backyards-california-homes-126109085", "source": "ABC News", "published_at": "2025-10-01T16:01:45Z", "relevance_score": 0.155}, {"title": "Taiwan leader promises robust air defence system amid rising China tensions", "description": "Lai pledges accelerated building of T-Dome system to enhance safety against frequent Chinese military manoeuvres.", "content": "Taiwans President William Lai Ching-te pledged to accelerate the building of a T-Dome air defence system in the face of military threats and overall increased defence spending.\r\nLai on Friday said hi… [+2090 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/taiwan-leader-promises-robust-air-defence-system-amid-rising-china-tensions", "source": "Al Jazeera English", "published_at": "2025-10-10T08:39:07Z", "relevance_score": 0.155}, {"title": "More turmoil at Virginia US attorney's office: 2 top prosecutors fired, sources say", "description": "Two top attorneys in the U.S. Attorney's Office for the Eastern District of Virginia have been fired from their jobs in recent days, sources told ABC.", "content": "One of the preeminent U.S. attorney's offices in the country is facing mounting turmoil in the wake of the move last week by a Trump-installed prosecutor to indict former FBI Director James Comey.\r\nT… [+2591 chars]", "url": "https://abcnews.go.com/Politics/turmoil-virginia-us-attorneys-office-comey-indictment-2/story?id=126138109", "source": "ABC News", "published_at": "2025-10-02T15:17:21Z", "relevance_score": 0.155}, {"title": "WATCH: Part of high-rise apartment building collapses in New York City", "description": "An investigation is underway after an explosion in the Bronx caused part of a NYCHA apartment building to collapse on Wednesday morning.", "content": "<ul><li>2 planes clip each other after hard landing at LGA\r\n</li><li>American families caught in the middle as government shutdown enters day 2\r\n</li><li>UK police respond to suspected stabbing and c… [+4604 chars]", "url": "https://abcnews.go.com/US/video/part-high-rise-apartment-building-collapses-new-york-126150869", "source": "ABC News", "published_at": "2025-10-02T13:28:43Z", "relevance_score": 0.155}, {"title": "Zelenskyy praises 'well-informed' Trump after president's Russia war pivot", "description": "Ukrainian President Volodymyr Zelenskyy praised his “productive meeting” with U.S. President Donald Trump on the sidelines of the United Nations General Assembly.", "content": "LONDON -- Ukrainian President Volodymyr Zelenskyy praised his \"productive meeting\" with U.S. President Donald Trump on the sidelines of the United Nations General Assembly on Tuesday, after which Tru… [+4662 chars]", "url": "https://abcnews.go.com/International/zelenskyy-praises-informed-trump-after-presidents-russia-war/story?id=125882498", "source": "ABC News", "published_at": "2025-09-24T08:28:49Z", "relevance_score": 0.155}, {"title": "You thought it was fall? A major pattern shift is coming", "description": "The crisp weather many in the United States enjoyed over the last week or two was just a sneak peek of fall: Late summer heat is making a comeback.", "content": "Anyone whos drinking hot pumpkin spice lattes in a chunky sweater may need to rein it in for a little while. The crisp weather many in the United States enjoyed over the last week or two was just a s… [+2772 chars]", "url": "https://www.cnn.com/2025/09/11/weather/false-fall-summer-heat-climate", "source": "CNN", "published_at": "2025-09-12T06:04:11Z", "relevance_score": 0.155}, {"title": "2-year-old boy missing after California flash flood sweeps away car", "description": "A 2-year-old boy remains missing after being swept away by flash floods in Barstow, California. His father was rescued as volunteers joined the search.", "content": "A desperate search is underway in Barstow, California, for a 2-year-old boy who was swept away by floodwaters Thursday evening, authorities said.\r\nXavier Padilla Aguilera was traveling with his fathe… [+1694 chars]", "url": "https://abcnews.go.com/US/2-year-boy-missing-after-california-flash-flood/story?id=125739987", "source": "ABC News", "published_at": "2025-09-19T16:58:17Z", "relevance_score": 0.155}, {"title": "Hundreds of thousands evacuate as Vietnam braces for Typhoon Bualoi", "description": "Three fishermen are reported missing after their vessels sank off the coast of Quang Tri province.", "content": "Vietnam has mobilised some 100,000 military personnel to help 250,000 people evacuate as intensifying Typhoon Bualoi barrels towards the country, forcing the government to shut down several airports.… [+2928 chars]", "url": "https://www.aljazeera.com/news/2025/9/28/hundreds-of-thousands-evacuate-as-vietnam-braces-for-typhoon-bualoi", "source": "Al Jazeera English", "published_at": "2025-09-28T07:14:29Z", "relevance_score": 0.155}, {"title": "WATCH: Small plane makes emergency landing on racetrack", "description": "A small aircraft made an emergency landing at one of America’s oldest racetracks. The pilot was uninjured and the passenger was treated for minor injuries.", "content": "<ul><li>Trump urges AG Bondi to investigate political enemies\r\n</li><li>Trump speaks at Charlie Kirk memorial\r\n</li><li>Several countries to formally recognize Palestinian statehood\r\n</li><li>Trump a… [+4303 chars]", "url": "https://abcnews.go.com/US/video/small-plane-makes-emergency-landing-racetrack-125810456", "source": "ABC News", "published_at": "2025-09-22T12:13:11Z", "relevance_score": 0.15}, {"title": "Tropical storm kills at least 4, displaces 400,000 in Philippines", "description": "Tropical Storm Bualoi, the 15th tropical cyclone to hit the Philippines in 2025, on a course towards Vietnam.", "content": "A tropical storm has killed at least four people and displaced hundreds of thousands as it battered the Philippines, triggering floods and mudslides, just days after a deadly super typhoon caused cha… [+3034 chars]", "url": "https://www.aljazeera.com/news/2025/9/26/tropical-storm-kills-at-least-4-displaces-400000-in-philippines", "source": "Al Jazeera English", "published_at": "2025-09-26T07:44:23Z", "relevance_score": 0.13}, {"title": "Scams & Scandals", "description": "Exposing dangerous medical professionals breaking rules in Britain's \"Botox Wild West\".", "content": "An undercover investigation exposes Britain's \"Botox Wild West\" where medical professionals break the rules, selling prescriptions for cash, with patients left at serious risk. More", "url": "https://www.bbc.co.uk/iplayer/episode/m002k7bt/scams-scandals-the-botox-black-market?at_medium=RSS&at_campaign=rss", "source": "BBC News", "published_at": "2025-09-29T23:01:00Z", "relevance_score": 0.13}, {"title": "WATCH: What does the government shutdown mean for you and your family?", "description": "ABC News' senior White House correspondent Selina Wang answers the most searched questions on the first day of the government shutdown.", "content": "<ul><li>2 planes clip each other after hard landing at LGA\r\n</li><li>American families caught in the middle as government shutdown enters day 2\r\n</li><li>UK police respond to suspected stabbing and c… [+4604 chars]", "url": "https://abcnews.go.com/US/video/government-shutdown-family-126150783", "source": "ABC News", "published_at": "2025-10-02T13:26:38Z", "relevance_score": 0.125}, {"title": "First treaty to protect marine life in high seas to take effect in January", "description": "World's first-ever pact aims to fight threats like climate change, over-fishing and deep-sea mining.", "content": "The first-ever treaty to protect marine diversity in international waters will come into force early next year, after it was ratified by the 60th nation, Morocco.\r\nMoroccos formal adoption of the Mar… [+5967 chars]", "url": "https://www.aljazeera.com/news/2025/9/20/first-treaty-to-protect-marine-life-in-high-seas-to-take-effect-in-january", "source": "Al Jazeera English", "published_at": "2025-09-20T07:28:35Z", "relevance_score": 0.12}, {"title": "Russian attack hits passenger train in Ukraine’s Sumy, causing casualties", "description": "No figure has been given for the number of casualties in Moscow's latest attack on Ukraine's railway infrastructure.", "content": "A Russian strike has hit a passenger train in Ukraines northern Sumy region, resulting in casualties among the passengers, as Moscow continues its near-daily targeting of Ukraines railway infrastruct… [+1194 chars]", "url": "https://www.aljazeera.com/news/2025/10/4/russian-attack-hits-passenger-train-in-ukraines-sumy-causing-casualties", "source": "Al Jazeera English", "published_at": "2025-10-04T10:41:43Z", "relevance_score": 0.12}, {"title": "WATCH: US kills 4 alleged narco-terrorists in strike off coast of Venezuela, Hegseth says", "description": "Secretary Pete Hegseth announced Friday that the U.S. ordered a strike on another alleged drug boat that left Venezuela.", "content": "<ul><li>A look at government shutdown's potential impact on education, student loans\r\n</li><li>Protesters clash with federal agents in Chicago as ICE raids continue\r\n</li><li>Hegseth announces anothe… [+4632 chars]", "url": "https://abcnews.go.com/International/video/us-kills-4-alleged-narco-terrorists-strike-off-126198083", "source": "ABC News", "published_at": "2025-10-03T20:01:57Z", "relevance_score": 0.12}, {"title": "LIVE: Police arrest 22-year-old Tyler Robinson for Charlie Kirk’s murder", "description": "Robinson was arrested on charges of aggravated murder and felony discharge of a firearm causing serious bodily harm.", "content": "blinking-dot\r\nLive updatesLive updates, \r\nRobinson was arrested on charges of aggravated murder and felony discharge of a firearm causing serious bodily harm.", "url": "https://www.aljazeera.com/news/liveblog/2025/9/13/live-police-arrest-22-year-old-tyler-robinson-for-charlie-kirks-murder", "source": "Al Jazeera English", "published_at": "2025-09-13T00:00:00Z", "relevance_score": 0.10500000000000001}, {"title": "Russia carries out 'massive' attack across Ukraine", "description": "Russia carried out a “massive” attack across Ukraine Friday night into Saturday morning, using more than 600 drones and missiles, according to the Ukrainian Air Force.", "content": "Russia carried out a massive attack across Ukraine Friday night into Saturday morning, using more than 600 drones and missiles, according to the Ukrainian Air Force.\r\nUkraines air defense systems rep… [+2197 chars]", "url": "https://abcnews.go.com/International/russia-carries-massive-attack-ukraine/story?id=125760730", "source": "ABC News", "published_at": "2025-09-20T08:18:05Z", "relevance_score": 0.10500000000000001}, {"title": "Starbucks to close stores, lay off 900 workers as part of turnaround plan", "description": "Starbucks is laying off around 900 non-retail employees and closing some U.S. and Canadian stores as it focuses more of its resources on reviving its brand", "content": "Starbucks is laying off around 900 non-retail employees and closing some U.S. and Canadian stores as it focuses more of its resources on a turnaround.\r\nThe Seattle coffee giant will notify employees … [+1262 chars]", "url": "https://abcnews.go.com/Business/wireStory/starbucks-close-stores-lay-off-900-workers-part-125922316", "source": "ABC News", "published_at": "2025-09-25T12:17:50Z", "relevance_score": 0.10500000000000001}, {"title": "Seven things to know about Trump’s UNGA speech", "description": "Donald Trump’s UN speech made waves on wars, climate, and the economy. Jillian Wolf checks the facts behind the claims.", "content": "Donald Trumps UN speech made waves on wars, climate, and the economy. Jillian Wolf checks the facts behind the claims.Donald Trumps UNGA speech has drawn headlines for his comments on ending wars, cl… [+452 chars]", "url": "https://www.aljazeera.com/video/fact-check/2025/9/24/seven-things-to-know-about-trumps-unga-speech", "source": "Al Jazeera English", "published_at": "2025-09-24T22:24:36Z", "relevance_score": 0.075}, {"title": "WATCH: Hamas responds to President Trump's proposal to end Gaza war", "description": "Hamas responded to President Trump's proposal for peace in Gaza, saying it will release all remaining hostages if Israel withdraws from Gaza and \"proper field conditions are met.\"", "content": "<ul><li>Sean 'Diddy' Combs sentenced to more than 4 years in prison\r\n</li><li>Prince William opens about family, legacy and the future of the royals \r\n</li><li>Trump tells Israel to stop bombing afte… [+4736 chars]", "url": "https://abcnews.go.com/International/video/hamas-responds-president-trumps-proposal-end-gaza-war-126211226", "source": "ABC News", "published_at": "2025-10-04T10:37:39Z", "relevance_score": 0.075}, {"title": "Fast-paced zombie horror starring Brad Pitt", "description": "Former United Nations employee Gerry Lane (Brad Pitt) is called in to help stop the pandemic that has spread around the world. Zombie horror.", "content": "Contains prolonged violence.\r\nFormer United Nations employee Gerry Lane (Brad Pitt) is called in to help stop the pandemic that has spread around the world. Zombie horror. More", "url": "https://www.bbc.co.uk/iplayer/episode/m002jkgd/world-war-z?at_mid=yMffwrv6JX&at_campaign=World_War_Z&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002jkgd&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=World_War_Z&at_bbc_team=BBC&at_creation=film", "source": "BBC News", "published_at": "2025-09-15T05:00:00Z", "relevance_score": 0.075}, {"title": "Death of a rainmaker: When drought means murder in South Sudan", "description": "For a group of people whose job means life, climate change can spell death.", "content": "Torit, South Sudan Solomon Oture was on the run.\r\nAs a rainmaker, his job was to summon rain the lifeblood of his small farming community through prayer and ritual.\r\nlist of 3 itemsend of list\r\nBut a… [+19086 chars]", "url": "https://www.aljazeera.com/features/2025/10/3/death-of-a-rainmaker-when-drought-means-murder-in-south-sudan", "source": "Al Jazeera English", "published_at": "2025-10-03T06:52:57Z", "relevance_score": 0.07}, {"title": "Flash flooding threat could return in parts of western US", "description": "Some pop-up showers and thunderstorms are possible on Saturday but there is no organized threat of flash flooding on Saturday as tropical moisture begins to thin out.", "content": "Some pop-up showers and thunderstorms are possible on Saturday, mainly to the north of areas hit hardest by flash flooding recently, but there is no organized threat of flash flooding today as tropic… [+3120 chars]", "url": "https://abcnews.go.com/US/flash-flooding-threat-return-west-gabrielle-churns-atlantic/story?id=125764656", "source": "ABC News", "published_at": "2025-09-20T18:07:13Z", "relevance_score": 0.07}, {"title": "Charlie Kirk memorial service set for Sunday with Trump, Vance to speak", "description": "Charlie Kirk's memorial service will take place on Sunday, little more than a week after his murder sent shockwaves through American politics.", "content": "Conservative activist Charlie Kirk's memorial service will take place on Sunday, little more than a week after his murder sent shockwaves through American politics.\r\nPresident Donald Trump, Vice Pres… [+3428 chars]", "url": "https://abcnews.go.com/Politics/charlie-kirk-memorial-service-set-sunday-trump-vance/story?id=125735564", "source": "ABC News", "published_at": "2025-09-20T09:12:16Z", "relevance_score": 0.07}, {"title": "Drier weather threatens India’s tea exports, global supply", "description": "Climate extremes shrink Assam tea harvests, increase costs, reduce exports, and reshape the global industry and prices.", "content": "Under blazing skies at a tea plantation in Indias northeastern state of Assam, worker Kamini Kurmi wears an umbrella fastened over her head to keep her hands free to pluck delicate leaves from the bu… [+3598 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/8/drier-weather-threatens-indias-tea-exports-global-supply", "source": "Al Jazeera English", "published_at": "2025-10-08T10:12:28Z", "relevance_score": 0.065}, {"title": "Trump seeks expedited Supreme Court review of birthright citizenship executive order", "description": "President Trump is asking the Supreme Court for a definitive ruling on his reinterpretation of more than a century of legal precedent around birthright citizenship.", "content": "President Donald Trump praised the U.S. Supreme Court in June for a \"monumental victory\" when it rolled back nationwide injunctions against his executive order attempting to end birthright citizenshi… [+5133 chars]", "url": "https://abcnews.go.com/Politics/trump-seeks-expedited-supreme-court-review-birthright-citizenship/story?id=126025758", "source": "ABC News", "published_at": "2025-09-29T00:22:31Z", "relevance_score": 0.065}, {"title": "WATCH: President Trump calls on Hamas to accept peace proposal", "description": "The president called on Hamas to accept what he called an \"extremely fair\" proposal to end the war in Gaza and return the hostages to Israel.", "content": "<ul><li>Hegseth rails against 'woke,' lays out standards in speech to top generals\r\n</li><li>Countdown to possible government shutdown\r\n</li><li>Trump meets with Netanyahu\r\n</li><li>New details in de… [+4499 chars]", "url": "https://abcnews.go.com/Politics/video/president-trump-calls-hamas-accept-proposal-peace-126076078", "source": "ABC News", "published_at": "2025-09-30T13:27:25Z", "relevance_score": 0.065}, {"title": "WATCH: Government shutdown enters day 2", "description": "The next vote on bills that could get federal money flowing again is not scheduled until Friday, as thousands of workers remain furloughed and many government services are at a standstill.", "content": "<ul><li>White House: Cuts to federal programs, firings 'very real'\r\n</li><li>Arrests made in deadly UK synagogue stabbing\r\n</li><li>How everyday Americans feel about the government shutdown\r\n</li><li… [+4576 chars]", "url": "https://abcnews.go.com/US/video/government-shutdown-enters-day-2-126157768", "source": "ABC News", "published_at": "2025-10-02T17:25:46Z", "relevance_score": 0.06}, {"title": "Police fire tear gas as violence erupts in Madagascar protests", "description": "Security forces fire rubber bullets at protesters in Madagascar in eruption of violence causing civil society alarm.", "content": "Thousands of antigovernment protesters have marched through Madagascars capital, with several sustaining injuries when police forcefully dispersed the latest demonstration in a two-week youth-led mov… [+2035 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/10/police-fire-tear-gas-as-violence-erupts-in-madagascar-protests", "source": "Al Jazeera English", "published_at": "2025-10-10T07:28:42Z", "relevance_score": 0.04}, {"title": "A legendary Jimi Hendrix performance from 1970", "description": "A documentary that highlights America's last great rock festival and Jimi Hendrix's legendary performance as its headline act on 4 July 1970.", "content": "A documentary that highlights America's last great rock festival and Jimi Hendrix's legendary performance as its headline act on 4 July 1970. More", "url": "https://www.bbc.co.uk/iplayer/episode/m002jmlr/jimi-hendrix-electric-church?at_mid=0mxIP2qXf1&at_campaign=Jimi_Hendrix_Electric_Church&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002jmlr&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Jimi_Hendrix_Electric_Church&at_bbc_team=BBC", "source": "BBC News", "published_at": "2025-09-19T21:31:49Z", "relevance_score": 0.04}, {"title": "The Football Interview", "description": "Kelly Somers speaks to Alessia Russo, two-time European champion with the Lionesses and a Champions League winner with Arsenal last season.", "content": "Kelly Somers speaks to Alessia Russo, two-time European champion with the Lionesses and a Champions League winner with Arsenal last season.  More", "url": "https://www.bbc.co.uk/iplayer/episode/m002k5nx/the-football-interview-series-1-6-alessia-russo?at_medium=RSS&at_campaign=rss", "source": "BBC News", "published_at": "2025-09-20T05:00:00Z", "relevance_score": 0.04}, {"title": "Watch on iPlayer: Access All Areas - When Country Comes to Town", "description": "Go behind the scenes as the Grand Ole Opry goes live in London. For one night only, country's biggest stars, such as Luke Combs and Carly Pearce, take to the stage of the Royal Albert Hall.", "content": "Go behind the scenes as the Grand Ole Opry goes live in London. For one night only, country's biggest stars, such as Luke Combs and Carly Pearce, take to the stage of the Royal Albert Hall. More", "url": "https://www.bbc.co.uk/iplayer/episode/m002k6z4/access-all-areas-when-country-comes-to-town?at_medium=RSS&at_campaign=rss", "source": "BBC News", "published_at": "2025-10-02T13:00:00Z", "relevance_score": 0.04}, {"title": "WATCH: The US government has shut down for the first time in nearly 7 years", "description": "The federal government is officially shut down. ABC News' Jay O'Brien explains how we got here.", "content": "<ul><li>Larger tanks super-sizing nitrous oxide abuse, lawsuit says\r\n</li><li>Teen shark attack survivor shares her recovery journey \r\n</li><li>Trump, Hegseth address military leaders outlining visio… [+4495 chars]", "url": "https://abcnews.go.com/US/video/us-government-shut-time-7-years-126108986", "source": "ABC News", "published_at": "2025-10-01T11:18:08Z", "relevance_score": 0.035}, {"title": "WATCH: Social media car stunt challenges turn deadly", "description": "Two teens accused of driving recklessly while attempting \"dangerous social media challenges\" have been charged in stunts that left one dead and another with permanent brain damage, prosecutors said.", "content": "<ul><li>Rubio meets with Russia's Lavrov after Trump's shift on Russia and Ukraine\r\n</li><li>What are the chances of a government shutdown?\r\n</li><li>Multiple people shot at ICE facility in Texas\r\n</… [+4538 chars]", "url": "https://abcnews.go.com/US/video/social-media-car-stunt-challenges-turn-deadly-125906016", "source": "ABC News", "published_at": "2025-09-24T20:08:10Z", "relevance_score": 0.035}, {"title": "WATCH: Crypto scam almost costs woman her life savings", "description": "The FBI says scams perpetrated using bitcoin ATMs cost Americans nearly $250 million in 2024, more than double the sum from the previous year.", "content": "<ul><li>Major challenges lie ahead for Gaza, Israel if ceasefire deal rolls out\r\n</li><li>Trump's use of the National Guard faces critical legal tests\r\n</li><li>'My kids could die': Mom begs Johnson … [+4641 chars]", "url": "https://abcnews.go.com/US/video/crypto-scam-costs-woman-life-savings-126369926", "source": "ABC News", "published_at": "2025-10-09T15:58:02Z", "relevance_score": 0.035}, {"title": "Exposure to mining fossil fuel linked to ALS, new research finds", "description": "A major pollutant from fossil fuels has been linked to an increased risk of amyotrophic lateral sclerosis (ALS), according to new research.", "content": "A major pollutant from mining fossil fuels has been linked to an increased risk of amyotrophic lateral sclerosis (ALS), according to new research.\r\nLongterm exposure to sulfur dioxide, a component pr… [+2800 chars]", "url": "https://abcnews.go.com/Health/exposure-mining-fossil-fuel-linked-als-new-research/story?id=126254429", "source": "ABC News", "published_at": "2025-10-06T23:05:13Z", "relevance_score": 0.035}, {"title": "Trump staffer leaving White House in highest-profile exit yet of second term", "description": "Taylor Budowich, President Donald Trump’s deputy chief of staff overseeing communications, will leave the administration later this month for a new job, a...", "content": "Taylor Budowich, President Donald Trumps deputy chief of staff overseeing communications, will leave the administration later this month for a new job, a source familiar with the matter told CNN.\r\nHi… [+850 chars]", "url": "https://www.cnn.com/2025/09/24/politics/taylor-budowich-departure-white-house", "source": "CNN", "published_at": "2025-09-24T21:34:12Z", "relevance_score": 0.035}, {"title": "WATCH: Fact-checking JD Vance's comments regarding government shutdown", "description": "ABC News' Katherine Faulders fact-checks the vice president's comments on the partisan divide hindering the passage of a funding deal.", "content": "<ul><li>2 planes clip each other after hard landing at LGA\r\n</li><li>American families caught in the middle as government shutdown enters day 2\r\n</li><li>UK police respond to suspected stabbing and c… [+4604 chars]", "url": "https://abcnews.go.com/US/video/fact-checking-jd-vances-comments-government-shutdown-126150594", "source": "ABC News", "published_at": "2025-10-02T13:26:07Z", "relevance_score": 0.035}, {"title": "WATCH: Jimmy Kimmel returns to ABC on Tuesday after suspension", "description": "Jimmy Kimmel is set to return to the air Tuesday night on ABC, The Walt Disney Company said.", "content": "<ul><li>What to know about planned announcement by Trump on autism\r\n</li><li>Trump announcement about autism could 'raise so much fear,' says autism researcher\r\n</li><li>Jimmy Kimmel to return to air… [+4388 chars]", "url": "https://abcnews.go.com/Entertainment/video/jimmy-kimmel-returns-abc-tuesday-after-suspension-125830156", "source": "ABC News", "published_at": "2025-09-22T20:42:36Z", "relevance_score": 0.035}, {"title": "Watch: World Athletics Championships day five highlights", "description": "Can Josh Kerr defend the 1,500m world title he claimed in Budapest two years ago? Sarah Mulkerrins present highlights of all the track and field action from the Athletics World Championships in Tokyo.", "content": "Can Josh Kerr defend the 1,500m world title he claimed in Budapest two years ago? Sarah Mulkerrins present highlights of all the track and field action from the Athletics World Championships in Tokyo… [+5 chars]", "url": "https://www.bbc.co.uk/iplayer/episode/m002jml3/world-athletics-championships-tokyo-2025-day-5-highlights?at_medium=RSS&at_campaign=rss", "source": "BBC News", "published_at": "2025-09-17T16:06:49Z", "relevance_score": 0.035}, {"title": "Hundreds of Everest hikers reach safety after snowstorm in Tibetan valley", "description": "Those rescued included guides, yak herders and trekkers, who were trapped in a heavy snowstorm that began on Friday.", "content": "Hundreds of hikers, local guides and yak herders have now reached safety after becoming stranded in freezing temperatures by a heavy snowstorm over the weekend on the east face of Mount Everest in Ti… [+3023 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/hundreds-of-everest-hikers-reach-safety-after-snowstorm-in-tibetan-valley", "source": "Al Jazeera English", "published_at": "2025-10-08T05:03:31Z", "relevance_score": 0.035}, {"title": "National Hurricane Center monitoring multiple tropical systems in the Atlantic", "description": "Disturbances in the Atlantic Basin could soon form into tropical systems.", "content": "Tropical activity is ramping up in the Atlantic Basin.\r\nAlong with Hurricane Gabrielle, which is currently tracking east of Bermuda, the National Hurricane Center is monitoring two tropical disturban… [+2788 chars]", "url": "https://abcnews.go.com/US/national-hurricane-center-monitoring-multiple-tropical-systems-atlantic/story?id=125816236", "source": "ABC News", "published_at": "2025-09-23T09:03:04Z", "relevance_score": 0.035}, {"title": "Tropical Storm Jerry forms in central Atlantic: Where it's heading next", "description": "The storm is following a similar pattern to other tropical systems this season.", "content": "A new tropical storm has formed in the Atlantic Ocean, but it will likely follow the pattern of other storms that have stayed mostly out to sea, forecasts show.\r\nTropical Storm Jerry formed in the ce… [+1823 chars]", "url": "https://abcnews.go.com/US/tropical-storm-jerry-forms-central-atlantic-heading/story?id=126289770", "source": "ABC News", "published_at": "2025-10-07T20:27:00Z", "relevance_score": 0.03}, {"title": "China moving away from fossil fuels sends “strong signal”", "description": "“A million people in China had to evacuate because of a typhoon.”", "content": "Quotable\r\nA million people in China had to evacuate because of a typhoon.\r\nRead moreErin Sikorsky of the Center for Climate and Security explains why China saying its moving away from fossil fuels is… [+57 chars]", "url": "https://www.aljazeera.com/video/quotable/2025/9/25/china-moving-away-from-fossil-fuels-sends-strong", "source": "Al Jazeera English", "published_at": "2025-09-25T09:14:10Z", "relevance_score": 0.020000000000000004}, {"title": "Namibia deploys army to fight fire in one of Africa’s largest reserves", "description": "The fire has burned through one-third of Etosha National Park, home to the endangered black rhinoceros.", "content": "Namibia has deployed more than 500 soldiers to help fight a fire that has burned through a third of the vast Etosha National Park, one of Africas largest wildlife reserves, Prime Minister Tjitunga Ng… [+4063 chars]", "url": "https://www.aljazeera.com/news/2025/9/29/namibia-deploys-army-to-fight-fire-in-one-of-africas-largest-reserves", "source": "Al Jazeera English", "published_at": "2025-09-29T06:39:01Z", "relevance_score": 0.010000000000000002}, {"title": "WATCH: Climber scales exterior of airborne glider", "description": "A climber became the first person to master a climbing route on a flying glider.", "content": "<ul><li>GOP congressman blames 'radical Democrats' for government shutdown\r\n</li><li>SCOTUS allows Lisa Cook to stay on Fed into 2026\r\n</li><li>Part of Bronx high-rise apartment building collapses, n… [+4472 chars]", "url": "https://abcnews.go.com/Lifestyle/video/climber-scales-exterior-airborne-glider-126109077", "source": "ABC News", "published_at": "2025-10-01T15:59:10Z", "relevance_score": 0.005000000000000001}, {"title": "5 things to know for Oct. 10: Government shutdown, Gaza ceasefire plan, Nobel Peace Prize, Letitia James, Philippines quake", "description": "CNN’s 5 Things AM brings you the news you need to know every morning.", "content": "Travelers waiting in airport security lines across the US will now be met with a new video blaming Democratic lawmakers for the government shutdown. Its a notable departure from standard practice, as… [+5601 chars]", "url": "https://www.cnn.com/2025/10/10/us/5-things-to-know-for-oct-10-government-shutdown-gaza-ceasefire-plan-nobel-peace-prize-letitia-james-philippines-quake", "source": "CNN", "published_at": "2025-10-10T10:35:04Z", "relevance_score": 0.005000000000000001}, {"title": "World Athletics Championships", "description": "It’s a busy day at the World Athletics Championship in Tokyo, with Katarina Johnson-Thompson starting the defence of her heptathlon title.", "content": "Its a busy day at the World Athletics Championship in Tokyo, with Katarina Johnson-Thompson starting the defence of her heptathlon title. More", "url": "https://www.bbc.co.uk/iplayer/episode/m002jmlv/world-athletics-championships-tokyo-2025-day-7-highlights?at_medium=RSS&at_campaign=rss", "source": "BBC News", "published_at": "2025-09-19T16:05:24Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Carnival ride malfunctions at California school event", "description": "Riders were reportedly trapped for up to an hour after a carnival ride malfunction at a school event in Southern California. No injuries were reported.", "content": "<ul><li>Hegseth rails against 'woke,' lays out standards in speech to top generals\r\n</li><li>Countdown to possible government shutdown\r\n</li><li>Trump meets with Netanyahu\r\n</li><li>New details in de… [+4499 chars]", "url": "https://abcnews.go.com/US/video/carnival-ride-malfunctions-california-school-event-126076257", "source": "ABC News", "published_at": "2025-09-30T13:27:19Z", "relevance_score": 0.005000000000000001}, {"title": "Watch: World Athletics Championships day nine highlights", "description": "The World Athletics Championships bid farewell to Tokyo, but not before Great Britain’s Olympic champion Keely Hodgkinson has a chance to add world gold to her collection.", "content": "The World Athletics Championships bid farewell to Tokyo, but not before Great Britains Olympic champion Keely Hodgkinson has a chance to add world gold to her collection. More", "url": "https://www.bbc.co.uk/iplayer/episode/m002jy1s/world-athletics-championships-tokyo-2025-day-9-highlights?at_medium=RSS&at_campaign=rss", "source": "BBC News", "published_at": "2025-09-21T16:07:21Z", "relevance_score": 0.005000000000000001}, {"title": "Strong winds at Mount St. Helens stirs up ash from 1980 eruption", "description": "Strong winds across parts of Washington state have kicked up volcanic ash deposited during the 1980 Mount St. Helens eruption.", "content": "Strong winds across parts of Washington state have kicked up volcanic ash deposited during the 1980 eruption of Mount St. Helens, creating hazy conditions and reducing air quality.\r\nThe phenomenon, k… [+979 chars]", "url": "https://abcnews.go.com/US/strong-winds-mount-st-helens-stirs-ash-1980/story?id=125641981", "source": "ABC News", "published_at": "2025-09-16T21:38:56Z", "relevance_score": 0.005000000000000001}, {"title": "Trump says NATO countries should shoot down Russian aircraft that violate airspace", "description": "Trump also pressured European countries to stop buying Russian oil.", "content": "President Donald Trump on Tuesday said NATO countries should shoot down Russian aircraft if they enter their airspace.\r\nThe comments came as Trump met with Ukrainian President Volodymyr Zelenskyy on … [+3133 chars]", "url": "https://abcnews.go.com/Politics/trump-nato-countries-shoot-russian-aircraft-violate-airspace/story?id=125864554", "source": "ABC News", "published_at": "2025-09-23T20:33:01Z", "relevance_score": 0.0}, {"title": "Students at Utah Valley University return to campus a week after Charlie Kirk killing", "description": "Students at Utah Valley University return to campus on Wednesday, one week after conservative influencer Charlie Kirk was killed while holding an event at the college.", "content": "Students at Utah Valley University are returning to campus on Wednesday, one week after conservative influencer Charlie Kirk was killed while holding an outdoor event at the university.\r\nHope Ledkins… [+3643 chars]", "url": "https://abcnews.go.com/US/students-utah-valley-university-return-charlie-kirk/story?id=125663166", "source": "ABC News", "published_at": "2025-09-17T16:17:53Z", "relevance_score": 0.0}]}