{"timestamp": 1760206404.4726322, "data": {"url": "https://www.nature.com/articles/s41558-020-0893-y", "title": "Ice-sheet losses track high-end sea-level rise projections", "text": "This work is an outcome of the Ice-sheet Mass Balance Inter-Comparison Exercise (IMBIE) supported by the ESA Climate Change Initiative and the NASA Cryosphere Program. T.S. was funded by the NERC Centre for Polar Observation and Modelling through a Natural Environment Research Council (cpom300001) grant, and A.E.H. was funded by a NERC Fellowship (NE/R012407/1). R.M. acknowledges the support of the ESA CCI+ for Greenland ice-sheet under ESA-ESRIN contract number 4000104815/11/I-NB and the Danish State through the National Centre for Climate Research (NCKF). We thank the European Space Agency, National Aeronautics Space Administration and the German Aerospace Centre for provision of satellite data, without which this study would not have been possible. We also thank A. Shepherd for leading IMBIE, which produced the reconciled observations of ice-sheet mass change, and for useful discussions during the course of this study. The satellite data used here are freely available at http://imbie.org/data-downloads/, and IPCC sea-level rise projections can be downloaded from http://www.climatechange2013.org/report/full-report.", "authors": ["Anna E"], "published_date": "2020-08-31T00:00:00", "top_image": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41558-020-0893-y/MediaObjects/41558_2020_893_Fig1_HTML.png", "summary": "This work is an outcome of the Ice-sheet Mass Balance Inter-Comparison Exercise (IMBIE) supported by the ESA Climate Change Initiative and the NASA Cryosphere Program.\nwas funded by the NERC Centre for Polar Observation and Modelling through a Natural Environment Research Council (cpom300001) grant, and A.E.H.\nacknowledges the support of the ESA CCI+ for Greenland ice-sheet under ESA-ESRIN contract number 4000104815/11/I-NB and the Danish State through the National Centre for Climate Research (NCKF).\nWe also thank A. Shepherd for leading IMBIE, which produced the reconciled observations of ice-sheet mass change, and for useful discussions during the course of this study.\nThe satellite data used here are freely available at http://imbie.org/data-downloads/, and IPCC sea-level rise projections can be downloaded from http://www.climatechange2013.org/report/full-report.", "keywords": ["losses", "track", "high-end", "sea-level", "rise", "projections", "ice-sheet", "imbie", "centre", "mass", "esa", "climate", "change", "funded", "nerc", "research", "national", "space", "satellite", "data", "study", "http", "org", "work", "outcome", "balance", "inter-comparison", "exercise", "supported", "initiative", "nasa", "cryosphere", "program", "s", "polar"], "success": true, "error": null}}