{"timestamp": 1760045104.6009622, "data": [{"title": "Most venomous Indian snakes could become more dangerous due to climate change: Study", "description": "Climate change is pushing venomous snakes into new territories across India, a recent study reveals. This alarming trend threatens vulnerable rural communities, already grappling with high snakebite fatalities and limited healthcare access. Researchers warn t…", "content": "Navratri 2025: Shraddha Kapoor, Alia Bhatt, and other divas' inspired pink ethnic looks for day 9", "url": "https://timesofindia.indiatimes.com/etimes/trending/indias-most-venomous-snakes-are-to-become-more-dangerous-study-warns-how-climate-change-could-make-people-vulnerable/articleshow/124337053.cms", "source": "The Times of India", "published_at": "2025-10-06T12:20:32Z", "relevance_score": 0.84}, {"title": "Inhalers for asthma, COPD are climate change contributors, study finds", "description": "\"These emissions drive global warming, exacerbating the very respiratory conditions inhalers are meant to relieve,\" researchers wrote.", "content": "Inhalers that provide fast-acting treatment for people with certain respiratory conditions are contributing to greenhouse gas emissions, which can worsen both climate change and the conditions themse… [+2242 chars]", "url": "https://www.cbsnews.com/news/inhalers-produce-carbon-emissions-study/", "source": "CBS News", "published_at": "2025-10-07T20:58:55Z", "relevance_score": 0.6599999999999999}, {"title": "Death of a rainmaker: When drought means murder in South Sudan", "description": "For a group of people whose job means life, climate change can spell death.", "content": "Torit, South Sudan Solomon Oture was on the run.\r\nAs a rainmaker, his job was to summon rain the lifeblood of his small farming community through prayer and ritual.\r\nlist of 3 itemsend of list\r\nBut a… [+19086 chars]", "url": "https://www.aljazeera.com/features/2025/10/3/death-of-a-rainmaker-when-drought-means-murder-in-south-sudan", "source": "Al Jazeera English", "published_at": "2025-10-03T06:52:57Z", "relevance_score": 0.24}, {"title": "New Democrat think tank aims to make party take more centrist stances", "description": "Since the November 2024 election, some centrist Democrats have blamed the party's poor performance on progressive stances. A new think tank called the Searchlight Institute is advising Democrats to downplay causes like LGBTQ+ rights and climate change in favo…", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/new-democrat-think-tank-more-centrist-stances/", "source": "CBS News", "published_at": "2025-10-03T23:03:00Z", "relevance_score": 0.24}, {"title": "U.N. food agency to suspend food aid for 750,000 people in Somalia next month", "description": "The U.N. food agency has announced cuts to food assistance for hundreds of thousands in Somalia, where millions face the devastating effects of climate change and severe hunger", "content": "NAIROBI, Kenya -- NAIROBI, Kenya (AP) The U.N. food agency announced on Friday that it is cutting food assistance for hundreds of thousands of people in Somalia, where millions are facing devastating… [+1483 chars]", "url": "https://abcnews.go.com/International/wireStory/food-agency-suspend-food-aid-750000-people-somalia-126177548", "source": "ABC News", "published_at": "2025-10-03T11:58:34Z", "relevance_score": 0.24}, {"title": "Correct this ongoing Himalayan blunder", "description": "Monsoon 2025 has caused widespread destruction in West Bengal, Himachal Pradesh, Uttarakhand, and Assam. Landslides and floods have claimed lives and displaced thousands. Bhutan's Tala hydropower dam overflow adds to flood risks. Climate change and unchecked …", "content": "Monsoon 2025 has unleashed destruction across several states, with West Bengal bearing the latest brunt. In the past few days, devastating landslides and raging floods have struck Darjeeling, Kalimpo… [+1558 chars]", "url": "https://economictimes.indiatimes.com/opinion/et-editorial/correct-this-ongoing-himalayan-blunder/articleshow/124346164.cms", "source": "The Times of India", "published_at": "2025-10-06T17:50:31Z", "relevance_score": 0.24}, {"title": "India considers introducing nationwide climate-linked insurance scheme", "description": "India's government is in early talks with local insurers to design a nationwide climate-linked insurance program. This parametric model would provide quick, pre-determined payouts for extreme weather events like heatwaves and floods, helping the government ma…", "content": "India's government has begun early-stage talks with local insurers about designing a nationwide climate-linked insurance programme aimed at simplifying the payout process after extreme weather events… [+4167 chars]", "url": "https://economictimes.indiatimes.com/industry/banking/finance/insure/india-considers-introducing-nationwide-climate-linked-insurance-scheme/articleshow/124336301.cms", "source": "The Times of India", "published_at": "2025-10-06T09:33:21Z", "relevance_score": 0.155}, {"title": "India considers introducing nationwide climate-linked insurance scheme", "description": "India's government is in early talks with local insurers to design a nationwide climate-linked insurance program. This parametric model would provide quick, pre-determined payouts for extreme weather events like heatwaves and floods, helping the government ma…", "content": "India's government has begun early-stage talks with local insurers about designing a nationwide climate-linked insurance programme aimed at simplifying the payout process after extreme weather events… [+4167 chars]", "url": "https://economictimes.indiatimes.com/industry/banking/finance/insure/india-considers-introducing-nationwide-climate-linked-insurance-scheme/articleshow/124336176.cms", "source": "The Times of India", "published_at": "2025-10-06T09:33:21Z", "relevance_score": 0.155}, {"title": "Prince William opens up about family and future plans for monarchy: \"Change is on my agenda\"", "description": "Prince William opened up on comedian Eugene Levy's Apple travel show, \"The Reluctant Traveler,\" about his wife Kate, his mother, Princess Diana, and changes to the monarchy when he becomes king.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/prince-william-opens-up-about-family-and-future-plans-for-monarchy-change-is-on-my-agenda/", "source": "CBS News", "published_at": "2025-10-03T14:21:00Z", "relevance_score": 0.15}, {"title": "‘Will they change course?’: US Senate in stalemate over government shutdown", "description": "The third day of the US government shutdown has yielded no breakthrough as Democrats and Republicans split on spending.", "content": "Well, the shutdown melodrama continues.\r\nThats how, with the verbal equivalent of a sigh, Senator John Kennedy of Louisiana summed up the third day of the United States government shutdown.\r\nlist of … [+6770 chars]", "url": "https://www.aljazeera.com/news/2025/10/3/will-they-change-course-us-senate-in-stalemate-over-government-shutdown", "source": "Al Jazeera English", "published_at": "2025-10-03T23:44:27Z", "relevance_score": 0.12}, {"title": "Nepal’s leaderless Gen-Z revolution has changed the rules of power", "description": "Rising without a leader, Nepal’s youth broke a cycle of betrayal and showed where power truly lies.", "content": "In the 48 hours that Nepals Gen-Z revolution unfolded, one question echoed across the country: Where is their Lenin? But perhaps that question missed the point. For decades, every Nepali revolution h… [+7949 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/3/nepals-leaderless-gen-z-revolution-has-changed-the-rules-of-power", "source": "Al Jazeera English", "published_at": "2025-10-03T14:50:06Z", "relevance_score": 0.12}, {"title": "Sean 'Diddy' Combs begs judge for mercy, apologizes for 'sick' actions ahead of sentencing", "description": "Sean “Diddy” Combs, the hip-hop mogul convicted on interstate prostitution charges, begged a federal judge for mercy during a dramatic sentencing hearing Friday, insisting he has “changed for the better.”“I can’t change the past, but I can change the future,”…", "content": "Sean Diddy Combs, the hip-hop mogul convicted on interstate prostitution charges, begged a federal judge for mercy during a dramatic sentencing hearing Friday, insisting he has changed for the better… [+3958 chars]", "url": "https://www.nbcnews.com/news/us-news/sean-diddy-combs-begs-judge-mercy-apologizes-sick-actions-ahead-senten-rcna235371", "source": "NBC News", "published_at": "2025-10-03T20:28:32Z", "relevance_score": 0.035}, {"title": "What are the cheapest ways to borrow home equity this October?", "description": "Want to leverage your home equity in the cooling rate climate of October 2025? Here are three cheap ways to do so.", "content": "Home equity borrowing doesn't need to break the bank this October now that interest rates are falling again.\r\nPHIL LEO/PM Images/Getty Images\r\nThe interest rate climate is changing again, and with it… [+5200 chars]", "url": "https://www.cbsnews.com/news/what-are-cheapest-ways-borrow-home-equity-october-2025/", "source": "CBS News", "published_at": "2025-10-03T15:52:34Z", "relevance_score": 0.035}, {"title": "RBI policy and GST boost fuel interest in consumption, financial services stocks", "description": "Consumption and financial services stocks are in focus due to recent GST boosts and RBI policy changes. Analysts highlight several stocks, including United Spirits, Aditya Birla Capital, and Axis Bank, which saw above-average rollovers to the October series. …", "content": "Shares in the consumption sector, as well as some financial services companies are expected to remain in focus in the coming weeks, due to the GST boost, as well as RBI’s policy changes announced in … [+4374 chars]", "url": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-policy-and-gst-boost-fuel-interest-in-consumption-financial-services-stocks/articleshow/124280600.cms", "source": "The Times of India", "published_at": "2025-10-03T00:17:53Z", "relevance_score": 0.035}, {"title": "Ladakh violence: Sonam Wangchuk's wife Gitanjali Angmo moves SC seeking his release", "description": "Sonam Wangchuk's wife Gitanjali Angmo on Friday moved the Supreme Court seeking his release, days after the climate activist was arrested and charged under the stringent National Security Act (NSA).", "content": "Sonam Wangchuk's wife Gitanjali Angmo on Friday moved the Supreme Court seeking his release, days after the climate activist was detained and charged under the stringent National Security Act (NSA). … [+2981 chars]", "url": "https://economictimes.indiatimes.com/news/india/ladakh-violence-sonam-wangchuks-wife-gitanjali-angmo-moves-sc-seeking-his-release/articleshow/124282286.cms", "source": "The Times of India", "published_at": "2025-10-03T03:32:47Z", "relevance_score": 0.035}, {"title": "Drier weather threatens India’s tea exports, global supply", "description": "Climate extremes shrink Assam tea harvests, increase costs, reduce exports, and reshape the global industry and prices.", "content": "Under blazing skies at a tea plantation in Indias northeastern state of Assam, worker Kamini Kurmi wears an umbrella fastened over her head to keep her hands free to pluck delicate leaves from the bu… [+3598 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/8/drier-weather-threatens-indias-tea-exports-global-supply", "source": "Al Jazeera English", "published_at": "2025-10-08T10:12:28Z", "relevance_score": 0.03}, {"title": "How much does a $15,000 home equity loan cost per month after the Fed cut interest rates?", "description": "A cooler interest rate climate may entice homeowners in need of $15,000 to consider their home equity loan options.", "content": "Recent interest rate cuts may be beneficial for owners considering borrowing home equity now.\r\nRichHobson/Getty Images\r\nIf you're a homeowner in need of extra financing worth around $15,000 or so, yo… [+3853 chars]", "url": "https://www.cbsnews.com/news/how-much-does-15000-home-equity-loan-cost-per-month-fed-cut-interest-rates-october-2025/", "source": "CBS News", "published_at": "2025-10-03T18:27:33Z", "relevance_score": 0.03}, {"title": "Pudge the cat steals the show at Bowling Green football games", "description": "The football team at Bowling Green State University was down on its luck and in bad need of change, when along came a kitty catalyst. Steve Hartman goes \"On the Road\" for the story.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/pudge-the-cat-steals-the-show-at-bowling-green-football-games/", "source": "CBS News", "published_at": "2025-10-03T23:36:00Z", "relevance_score": 0.03}, {"title": "U.S. Navy eyes autonomous vessels to revamp fleet", "description": "After years of losing ground to China, American defense startups are now working to change how U.S. military ships are manufactured. Saronic Technologies aims to produce batches of autonomous maritime drones for the U.S. Navy by 2031. Rob Lehman, chief commer…", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/us-navy-eyes-autonomous-vessels-revamp-fleet/", "source": "CBS News", "published_at": "2025-10-06T22:31:00Z", "relevance_score": 0.03}, {"title": "Gen Z protests are shaking Morocco. Here's what to know", "description": "Protests have erupted in Morocco, driven by young people demanding change", "content": "RABAT, Morocco -- RABAT, Morocco (AP) Demonstrations in more than a dozen cities have jolted Moroccofor a week straight, with the young people behind them showing they can translate digital disconten… [+6451 chars]", "url": "https://abcnews.go.com/International/wireStory/gen-protests-shaking-morocco-126213067", "source": "ABC News", "published_at": "2025-10-04T12:37:50Z", "relevance_score": 0.03}, {"title": "Appeals court lifts order on Portland National Guard, deployment still blocked", "description": "The broader order stopping any state's National Guard deploying still in effect.", "content": "In a move that does not change the situation on the ground in Portland, the Ninth Circuit Court of Appeals has temporarily lifted a lower court's order blocking the deployment of Oregon National Guar… [+1476 chars]", "url": "https://abcnews.go.com/US/appeals-court-lifts-order-portland-national-guard-deployment/story?id=126345146", "source": "ABC News", "published_at": "2025-10-08T21:24:40Z", "relevance_score": 0.005000000000000001}, {"title": "How to find the lowest home equity borrowing rates this October, according to experts", "description": "There are several ways homeowners can secure low home equity borrowing rates, especially now that rates are being cut.", "content": "The home equity borrowing climate is an encouraging one for homebuyers this October.\r\nAndrii Yalanskyi/Getty Images\r\nSeptember brought good news for borrowers. The Federal Reserve conducted its first… [+6057 chars]", "url": "https://www.cbsnews.com/news/how-to-find-lowest-home-equity-borrowing-rates-october-2025-according-to-experts/", "source": "CBS News", "published_at": "2025-10-08T13:19:49Z", "relevance_score": 0.005000000000000001}, {"title": "Australia, Papua New Guinea sign mutual defence treaty", "description": "Pukpuk treaty commits the two neighbours to greater military cooperation, although the text is yet to be released.", "content": "Australias Prime Minister Anthony Albanese and the Prime Minister of Papua New Guinea (PNG) James Marape have signed a mutual defence treaty in Canberra, with the leaders saying the text of the agree… [+2805 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/australia-papua-new-guinea-sign-mutual-defence-treaty", "source": "Al Jazeera English", "published_at": "2025-10-06T03:24:55Z", "relevance_score": 0.0}, {"title": "Nepal hit by deadly floods after days of heavy monsoon rains", "description": "Disaster officials report at least 47 people killed as landslides and floods wreak havoc.", "content": "Landslides and floods triggered by heavy downpours in Nepal have killed at least 47 people, according to disaster officials.\r\nTorrential downpours have lashed Nepal since Friday, leaving rivers in sp… [+1193 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/6/nepal-hit-by-deadly-floods-after-days-of-heavy-monsoon-rain", "source": "Al Jazeera English", "published_at": "2025-10-06T09:24:36Z", "relevance_score": 0.0}, {"title": "More than 350 trekkers escape blizzard-hit Everest, hundreds still stranded", "description": "Rescued trekkers reach China's Qudang township while 200 others still face treacherous Everest conditions awaiting help.", "content": "Rescuers have guided more than 350 people to safety after they were stranded by blizzard-like conditions on the Tibetan side of Mount Everest, Chinese state media reported on Sunday.\r\nIn total, more … [+2526 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/more-than-350-trekkers-escape-blizzard-hit-everest-hundreds-still-stranded", "source": "Al Jazeera English", "published_at": "2025-10-06T01:01:28Z", "relevance_score": 0.0}, {"title": "US and China provoke sharp fall in global outlook for renewable power", "description": "Lowered support means capacity now expected to grow to no more than 4,600GW by 2030, 900GW lower than 2024 estimate.", "content": "The International Energy Agency (IEA) has scaled back its forecast for renewable power growth to 2030, citing weaker outlooks in the United States and China.\r\nThe Paris-based agency now projects tota… [+2136 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/us-and-china-provoke-sharp-fall-in-global-outlook-for-renewable-power", "source": "Al Jazeera English", "published_at": "2025-10-07T08:37:03Z", "relevance_score": 0.0}, {"title": "Landslide hits bus in northern India, killing 15, as rescue continues", "description": "The bus was travelling on a hilly stretch in Himachal Pradesh when a landslide struck after days of torrential rains.", "content": "At least 15 people have been killed after debris from a massive landslide hit a bus in Indias northern state of Himachal Pradesh, local authorities have said.\r\nThe bus was travelling on a hilly stret… [+2083 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/landslide-hits-bus-in-northern-india-killing-15-as-rescue-continues", "source": "Al Jazeera English", "published_at": "2025-10-08T06:10:21Z", "relevance_score": 0.0}, {"title": "Hundreds of Everest hikers reach safety after snowstorm in Tibetan valley", "description": "Those rescued included guides, yak herders and trekkers, who were trapped in a heavy snowstorm that began on Friday.", "content": "Hundreds of hikers, local guides and yak herders have now reached safety after becoming stranded in freezing temperatures by a heavy snowstorm over the weekend on the east face of Mount Everest in Ti… [+3023 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/hundreds-of-everest-hikers-reach-safety-after-snowstorm-in-tibetan-valley", "source": "Al Jazeera English", "published_at": "2025-10-08T05:03:31Z", "relevance_score": 0.0}, {"title": "What caused Nepal’s devastating flood damage and how was it contained?", "description": "Karki government has been praised for issuing early warnings and imposing road closures in response to flood forecasts.", "content": "Heavy rains have resulted in severe flooding and landslides in Nepal and Indias eastern Himalayan city of Darjeeling in the past few days.\r\nDozens of people have been killed in landslides in Nepals e… [+9498 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/what-caused-nepals-devastating-flood-damage-and-how-was-it-contained", "source": "Al Jazeera English", "published_at": "2025-10-07T12:08:16Z", "relevance_score": 0.0}, {"title": "UNESCO board backs Egypt’s Khaled el-Enany as its next chief", "description": "The Egyptologist and former minister of antiquities will be the first Arab to lead the UN's cultural organisation.", "content": "The board of the United Nations Educational, Scientific and Cultural Organization (UNESCO) has nominated Egypts Khaled el-Enany, an academic and former minister of tourism and antiquities, as its nex… [+3669 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/unesco-board-backs-egypts-khaled-el-enany-as-its-next-chief", "source": "Al Jazeera English", "published_at": "2025-10-07T06:07:05Z", "relevance_score": 0.0}, {"title": "How Ladakh protest leader Sonam Wangchuk went from Indian hero to ‘traitor’", "description": "Wangchuk, a celebrated innovator, inspired a Bollywood megahit. Now he's being accused of challenging the Indian state.", "content": "New Delhi, India On the night of August 5, 2019, hundreds of Kashmiris were arrested amid a crackdown by Indian security forces that followed the Indian governments decision to strip the region of it… [+15015 chars]", "url": "https://www.aljazeera.com/features/2025/10/7/how-ladakh-protest-leader-sonam-wangchuk-went-from-indian-hero-to-traitor", "source": "Al Jazeera English", "published_at": "2025-10-07T02:53:02Z", "relevance_score": 0.0}, {"title": "‘Do you want a player to die on court?’ – Tennis stars wilt in China heat", "description": "Weather conditions have led to player complaints; mercury is likely to rise through to Sunday's Shanghai Masters final.", "content": "Novak Djokovic threw up, Alexander Zverev poured sweat out of his shoe, and Emma Raducanu quit her match with dizziness and the bad news for the worlds top tennis players is that more baking weather … [+4320 chars]", "url": "https://www.aljazeera.com/sports/2025/10/8/do-you-want-a-player-to-die-on-court-tennis-stars-wilt-in-china-heat", "source": "Al Jazeera English", "published_at": "2025-10-08T09:29:03Z", "relevance_score": 0.0}, {"title": "Bear injures 2 in Japanese grocery store, man killed in separate attack", "description": "As Japan faces rising human-bear encounters, an animal trapped in a grocery store injured two men, while a separate reported mauling proved fatal.", "content": "Tokyo — An agitated bear roamed the aisles of a grocery store in central Japan, injuring two men and frightening shoppers, officials said Wednesday, while Japanese media said a man was found dead aft… [+2747 chars]", "url": "https://www.cbsnews.com/news/japan-bear-attack-grocery-store-separate-death-suspected-mauling/", "source": "CBS News", "published_at": "2025-10-08T09:42:11Z", "relevance_score": 0.0}, {"title": "Global green energy exceeds coal power for first time ever, study finds", "description": "Energy think tank Ember says a slight drop in global fossil fuel power marks \"a turning point,\" as the U.S. and Europe lag behind by China and India in investment.", "content": "Worldwide solar and wind power generation has outpaced electricity demand this year, and for the first time on record, renewable energies combined generated more power than coal, according to a new a… [+5546 chars]", "url": "https://www.cbsnews.com/news/renewable-energy-exceeds-coal-power-globally-first-time-ember-analysis/", "source": "CBS News", "published_at": "2025-10-08T16:03:00Z", "relevance_score": 0.0}, {"title": "Homeland Security Sec. Kristi Noem visits ICE facility at center of Portland protests", "description": "Noem met with local law enforcement officials at the ICE facility, according to the Portland Police Bureau.", "content": "Department of Homeland Security Secretary Kristi Noem made a high-profile visit to an Immigration and Customs Enforcement (ICE) facility in Portland on Tuesday amid a legal battle over sending federa… [+4386 chars]", "url": "https://abcnews.go.com/US/kristi-noem-portland-ice-facility/story?id=126312341", "source": "ABC News", "published_at": "2025-10-08T01:35:30Z", "relevance_score": 0.0}, {"title": "Joan Kennedy, first wife of Sen. Edward Kennedy, has died", "description": "The first wife of the late Sen. Edward Kennedy, Joan Kennedy, died Wednesday at the age of 89", "content": "BOSTON -- BOSTON (AP) Joan B. Kennedy, the former wife of Sen. Edward M. Kennedy who endured a long and troubled marriage marked by family tragedies, her husbands infidelities and her own struggles w… [+2087 chars]", "url": "https://abcnews.go.com/US/wireStory/joan-kennedy-wife-sen-edward-kennedy-died-126328284", "source": "ABC News", "published_at": "2025-10-08T14:26:12Z", "relevance_score": 0.0}, {"title": "LeBron James’ surprise ‘decision’ announcement was an ad with Hennessy", "description": "LeBron James had another “decision” to announce. Turns out, it was an ad.\n\n\n\nThe Los Angeles Lakers star teased that he would have something to say Tuesday. The “decision” reference is a nod to how he announced in July 2010 that he was joining the Miami Heat.…", "content": "LeBron James had another decision to announce. Turns out, it was an ad.\r\nThe Los Angeles Lakers star teased that he would have something to say Tuesday. The decision reference is a nod to how he anno… [+2299 chars]", "url": "https://apnews.com/article/lebron-james-decision-nba-ecfcfad6c58717aa0cbd4f3cd6b38bb3", "source": "Associated Press", "published_at": "2025-10-07T17:00:00Z", "relevance_score": 0.0}, {"title": "WATCH: Sean 'Diddy' Combs sentenced to 50 months in prison", "description": "Sean Combs sat expressionless in his seat when the judge sentenced him to just over four years in prison Friday for his conviction on two prostitution-related offenses.", "content": "<ul><li>Sean 'Diddy' Combs sentenced to more than 4 years in prison\r\n</li><li>Prince William opens about family, legacy and the future of the royals \r\n</li><li>Trump tells Israel to stop bombing afte… [+4736 chars]", "url": "https://abcnews.go.com/Entertainment/video/sean-diddy-combs-sentenced-50-months-prison-126211133", "source": "ABC News", "published_at": "2025-10-04T10:37:29Z", "relevance_score": 0.0}, {"title": "WATCH: ICE to conduct immigration enforcement at Super Bowl, Lewandowski says", "description": "ICE agents will be present at Super Bowl LX, according to Corey Lewandowski, former Trump 2016 campaign manager and current special government employee at the Department of Homeland Security.", "content": "<ul><li>Shutdown showdown: White House threatens mass layoffs\r\n</li><li>More Americans blame Trump, GOP for shutdown than Democrats: Poll\r\n</li><li>Firefighters battle large fire at Chevron refinery … [+4785 chars]", "url": "https://abcnews.go.com/US/video/ice-conduct-immigration-enforcement-super-bowl-lewandowski-126175497", "source": "ABC News", "published_at": "2025-10-03T11:09:29Z", "relevance_score": 0.0}, {"title": "WATCH: College freshman lives out his dream of playing football at age 58", "description": "Tom Cillo, a 58-year-old college freshman at Lycoming College in Pennsylvania, is gunning to become the oldest college football player to see the field in more than a decade.", "content": "<ul><li>Shutdown showdown: White House threatens mass layoffs\r\n</li><li>More Americans blame Trump, GOP for shutdown than Democrats: Poll\r\n</li><li>Firefighters battle large fire at Chevron refinery … [+4785 chars]", "url": "https://abcnews.go.com/Sports/video/college-freshman-lives-dream-playing-football-age-58-126163287", "source": "ABC News", "published_at": "2025-10-03T01:50:02Z", "relevance_score": 0.0}, {"title": "WATCH: Ozzy Osbourne honored with mural made from hundreds of pumpkins", "description": "The late pioneering heavy metal singer Ozzy Osbourne has been honored by a U.K. farm that used hundreds of pumpkins to make a Halloween mural to the Black Sabbath frontman.", "content": "<ul><li>Sean 'Diddy' Combs sentencing hearing gets underway\r\n</li><li>Government shutdown's impact on airport workers, travel\r\n</li><li>Government shutdown delays monthly jobs report\r\n</li><li>Federa… [+4547 chars]", "url": "https://abcnews.go.com/Entertainment/video/ozzy-osbourne-honored-mural-made-hundreds-pumpkins-126187018", "source": "ABC News", "published_at": "2025-10-03T15:48:37Z", "relevance_score": 0.0}, {"title": "WATCH: House Speaker Johnson says Trump is 'trolling the Democrats' during shutdown", "description": "Speaker Mike Johnson said that President Trump and other Republicans are \"using memes\" to \"point out the absurdity of the Democrats' position\" on social media during the government shutdown.", "content": "<ul><li>A look at government shutdown's potential impact on education, student loans\r\n</li><li>Time running out for Hamas to respond to Trumps Gaza peace plan deadline\r\n</li><li>Sean 'Diddy' Combs se… [+4582 chars]", "url": "https://abcnews.go.com/Politics/video/house-speaker-johnson-trump-trolling-democrats-shutdown-126190308", "source": "ABC News", "published_at": "2025-10-03T17:33:09Z", "relevance_score": 0.0}, {"title": "WATCH: Authorities announce arrest in connection with Palisades fire", "description": "A 29-year-old man has been arrested in connection with the Palisades Fire, which killed a dozen people earlier this year and caused widespread destruction in Los Angeles County, the DOJ announced.", "content": "<ul><li>Man arrested, faces federal charge in connection with Palisades Fire: DOJ\r\n</li><li>James Comey pleads not guilty, trial date set for January\r\n</li><li>US delegation expected to join peace ta… [+4418 chars]", "url": "https://abcnews.go.com/US/video/authorities-announce-arrest-connection-palisades-firev-126335430", "source": "ABC News", "published_at": "2025-10-08T17:26:43Z", "relevance_score": 0.0}, {"title": "WATCH: Trump says Sean 'Diddy' Combs asked him for a pardonvv", "description": "President Donald Trump said that Sean \"Diddy\" Combs has reached out to ask him for a pardon following his conviction on two prostitution-related charges.", "content": "<ul><li>Nova music festival massacre survivor: 'I remember just running for my life'\r\n</li><li>Trump says Sean 'Diddy' Combs asked him for a pardon\r\n</li><li>Government shutdown's impact on air traff… [+4405 chars]", "url": "https://abcnews.go.com/US/video/trump-sean-diddy-combs-asked-pardon-126299891", "source": "ABC News", "published_at": "2025-10-07T16:52:50Z", "relevance_score": 0.0}, {"title": "WATCH: Hundreds of hikers trapped by blizzard on Mount Everest", "description": "An effort is underway to rescue hundreds of hikers who became trapped on Mount Everest due to an unexpected blizzard.", "content": "<ul><li>Illinois files lawsuit to block deployment of National Guard\r\n</li><li>Trump administration pushes back on order to block National Guard deployment\r\n</li><li>South Carolina judge's house fire… [+4225 chars]", "url": "https://abcnews.go.com/International/video/hundreds-hikers-trapped-blizzard-mount-everest-126258058", "source": "ABC News", "published_at": "2025-10-06T15:53:48Z", "relevance_score": 0.0}, {"title": "WATCH: Supreme Court denies Ghislaine Maxwell appeal", "description": "The Supreme Court has declined to take up the appeal of Maxwell, who was contesting her prosecution and conviction on grounds that the government had violated an agreement made with Jeffrey Epstein before his death.", "content": "<ul><li>Illinois files lawsuit to block deployment of National Guard\r\n</li><li>Trump administration pushes back on order to block National Guard deployment\r\n</li><li>South Carolina judge's house fire… [+4225 chars]", "url": "https://abcnews.go.com/US/video/supreme-court-denies-ghislaine-maxwell-appeal-126257745", "source": "ABC News", "published_at": "2025-10-06T16:04:10Z", "relevance_score": 0.0}, {"title": "WATCH: Former NFL QB Mark Sanchez facing felony charge after physical altercation", "description": "Former NFL QB Mark Sanchez, who was arrested following a physical altercation this weekend, is now facing a felony charge of battery involving serious bodily injury, prosecutors in Indianapolis said.", "content": "<ul><li>Government shutdown's impact on air traffic controllers\r\n</li><li>Parties no closer to deal to end government shutdown\r\n</li><li>Standoff over National Guard intensifies\r\n</li><li>Medical hel… [+4389 chars]", "url": "https://abcnews.go.com/US/video/former-nfl-qb-mark-sanchez-facing-felony-charge-126288356", "source": "ABC News", "published_at": "2025-10-07T13:12:06Z", "relevance_score": 0.0}, {"title": "WATCH: Ex-FBI Director James Comey pleads not guilty", "description": "Former FBI Director James Comey pleaded not guilty on Wednesday. He is charged with one count of false statements and one count of obstruction of a congressional proceeding.", "content": "<ul><li>James Comey pleads not guilty, trial date set for January\r\n</li><li>US delegation expected to join peace talks between Israel and Hamas\r\n</li><li>Inside Nasser Hospital's malnutrition ward am… [+4405 chars]", "url": "https://abcnews.go.com/US/video/fbi-director-james-comey-pleads-guilty-126330331", "source": "ABC News", "published_at": "2025-10-08T15:28:28Z", "relevance_score": 0.0}, {"title": "WATCH: Air traffic controller shortages amid shutdown lead to canceled flights, delays", "description": "Flight delays and cancellations are climbing as sick calls involving air traffic controllers leave a number of airport towers and control facilities without enough staff to handle all flights.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Man arrested, faces federal cha… [+4400 chars]", "url": "https://abcnews.go.com/US/video/air-traffic-controller-shortages-amid-shutdown-lead-canceled-126339446", "source": "ABC News", "published_at": "2025-10-08T19:08:39Z", "relevance_score": 0.0}, {"title": "WATCH: Hamas responds to President Trump's proposal to end Gaza war", "description": "Hamas responded to President Trump's proposal for peace in Gaza, saying it will release all remaining hostages if Israel withdraws from Gaza and \"proper field conditions are met.\"", "content": "<ul><li>Sean 'Diddy' Combs sentenced to more than 4 years in prison\r\n</li><li>Prince William opens about family, legacy and the future of the royals \r\n</li><li>Trump tells Israel to stop bombing afte… [+4736 chars]", "url": "https://abcnews.go.com/International/video/hamas-responds-president-trumps-proposal-end-gaza-war-126211226", "source": "ABC News", "published_at": "2025-10-04T10:37:39Z", "relevance_score": 0.0}, {"title": "WATCH: US kills 4 alleged narco-terrorists in strike off coast of Venezuela, Hegseth says", "description": "Secretary Pete Hegseth announced Friday that the U.S. ordered a strike on another alleged drug boat that left Venezuela.", "content": "<ul><li>A look at government shutdown's potential impact on education, student loans\r\n</li><li>Protesters clash with federal agents in Chicago as ICE raids continue\r\n</li><li>Hegseth announces anothe… [+4632 chars]", "url": "https://abcnews.go.com/International/video/us-kills-4-alleged-narco-terrorists-strike-off-126198083", "source": "ABC News", "published_at": "2025-10-03T20:01:57Z", "relevance_score": 0.0}, {"title": "WATCH: Sentencing day for Sean 'Diddy' Combs", "description": "Sean \"Diddy\" Combs returned to a Manhattan courtroom on Friday to be sentenced on two counts of transportation for the purposes of prostitution.", "content": "<ul><li>Sean 'Diddy' Combs sentencing hearing gets underway\r\n</li><li>Government shutdown's impact on airport workers, travel\r\n</li><li>Government shutdown delays monthly jobs report\r\n</li><li>Federa… [+4547 chars]", "url": "https://abcnews.go.com/US/video/sentencing-day-sean-diddy-combs-126186860", "source": "ABC News", "published_at": "2025-10-03T15:47:39Z", "relevance_score": 0.0}, {"title": "WATCH: UK authorities search for motive in synagogue attack", "description": "Police on Friday identified the two men who were killed in an attack on a synagogue in Manchester, as Britain’s chief rabbi said an “unrelenting wave” of antisemitism lay behind the crime.", "content": "<ul><li>A look at government shutdown's potential impact on education, student loans\r\n</li><li>Time running out for Hamas to respond to Trumps Gaza peace plan deadline\r\n</li><li>Sean 'Diddy' Combs se… [+4582 chars]", "url": "https://abcnews.go.com/International/video/uk-authorities-search-motive-synagogue-attack-126189631", "source": "ABC News", "published_at": "2025-10-03T17:33:28Z", "relevance_score": 0.0}, {"title": "WATCH: Illinois governor responds to Trump's call to jail Democratic leaders", "description": "Illinois Gov. JB Pritzker responded after President Donald Trump called for his jailing in a social media post claiming Pritzker and Chicago Mayor Brandon Johnson have failed to protect ICE officers.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Rabbi reflects on Oct. 7 annive… [+4426 chars]", "url": "https://abcnews.go.com/US/video/illinois-governor-responds-trumps-call-jail-democratic-leaders-126343677", "source": "ABC News", "published_at": "2025-10-08T20:21:02Z", "relevance_score": 0.0}, {"title": "WATCH: Bystanders help lift helicopter after crash in Sacramento", "description": "New video shows drivers racing to lift a medical helicopter that crashed Monday night on a busy Sacramento highway.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Rabbi reflects on Oct. 7 annive… [+4426 chars]", "url": "https://abcnews.go.com/US/video/bystanders-lift-helicopter-after-crash-sacramento-126343225", "source": "ABC News", "published_at": "2025-10-08T20:13:57Z", "relevance_score": 0.0}, {"title": "WATCH: Melania Trump greets sailors with 'hooyah' at Navy 250 event", "description": "First lady Melania Trump greeted sailors with a \"hooyah\" as she spoke at an event celebrating the U.S. Navy's 250th anniversary in Norfolk, Virginia.", "content": "<ul><li>Democrats and Republicans at a deadlock as shutdown continues\r\n</li><li>Tensions rise amid anti-ICE protests in Chicago\r\n</li><li>Just come to the table and do something to help Americans: Bo… [+4480 chars]", "url": "https://abcnews.go.com/US/video/melania-trump-greets-sailors-hooyah-navy-250-event-126237289", "source": "ABC News", "published_at": "2025-10-05T21:15:20Z", "relevance_score": 0.0}, {"title": "WATCH: Near-supermoon lights up American skies", "description": "Time-lapse imagery captured the nearly full moon, a forerunner to the harvest supermoon, rising and setting over U.S. cities.", "content": "<ul><li>Government shutdown's impact on air traffic controllers\r\n</li><li>Parties no closer to deal to end government shutdown\r\n</li><li>Standoff over National Guard intensifies\r\n</li><li>Medical hel… [+4389 chars]", "url": "https://abcnews.go.com/US/video/supermoon-lights-american-skies-126288444", "source": "ABC News", "published_at": "2025-10-07T13:17:22Z", "relevance_score": 0.0}, {"title": "WATCH: London police dismantle international phone theft gang", "description": "Police in London have made dozens of arrests linked to a criminal gang who are alleged to have smuggled 40,000 stolen mobile phones from the U.K. to China.", "content": "<ul><li>Air traffic control shortages worsen as shutdown drags on\r\n</li><li>James Comey to be arraigned Wednesday\r\n</li><li>Former surgeon generals warn US about RFK Jr.\r\n</li><li>Tropical Storm Jerr… [+4442 chars]", "url": "https://abcnews.go.com/International/video/london-police-dismantle-international-phone-theft-gang-126320757", "source": "ABC News", "published_at": "2025-10-08T11:02:28Z", "relevance_score": 0.0}, {"title": "Endangered cheetah cubs rescued from illegal trade in Africa", "description": "The cubs were packed in bags that resembled sacks of potatoes and were being transported in a small boat when the local coast guard intercepted them.", "content": "Eleven cheetah cubs were rescued from illegal trade in Somaliland in what a conservationist described on Thursday as \"one of the largest confiscations of the species.\"\r\nThe cubs were packed in bags t… [+3523 chars]", "url": "https://www.cbsnews.com/news/cheetah-cubs-rescued-illegal-trade-africa/", "source": "CBS News", "published_at": "2025-10-03T10:28:31Z", "relevance_score": 0.0}, {"title": "With Gaza in ruins, will US media name the crime?", "description": "With at least 66,000 Palestinians dead and mounting genocide declarations, will Western media hold Israel accountable?", "content": "The Take\r\nRead moreDespite a United Nations inquiry and multiple human rights organisations finding that Israel is committing genocide in Gaza, Western news outlets are still reluctant to use the ter… [+117 chars]", "url": "https://www.aljazeera.com/video/the-take-2/2025/10/6/aje-onl-glb_gazamediacoverage_av_v2-061025", "source": "Al Jazeera English", "published_at": "2025-10-06T16:58:54Z", "relevance_score": 0.0}, {"title": "Cycling team to drop Israel name after mass pro-Palestinian Vuelta protests", "description": "Israel-Premier Tech cycling team will drop Israeli ties after multiple protests at the Vuelta a Espana race.", "content": "The IsraelPremier Tech cycling team will drop its ties to Israel from the 2026 season, following repeated pro-Palestinian protests against it at the recent Vuelta a Espana bike race.\r\nThe move was an… [+2447 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/cycling-team-to-drop-israel-name-after-mass-pro-palestinian-vuelta-protests", "source": "Al Jazeera English", "published_at": "2025-10-06T22:28:37Z", "relevance_score": 0.0}, {"title": "Homeland Security requests National Guard to be sent to Chicago", "description": "Gov. Pritzker said Trump will send in 300 Guardsman as local tensions escalate.", "content": "Illinois Gov. JB Pritzker said Saturday that despite his repeated rejections for federal mobilization to Chicago, President Donald Trump will send in 300 National Guardsman as tensions between local … [+4289 chars]", "url": "https://abcnews.go.com/US/homeland-security-requests-national-guard-chicago-despite-protests/story?id=126218735", "source": "ABC News", "published_at": "2025-10-04T20:45:45Z", "relevance_score": 0.0}, {"title": "Lula asks Trump to lift 40 percent tariff from Brazilian goods", "description": "Trump had imposed a 40% tariff on Brazil in July on top of a 10% earlier even though US has a trade surplus with Brazil.", "content": "Brazilian President Luiz Inacio Lula da Silva has asked United States President Donald Trump to lift the 40 percent tariff imposed by the US government on Brazilian imports.\r\nThe leaders spoke for 30… [+1606 chars]", "url": "https://www.aljazeera.com/economy/2025/10/6/lula-asks-trump-to-lift-40-percent-tariff-from-brazilian-goods", "source": "Al Jazeera English", "published_at": "2025-10-06T17:41:00Z", "relevance_score": 0.0}, {"title": "Frogs don’t need lungs to breathe! The wild truth about their skin will surprise you", "description": "Frogs possess an extraordinary ability to breathe and drink through their permeable skin, a vital adaptation for survival in diverse environments. This unique cutaneous respiration and skin-based hydration, however, make them highly vulnerable to pollution an…", "content": "Navratri 2025: Shraddha Kapoor, Alia Bhatt, and other divas' inspired pink ethnic looks for day 9", "url": "https://timesofindia.indiatimes.com/etimes/trending/frogs-dont-need-lungs-to-breathe-the-wild-truth-about-their-skin-will-surprise-you/articleshow/124358606.cms", "source": "The Times of India", "published_at": "2025-10-07T09:14:13Z", "relevance_score": 0.0}, {"title": "Ted Cruz blames Nigeria for ‘mass murder’ of Christians: What’s the truth?", "description": "Nigeria is suffering complex security crises, but Republicans in US are eager to paint them as purely religious.", "content": "United States Senator Ted Cruz has accused Nigerias government of enabling a massacre against Christians, citing a rising number of attacks against the community in the countrys troubled centre.\r\nIn … [+12807 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/ted-cruz-blames-nigeria-for-mass-murder-of-christians-whats-the-truth", "source": "Al Jazeera English", "published_at": "2025-10-08T16:53:07Z", "relevance_score": 0.0}, {"title": "Global protests erupt over Israeli interception of Gaza aid flotilla", "description": "Crowds in Europe, South America and beyond rally to support Gaza, which faces famine after two years of bombardment.", "content": "Worldwide protests have erupted following Israels interception of the Global Sumud Flotilla carrying humanitarian aid to Gaza, with demonstrators demanding stronger sanctions against Israel.\r\nAcross … [+2094 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/3/global-protests-erupt-over-israeli-interception-of-gaza-aid-flotilla", "source": "Al Jazeera English", "published_at": "2025-10-03T08:29:18Z", "relevance_score": 0.0}, {"title": "Activists warn Trump’s Caribbean boat strikes risk regional war", "description": "Human rights groups urge Congress to block unauthorised force as fears of wider Caribbean conflict and chaos grow.", "content": "Washington, DC Dozens of United States-based human rights, faith and policy groups have criticised President Donald Trumps expansion of military operations in the Caribbean, warning that his administ… [+6426 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/activists-warn-trumps-caribbean-boat-strikes-risk-regional-war", "source": "Al Jazeera English", "published_at": "2025-10-08T18:39:23Z", "relevance_score": 0.0}, {"title": "Trump was nominated for the Nobel Peace Prize before. Experts say he's unlikely to win this year", "description": "U.S. President Donald Trump’s bid to win the Nobel Peace Prize has drawn added attention to the annual guessing game over who its next laureate will be", "content": "STAVANGER, Norway -- STAVANGER, Norway (AP) U.S. President Donald Trumps bid to win the Nobel Peace Prize has drawn added attention to the annual guessing game over who its next laureate will be.\r\nLo… [+3906 chars]", "url": "https://abcnews.go.com/International/wireStory/trump-nominated-nobel-peace-prize-experts-win-year-126176542", "source": "ABC News", "published_at": "2025-10-03T11:33:48Z", "relevance_score": 0.0}, {"title": "Yusuf/Cat Stevens on his \"Road to Findout\"", "description": "The singer-songwriter who renamed himself Yusuf Islam talks about his new memoir, \"Cat on the Road to Findout,\" his lifelong spiritual quest, and about trying to find and understand himself as an artist.", "content": "\"You have to admit, I've been misunderstood,\" said singer-songwriter Yusuf Islam. \"Even when I wrote 'Foreigner,' I started with the words, There are no words I can use because the meaning still leav… [+5954 chars]", "url": "https://www.cbsnews.com/news/yusuf-cat-stevens-on-his-road-to-findout/", "source": "CBS News", "published_at": "2025-10-05T13:38:35Z", "relevance_score": 0.0}, {"title": "As winter knocks early in the North, will India shiver through a colder-than-usual season this year?", "description": "Early snowfall has transformed Himalayan hill stations like Gulmarg and parts of Himachal Pradesh into winter wonderlands, delighting tourists and signaling the arrival of a chilly season. Meteorologists predict a colder-than-usual winter for North India, pot…", "content": "As October rolled in, the Himalayas put on their winter coat earlier than usual. The first week of the month saw popular hill stations like Gulmarg and parts of Himachal Pradesh transform into gliste… [+3757 chars]", "url": "https://economictimes.indiatimes.com/news/new-updates/as-winter-knocks-early-in-the-north-will-india-shiver-through-a-colder-than-usual-season-this-year/articleshow/124353314.cms", "source": "The Times of India", "published_at": "2025-10-07T05:17:55Z", "relevance_score": 0.0}, {"title": "Early snowfall damages power lines and snarls traffic in Bosnia and Serbia", "description": "Early snowfall in the Western Balkans has left thousands without electricity and disrupted traffic", "content": "BELGRADE, Serbia -- BELGRADE, Serbia (AP) Early snowfall in the Western Balkans left thousands of people without electricity on Friday and disrupted traffic as roads became impassable.\r\nHeavy, wet sn… [+1596 chars]", "url": "https://abcnews.go.com/International/wireStory/early-snowfall-damages-power-lines-snarls-traffic-bosnia-126180555", "source": "ABC News", "published_at": "2025-10-03T13:32:47Z", "relevance_score": 0.0}, {"title": "Landslide in northern India hits a bus, killing at least 15 people", "description": "At least 15 people have died after debris from a massive landslide hit a bus in India’s northern state of Himachal Pradesh", "content": "NEW DELHI -- NEW DELHI (AP) At least 15 people were killed late Tuesday after debris from a massive landslide hit a bus in Indias northern state of Himachal Pradesh, local authorities said.\r\nThe bus … [+1748 chars]", "url": "https://abcnews.go.com/International/wireStory/landslide-northern-india-hits-bus-killing-15-people-126316548", "source": "ABC News", "published_at": "2025-10-08T04:56:43Z", "relevance_score": 0.0}, {"title": "How much will a $150,000 HELOC cost monthly now that the Fed's cutting interest rates?", "description": "With an interest rate cut just issued and others looming for this year, here's what a $150,000 HELOC costs now.", "content": "HELOC costs are set to decline further now that the Federal Reserve is cutting interest rates again.\r\nGetty Images/iStockphoto\r\nWithdrawing $150,000 out of your hard-earned home equity may not be a d… [+4157 chars]", "url": "https://www.cbsnews.com/news/how-much-150000-heloc-cost-monthly-october-2025-fed-cutting-interest-rates/", "source": "CBS News", "published_at": "2025-10-06T19:51:37Z", "relevance_score": 0.0}, {"title": "Greenland's leader thanks the EU and urges the bloc to invest in his island", "description": "Greenland's Prime Minister Jens-Frederik Nielsen has thanked the European Union for being a \"trusted friend\" and urged investment in Greenland's resources", "content": "BRUSSELS -- BRUSSELS (AP) Greenlands leader on Wednesday thanked the European Union for being a trusted friend and urged the 27-nation bloc to invest in his countrys mineral resources, renewable ener… [+2374 chars]", "url": "https://abcnews.go.com/International/wireStory/greenlands-leader-eu-urges-bloc-invest-island-126322195", "source": "ABC News", "published_at": "2025-10-08T12:05:56Z", "relevance_score": 0.0}, {"title": "Czech support for Ukraine at stake as populist Babiš poised to return in an election", "description": "Czechs are voting in a an election that could shift the country's stance on Ukraine", "content": "PRAGUE -- PRAGUE (AP) Czechs cast ballots on Saturday in the second and final day of a parliamentary election that could put the country on a course away from supporting Ukraine and toward Hungary an… [+2293 chars]", "url": "https://abcnews.go.com/International/wireStory/czech-support-ukraine-stake-populist-babi-poised-return-126210596", "source": "ABC News", "published_at": "2025-10-04T10:53:38Z", "relevance_score": 0.0}, {"title": "Rescuers in India search for missing after landslides kill 24 in Darjeeling region", "description": "Rescuers are scouring India's tea-growing hill district of Darjeeling in the search for several missing people", "content": "NEW DELHI -- NEW DELHI (AP) Rescuers were scouring India's northeastern tea-growing hill district of Darjeeling on Monday for those reported missing a day after landslides triggered by heavy downpour… [+2338 chars]", "url": "https://abcnews.go.com/International/wireStory/rescuers-india-search-missing-after-landslides-kill-24-126241963", "source": "ABC News", "published_at": "2025-10-06T10:21:23Z", "relevance_score": 0.0}, {"title": "Czechs begin voting in an election that could weaken the country's support for Ukraine", "description": "Czech voters have started casting ballots in a two-day general election that could shift the country's stance on Ukraine", "content": "PRAGUE -- PRAGUE (AP) Czech voters began casting ballots Friday in a two-day general election that could steer the country away from supporting Ukraine and toward Hungary and Slovakia, threatening to… [+2534 chars]", "url": "https://abcnews.go.com/International/wireStory/czechs-begin-voting-election-weaken-countrys-support-ukraine-126178358", "source": "ABC News", "published_at": "2025-10-03T12:22:37Z", "relevance_score": 0.0}, {"title": "More Gaza flotilla activists allege mistreatment in Israeli detention", "description": "Activists deported from Israel following their arrest in the aid flotilla to Gaza say they were treated 'like monkeys'.", "content": "International activists deported from Israel after joining an intercepted Gaza aid flotilla have given further accounts of mistreatment by guards during their detention.\r\nThe latest claims made by pa… [+4526 chars]", "url": "https://www.aljazeera.com/news/2025/10/5/more-gaza-flotilla-activists-allege-mistreatment-in-israeli-detention", "source": "Al Jazeera English", "published_at": "2025-10-05T16:26:31Z", "relevance_score": 0.0}, {"title": "US activist from Gaza flotilla alleges ‘psychological torture’ by Israel", "description": "David Adler says Sumud Flotilla activists were 'kidnapped, stripped, zip-tied, blindfolded' and sent to prison camp.", "content": "A United States citizen who was detained by Israel on the Global Sumud Flotilla, which tried to deliver aid to Gaza, says he and other activists endured abuse and psychological torture in Israeli cus… [+4405 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/us-activist-from-gaza-flotilla-alleges-psychological-torture-by-israel", "source": "Al Jazeera English", "published_at": "2025-10-07T18:41:25Z", "relevance_score": 0.0}, {"title": "How tensions with Bangladesh are roiling India’s sari business", "description": "Bangladesh's political turmoil has been mixed bag for the Indian sari industry, hurting some traders and helping others.", "content": "Varanasi, India Mohammed Ahmad Ansari has spent his entire life in the narrow and congested lanes of Varanasi, a city often described as the spiritual capital of India, and the constituency of Indian… [+7110 chars]", "url": "https://www.aljazeera.com/economy/2025/10/4/how-tensions-with-bangladesh-are-roiling-indias-sari-business", "source": "Al Jazeera English", "published_at": "2025-10-04T04:48:34Z", "relevance_score": 0.0}, {"title": "Munich airport resumes operations after more drone sightings halted flights", "description": "The German airport says that 46 flights had been cancelled or delayed, affecting 6,500 passengers.", "content": "Germanys Munich airport has reopened after authorities shut it down the previous night for the second time in less than 24 hours after more suspected drone sightings, as fears heighten across Europe … [+3038 chars]", "url": "https://www.aljazeera.com/news/2025/10/4/munich-airport-resumes-operations-after-more-drone-sightings-halted-flights", "source": "Al Jazeera English", "published_at": "2025-10-04T12:07:32Z", "relevance_score": 0.0}, {"title": "Musician Sean ‘Diddy’ Combs sentenced to four years in prison after apology", "description": "The famed hip-hop mogul told the court that his actions were 'disgusting' and 'shameful' in a plea for leniency.", "content": "Musician and producer Sean Diddy Combs has been sentenced to four years and two months in prison for transporting people across state lines for sexual encounters.\r\nHis sentencing hearing on Friday ca… [+3041 chars]", "url": "https://www.aljazeera.com/news/2025/10/3/musician-sean-diddy-combs-sentenced-to-four-years-in-prison-after-apology", "source": "Al Jazeera English", "published_at": "2025-10-03T22:27:45Z", "relevance_score": 0.0}, {"title": "Czechs vote in elections that could usher in populist billionaire", "description": "Self-described 'Trumpist' Andrej Babis has campaigned on pledges of welfare and halting military aid to Ukraine.", "content": "Czechs are casting their ballots in a two-day general election, in which the party of populist billionaire Andrej Babis is expected to garner the most votes but not secure a majority, raising concern… [+3544 chars]", "url": "https://www.aljazeera.com/news/2025/10/3/czechs-vote-in-elections-that-could-usher-in-populist-billionaire", "source": "Al Jazeera English", "published_at": "2025-10-03T13:16:00Z", "relevance_score": 0.0}, {"title": "Syria shares results of first parliamentary poll amid inclusivity concerns", "description": "Election marks landmark moment in country’s post-war transition, but vote goes largely to Sunni male representatives.", "content": "Syria has published the results of its first parliamentary election since the government of former President Bashar al-Assad was toppled, revealing that most new members of the revamped Peoples Assem… [+3265 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/syria-declares-results-of-1st-parliamentary-poll-amid-inclusivity-concerns", "source": "Al Jazeera English", "published_at": "2025-10-06T18:48:10Z", "relevance_score": 0.0}, {"title": "Venezuela slams presence of US F-35 fighter planes spotted off coast", "description": "Venezuelan government calls on US Defense Secretary Pete Hegseth to cease 'thrill-seeking and warmongering posture'.", "content": "Venezuelas government has blasted an illegal incursion near its borders by United States warplanes and accused the US of military harassment and threatening the security of the nation.\r\nVenezuelan De… [+3260 chars]", "url": "https://www.aljazeera.com/news/2025/10/3/venezuela-slams-presence-of-us-f-35-fighter-planes-spotted-off-coast", "source": "Al Jazeera English", "published_at": "2025-10-03T01:49:02Z", "relevance_score": 0.0}, {"title": "Iran executes six fighters accused of ties to Israel: State media", "description": "Kurdish fighter Saman Mohammadi was also hanged for killing a Muslim leader, the Mizan News Agency reports.", "content": "Iran has executed six fighters accused of waging armed attacks in the southwestern province of Khuzestan, according to state media, as the country continues its accelerated executions of people it sa… [+3030 chars]", "url": "https://www.aljazeera.com/news/2025/10/4/iran-executes-six-fighters-accused-of-ties-to-israel-state-media", "source": "Al Jazeera English", "published_at": "2025-10-04T07:08:33Z", "relevance_score": 0.0}, {"title": "Beijing’s top diplomat in HK sets out red lines for new US Consul General", "description": "China told the US envoy to abide by 'fundamental norms governing international relations', including noninterference.", "content": "The United States has dismissed a warning issued by Beijings top diplomat in Hong Kong to Washingtons new Consul General in the city, telling her not to interfere in the Chinese-run territorys intern… [+3061 chars]", "url": "https://www.aljazeera.com/news/2025/10/3/beijings-top-diplomat-in-hk-sets-out-red-lines-for-new-us-consul-general", "source": "Al Jazeera English", "published_at": "2025-10-03T03:49:38Z", "relevance_score": 0.0}, {"title": "AMD’s shares surge on deal to supply AI chips to OpenAI", "description": "The deal also gives the ChatGPT creator the option to buy upto 10 percent of AMD.", "content": "United States chipmaker AMD will supply artificial intelligence chips to OpenAI in a multi-year deal that would bring in tens of billions of dollars in annual revenue and give the ChatGPT creator the… [+3056 chars]", "url": "https://www.aljazeera.com/economy/2025/10/6/amds-shares-surge-on-deal-to-supply-ai-chips-to-openai", "source": "Al Jazeera English", "published_at": "2025-10-06T21:25:43Z", "relevance_score": 0.0}, {"title": "Venezuela’s Maduro says US Embassy ‘false flag’ bombing foiled in Caracas", "description": "President Nicolas Maduro says right wing 'extremists' planned to bomb US embassy and blame his government for attack.", "content": "Venezuelan President Nicolas Maduro said his security forces prevented a false flag operation to plant explosives at the United States Embassy in the capital Caracas in order to heighten tensions wit… [+3745 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/venezuelas-maduro-says-us-embassy-false-flag-bombing-foiled-in-caracas", "source": "Al Jazeera English", "published_at": "2025-10-07T06:01:41Z", "relevance_score": 0.0}, {"title": "What is the Nobel Peace Prize — and could Donald Trump get it?", "description": "The winner of the 2025 Nobel Peace Prize will be announced Friday. Here's what to know about the honor and President Trump's interest.", "content": "Barack Obama. Jimmy Carter. Woodrow Wilson. Teddy Roosevelt. Al Gore. And Donald Trump?\r\nPresident Trump hopes to join the exclusive list of presidents and vice presidents who have received one of th… [+8230 chars]", "url": "https://www.cbsnews.com/news/nobel-peace-prize-donald-trump-what-to-know/", "source": "CBS News", "published_at": "2025-10-08T09:00:05Z", "relevance_score": 0.0}, {"title": "Nairobi’s ‘Birdman’: Rescuing raptors on the streets of Kenya’s capital", "description": "Rodgers Oloo Magutha, who’s lived much of his life on the streets, has big dreams of one day opening a bird shelter.", "content": "Nairobi, Kenya Shouts of Birdman! Birdman! trail 27-year-old Rodgers Oloo Magutha down a street in the centre of Kenyas capital, Nairobi.\r\nVendors pause mid-sale, police glance away from traffic, and… [+12946 chars]", "url": "https://www.aljazeera.com/features/2025/10/5/nairobis-birdman-rescuing-raptors-on-the-streets-of-kenyas-capital", "source": "Al Jazeera English", "published_at": "2025-10-05T07:43:55Z", "relevance_score": 0.0}, {"title": "Pressure mounts on Meloni’s gov’t as Gaza protests paralyse Italy", "description": "Union says more than two million took to the streets Friday, with massive turnout expected tomorrow for Rome protests.", "content": "Hundreds of thousands of people have taken to the streets across Italy as part of a general strike in solidarity with the Global Sumud Flotilla that was intercepted by Israel this week while trying t… [+6752 chars]", "url": "https://www.aljazeera.com/news/2025/10/3/pressure-mounts-on-italian-govt-over-gaza-after-strike-paralyses-nation", "source": "Al Jazeera English", "published_at": "2025-10-03T19:32:18Z", "relevance_score": 0.0}, {"title": "Conservative-led US Supreme Court seems wary of ‘conversion therapy’ ban", "description": "The high court's conservative justices express concern the ban might infringe upon therapists' freedom of speech.", "content": "The United States Supreme Court appears poised to side with a challenge against a Colorado law that bans psychotherapists from conducting conversion therapy on minors in an attempt to influence their… [+4209 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/conservative-led-us-supreme-court-seems-wary-of-conversion-therapy-ban", "source": "Al Jazeera English", "published_at": "2025-10-07T21:13:28Z", "relevance_score": 0.0}, {"title": "Is an end to Israel’s war on Gaza finally in sight?", "description": "Hamas has responded positively to Trump's Gaza peace proposal, but differences remain.", "content": "Hamas has submitted its response to United States President Donald Trumps Gaza ceasefire deal, agreeing to free all the Israeli captives it holds, but asking to negotiate other aspects of the 20-poin… [+4606 chars]", "url": "https://www.aljazeera.com/news/2025/10/3/is-an-end-to-israels-war-on-gaza-finally-in-sight", "source": "Al Jazeera English", "published_at": "2025-10-03T22:32:45Z", "relevance_score": 0.0}, {"title": "Everything you need to know about Syria’s first post-Assad elections", "description": "People's Assembly to be chosen by electoral subcommittees in first vote under interim President Ahmed al-Sharaa.", "content": "Syria will select the Peoples Assembly on Sunday in the countrys first elections since the fall of Bashar al-Assads regime in December.\r\nThe elections are a historic moment after more than 50 years o… [+5753 chars]", "url": "https://www.aljazeera.com/news/2025/10/5/everything-you-need-to-know-about-syrias-first-post-assad-elections", "source": "Al Jazeera English", "published_at": "2025-10-05T12:14:33Z", "relevance_score": 0.0}, {"title": "Syrian electors vote in indirect polls for first post-Assad parliament", "description": "Two-thirds of Syria's new parliament will be chosen by electoral colleges, with the rest appointed by interim president.", "content": "Syria is holding parliamentary elections for the first time since the overthrow of longtime ruler Bashar al-Assad, a landmark moment in the countrys fragile transition after nearly 14 years of war.\r\n… [+5191 chars]", "url": "https://www.aljazeera.com/news/2025/10/5/syrian-electors-vote-in-indirect-polls-for-first-post-assad-parliament", "source": "Al Jazeera English", "published_at": "2025-10-05T07:57:43Z", "relevance_score": 0.0}, {"title": "Russia-Ukraine war: List of key events, day 1,317", "description": "Here are the key events on day 1,317 of Russia’s war on Ukraine.", "content": "Here is how things stand on Friday, October 3, 2025:\r\nFighting\r\n<ul><li>Russian President Vladimir Putin warned Ukraine it was playing a dangerous game by striking near the Russian-occupied Zaporizhz… [+4025 chars]", "url": "https://www.aljazeera.com/news/2025/10/3/russia-ukraine-war-list-of-key-events-day-1317", "source": "Al Jazeera English", "published_at": "2025-10-03T02:15:18Z", "relevance_score": 0.0}, {"title": "Robust consumption bulwark against external shocks: FM Sitharaman", "description": "Finance Minister Nirmala Sitharaman affirmed India's economic growth is firmly anchored in robust domestic consumption, blunting external shocks. Addressing the Kautilya Economic Conclave, she emphasized India's strong resilience and evolving economic leverag…", "content": "New Delhi: Finance minister Nirmala Sitharaman Friday said Indias economic growth is firmly anchored in robust domestic consumption that blunts the impact of external shocks, and that its evident res… [+3717 chars]", "url": "https://economictimes.indiatimes.com/news/economy/finance/robust-consumption-bulwark-against-external-shocks-fm-sitharaman/articleshow/124300906.cms", "source": "The Times of India", "published_at": "2025-10-04T00:30:00Z", "relevance_score": 0.0}, {"title": "Is Donald Trump trying to dial back tensions with Brazil?", "description": "Trump's 50 percent tariffs on Brazil have strained ties. But experts say he might be smelling the coffee - literally.", "content": "Brazilian President Luiz Inacio Lula da Silva asked United States President Donald Trump to lift the 40 percent additional trade tariff imposed by the US government on Brazilian imports, in a phone c… [+8065 chars]", "url": "https://www.aljazeera.com/economy/2025/10/7/is-donald-trump-trying-to-dial-back-tensions-with-brazil", "source": "Al Jazeera English", "published_at": "2025-10-07T12:21:16Z", "relevance_score": 0.0}, {"title": "Supreme Court hears arguments involving Colorado \"conversion therapy\" ban", "description": "The Supreme Court is hearing a challenge to a Colorado law banning \"conversion therapy\" for minors that was brought by a licensed counselor in the state.", "content": "Washington — The Supreme Court is set to hear arguments Tuesday in a Colorado counselor's challenge to the state's ban on \"conversion therapy\" for minors.\r\nThe case was brought by Kaley Chiles, who a… [+5107 chars]", "url": "https://www.cbsnews.com/news/supreme-court-arguments-colorado-conversion-therapy-ban/", "source": "CBS News", "published_at": "2025-10-07T13:30:02Z", "relevance_score": 0.0}]}