{"timestamp": 1760215524.286746, "data": {"url": "https://www.cbsnews.com/news/nobel-peace-prize-donald-trump-what-to-know/", "title": "What is the Nobel Peace Prize and could Donald Trump get it? What to know about the international honor.", "text": "Barack Obama. Jimmy Carter. Woodrow Wilson. Teddy Roosevelt. Al Gore. And Donald Trump?\n\nPresident Trump hopes to join the exclusive list of presidents and vice presidents who have received one of the world's most prestigious honors: the Nobel Peace Prize, which will be announced Friday.\n\nThe international award honors people or organizations whose work makes the world a more peaceful place. Nominees aren't made public by the Nobel Committee, but some individuals publicly share who they nominate. World leaders, humanitarians and international organizations have received the peace prize since it was first given out in the early 20th century.\n\nHere's what to know about the Nobel Peace Prize and if Mr. Trump could receive it:\n\nWhen is the 2025 Nobel Peace Prize awarded?\n\nThe 2025 winner of the Nobel Peace Prize will be announced on Friday, Oct. 10 at 5 a.m. ET. It will be awarded on Dec. 10 at a formal ceremony in Oslo, Norway.\n\nWhat is the Nobel Peace Prize?\n\nThe Nobel Prize was established by a Swedish businessman named Alfred Nobel. In his will, he said that his fortune was to be used to establish a fund that could distribute prizes \"to those who ... shall have conferred the greatest benefit on mankind,\" according to the Nobel Peace Prize's website.\n\nNobel's will specified that it be given \"to the person who shall have done the most or the best work for fraternity between the nations and the abolition or reduction of standing armies and the formation and spreading of peace congresses,\" but many different kinds of work have been honored, including efforts to combat climate change and promote democracy.\n\nThe award has been given to politicians who sought international peace, people who have worked for arms control and nuclear disarmament, and international human rights agencies. Other Nobel prizes are awarded for achievements in medicine, literature and other fields.\n\nWinners receive a medal, diploma and monetary prize, according to the award's website. The 6.6-centimeter gold medal shows a portrait of Nobel, with his name, birth year and year of death engraved on the edge. The back of the medal shows three men embracing, to symbolize international fraternity, and is engraved with the phrase \"For peace and fraternity among peoples\" in Latin.\n\nHow is the Nobel Peace Prize awarded?\n\nAccording to the prize's website, the Nobel Peace Prize should be awarded to the person who has done the most to advance peace in the world. It is awarded by a committee selected by Norway's parliament. The other Nobel prizes are awarded in Sweden.\n\nAny person or organization can be nominated by any eligible nominators, according to the prize's website. Eligible nominators include members of national assemblies, members of governments, members of bodies like the International Court of Justice, college professors or directors and former prizewinners or members of the Nobel Committee. The nomination deadline is Jan. 31. Over 330 candidates were submitted for the 2025 Nobel Peace Prize.\n\nThe nominations aren't vetted before the nomination deadline, according to the prize's website, so nominations are not endorsements from the committee. The committee does not publicly comment on nominees. The names of nominees and nominating committee can't be announced for 50 years.\n\nOnce the deadline passes, the Nobel Committee looks at the nominees and creates a shortlist of \"the most interesting and worthy candidates.\" Those shortlisted nominees then undergo \"assessments and examinations\" from committee members, according to the prize's website.\n\nThe committee then decides on the winner or winners of the Nobel Peace Prize at its last meeting before the prize winners are announced in early October. The decision is made by majority vote, according to the prize website, but the committee attempts to make a unanimous decision on the winner.\n\nWho has won the Nobel Peace Prize?\n\nThe Nobel Peace Prize has been awarded 105 times since 1901, according to the prize's website. One hundred and thirty-nine laureates have been awarded, including 92 men, 19 women and 28 organizations.\n\nThe prize's first recipients were French scientist and politician Frédéric Passy and Jean Henry Durant, a Swiss businessman and co-founder of the Red Cross. Passy was honored for his \"lifelong work for international peace conferences, diplomacy and arbitration,\" while Durant received the award for his \"humanitarian efforts to help wounded soldiers and create international understanding,\" according to the prize's website.\n\nOther notable prizewinners have included Pakistani activist Malala Yousafzai in 2014 and former President Barack Obama in 2009. Obama's win, for \"extraordinary efforts to strengthen international diplomacy and cooperation between peoples,\" was considered a surprise, as he had been in office for less than a year.\n\nFormer President Jimmy Carter received the honor in 2002. Holocaust survivor and author Elie Wiesel was awarded the Nobel Peace Prize in 1986, and Bishop Desmond Tutu, who worked to end apartheid in South Africa, received it in 1984.\n\nOrganizations that have received the Nobel Peace Prize include the United Nations' World Food Program and the International Campaign to Abolish Nuclear Weapons.\n\nCould Donald Trump get the Nobel Peace Prize?\n\nMr. Trump has touted himself as the \"president of peace\" and has said he ended six or seven wars during his second term, including conflicts between Israel and Iran, India and Pakistan and Thailand and Cambodia. Not all of the conflicts have been fully settled, and it's not clear if the United States' actions or influence were decisive in all of them, foreign policy experts previously told CBS News. Mr. Trump also proposed a peace deal for Israel and Hamas that was agreed to on Wednesday, and he has spoken with world leaders about ending Russia's war in Ukraine.\n\nMr. Trump told reporters in June that the Nobel Committee \"should give\" him the Nobel Peace Prize, and that he \"should have gotten it four or five times.\" In September, Mr. Trump told United Nations delegates that \"everyone says\" he should get the award. He made similar comments when military generals gathered in Virginia last week.\n\nIn private, Mr. Trump has told some associates that his presidency might be remembered for his pursuit of peace more than anything else, a source close to him told CBS News' Robert Costa. The president would like to be considered for the honor, but expectations inside the White House are low that he would get a \"fair hearing\" by the Nobel Committee, another source said.\n\nMr. Trump was nominated for the prize by Israeli Prime Minister Benjamin Netanyahu in July and by the government of Pakistan in June. This week, the Israeli Hostages Families Forum called on the Nobel Prize committee to give the peace prize to Mr. Trump for his \"unwavering commitment and extraordinary leadership\" in seeking a deal to bring home the remaining hostages taken by Hamas on Oct. 7, 2023. Netanyahu repeated his call for Mr. Trump to receive the peace prize Thursday after Israel and Hamas agreed to the \"first phase\" of a deal he helped broker to end the war in Gaza.\n\nBut these efforts have come past the deadline for the 2025 Nobel Peace Prize, and it wasn't immediately clear if Mr. Trump was nominated for the 2025 prize. He was also nominated for the prize during his first term.\n\nExperts told The Associated Press the Nobel Committee is unlikely to award Mr. Trump the prize for his second-term achievements so far. However, Obama was awarded the prize without having secured any peace agreements in his first year in the White House.\n\nThe committee tends to focus on \"the durability of peace, the promotion of international fraternity and the quiet work of institutions that strengthen those goals,\" the AP reported. The committee also likely does not want to be seen as caving to political pressure, one expert told the AP.", "authors": ["Kerry  Breen"], "published_date": "2025-10-08T05:00:00-04:00", "top_image": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/07/2e99053a-ab78-4ec6-a99a-cd26b2e198c7/thumbnail/1200x630/4fcad219084653901f9c69b0e17fff12/gettyimages-1832757177.jpg", "summary": "Here's what to know about the Nobel Peace Prize and if Mr. Trump could receive it: When is the 2025 Nobel Peace Prize awarded?\nThe 2025 winner of the Nobel Peace Prize will be announced on Friday, Oct. 10 at 5 a.m.\nCould Donald Trump get the Nobel Peace Prize?\nMr. Trump told reporters in June that the Nobel Committee \"should give\" him the Nobel Peace Prize, and that he \"should have gotten it four or five times.\"\nBut these efforts have come past the deadline for the 2025 Nobel Peace Prize, and it wasn't immediately clear if Mr. Trump was nominated for the 2025 prize.", "keywords": ["donald", "honor", "peace", "nobel", "prize", "trump", "international", "committee", "mr", "awarded", "website", "prize's", "told", "received", "president", "award", "work", "world", "nominees", "2025", "members", "announced", "organizations", "fraternity", "efforts", "nominated", "deadline", "obama", "receive", "winner", "prizes", "person", "nations", "including", "winners"], "success": true, "error": null}}