{"timestamp": 1760215521.737654, "data": [{"title": "What is the Nobel Peace Prize — and could Donald Trump get it?", "description": "The winner of the 2025 Nobel Peace Prize will be announced Friday. Here's what to know about the honor and President Trump's interest.", "content": "Barack Obama. Jimmy Carter. Woodrow Wilson. Teddy Roosevelt. Al Gore. And Donald Trump?\r\nPresident Trump hopes to join the exclusive list of presidents and vice presidents who have received one of th… [+8230 chars]", "url": "https://www.cbsnews.com/news/nobel-peace-prize-donald-trump-what-to-know/", "source": "CBS News", "published_at": "2025-10-08T09:00:05Z", "relevance_score": 0.885}, {"title": "Who are the five Nobel Peace Prize judges deciding whether Trump gets it?", "description": "Donald Trump insists he wins the prize, which will be announced on Friday. These five people decide who gets it.", "content": "Five members of Norways Nobel Committee could hold the key to United States President Donald Trumps much-desired moment of glory being named this years winner of the Nobel Peace Prize.\r\nEach year, th… [+13373 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/who-are-the-five-nobel-peace-prize-judges-deciding-whether-trump-gets-it", "source": "Al Jazeera English", "published_at": "2025-10-10T02:15:31Z", "relevance_score": 0.75}, {"title": "Why María Corina Machado was awarded the Nobel Peace Prize", "description": "María Corina Machado, the Venezuelan political opposition leader, has received the 2025 Nobel Peace Prize, the Norwegian Nobel Committee announced Friday. CBS News' Lilia Luciano explains why.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/why-mara-corina-machado-was-awarded-the-nobel-peace-prize/", "source": "CBS News", "published_at": "2025-10-10T15:23:00Z", "relevance_score": 0.63}, {"title": "Watch: Venezuelan opposition leader Marina Corina Machado learns she's won Nobel Peace Prize", "description": "Venezuelan opposition leader Maria Corina Machado was stunned after she learned that she won the Nobel Peace Prize in an emotional call from the institute's secretary, Kristian Berg Harpviken. Machado was given the award for fighting the dictatorship in Venez…", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/marina-corina-machado-nobel-peace-prize-venezuela/", "source": "CBS News", "published_at": "2025-10-10T15:33:00Z", "relevance_score": 0.63}, {"title": "Nobel Peace Prize 2025: What are Trump’s credentials, and can he win?", "description": "With the Gaza ceasefire deal, Trump claims to have helped broker peace in eight wars. Do his assertions hold up?", "content": "As the Norwegian Nobel Committee prepares to announce this years winner of the Nobel Peace Prize, one name, one persona hovers over its decision the United States president, Donald Trump.\r\nSince step… [+11807 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/nobel-peace-prize-2025-what-are-trumps-credentials-and-can-he-win", "source": "Al Jazeera English", "published_at": "2025-10-09T10:39:50Z", "relevance_score": 0.6}, {"title": "Rare access inside the Nobel Peace Prize selection process", "description": "The Nobel Peace Prize Committee is set to announce what may be likely its most anticipated award since it was first awarded in 1901. The BBC's Mark Lowen got rare access to the room where the vote happens.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/rare-access-inside-the-nobel-peace-prize-selection-process/", "source": "CBS News", "published_at": "2025-10-10T00:18:00Z", "relevance_score": 0.6}, {"title": "Who is Maria Corina Machado, 2025 winner of the Nobel Peace Prize?", "description": "The 'Iron Lady' of Venezeula, an opposition leader who is currently in hiding, has been lauded by the Nobel Committee.", "content": "Maria Corina Machado, the Venezuelan opposition politician who was barred from standing in last years presidential election, has been awarded this years Nobel Peace Prize.\r\nIn a post on the social me… [+9995 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/who-is-maria-corina-machado-2025-winner-of-the-nobel-peace-prize", "source": "Al Jazeera English", "published_at": "2025-10-10T13:45:59Z", "relevance_score": 0.595}, {"title": "Trump quest for Peace Prize falls short...", "description": "The White House is responding bitterly to President Donald Trump being passed over for the Nobel Peace Prize despite efforts from Republicans and world leaders. A White House spokesman said Friday members of “the Nobel Committee proved they place politics ove…", "content": "WASHINGTON (AP) President Donald Trump was passed over for the Nobel Peace Prize on Friday despite jockeying from his fellow Republicans, various world leaders and most vocally himself.\r\nVenezuelan o… [+6165 chars]", "url": "https://apnews.com/article/donald-trump-misses-out-on-nobel-peace-prize-729973788d8953da9af1cbc136232e96", "source": "Associated Press", "published_at": "2025-10-10T11:37:37Z", "relevance_score": 0.5700000000000001}, {"title": "Nobel Peace Prize 2025 live: Trump shadow hovers as winner to be announced", "description": "The prestigious award will be announced at the Norwegian Nobel Institute in Oslo at 09:00 GMT.", "content": "blinking-dot\r\nLive updatesLive updates, \r\nThe prestigious award will be announced at the Norwegian Nobel Institute in Oslo at 09:00 GMT.", "url": "https://www.aljazeera.com/news/liveblog/2025/10/10/nobel-peace-prize-2025", "source": "Al Jazeera English", "published_at": "2025-10-10T06:00:00Z", "relevance_score": 0.55}, {"title": "Snubbed by Nobel, Trump to head to Middle East to celebrate Gaza ‘peace’", "description": "White House decries Nobel Committee's decision not to hand Peace Prize to Donald Trump after Gaza ceasefire deal.", "content": "United States President Donald Trump is heading to the Middle East on Sunday as he looks to assert his perceived role as a peacemaker in the region after the Gaza ceasefire deal.\r\nThe visit would com… [+3589 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/snubbed-by-nobel-trump-to-head-to-middle-east-to-celebrate-gaza-peace", "source": "Al Jazeera English", "published_at": "2025-10-10T15:32:15Z", "relevance_score": 0.53}, {"title": "Complete list of Nobel Peace Prize winners (1901–2024)", "description": "The Nobel Peace Prize has been awarded 105 times to 142 laureates in its 124 year history.", "content": "The 2025 Nobel Peace Prize is scheduled to be announced on Friday, October 10, at 11:00 am local time in Oslo, Norway (09:00 GMT).\r\nThe announcement comes from the Norwegian Nobel Institute on behalf… [+5988 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/complete-list-of-nobel-peace-prize-winners-1901", "source": "Al Jazeera English", "published_at": "2025-10-10T02:52:17Z", "relevance_score": 0.53}, {"title": "María Corina Machado wins Nobel Peace Prize", "description": "Venezuelan political opposition leader Maria Corina Machado has been awarded the 2025 Nobel Peace Prize. CBS News' Ramy Inocencio reports.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/mara-corina-machado-wins-nobel-peace-prize/", "source": "CBS News", "published_at": "2025-10-10T13:18:37Z", "relevance_score": 0.51}, {"title": "Venezuela’s opposition leader Machado wins Nobel Peace Prize 2025", "description": "The Nobel Committee announced Venezuela&#039;s opposition leader Maria Corina Machado as this year’s Nobel Peace Prize winner", "content": "NewsFeed\r\nFor her tireless work promoting democratic rights for the people of Venezuela. The Nobel Committee has announced Venezuelas opposition leader Maria Corina Machado as this years Nobel Peace … [+12 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/10/venezuelas-opposition-leader-machado-wins-nobel-peace-prize-2025", "source": "Al Jazeera English", "published_at": "2025-10-10T09:31:59Z", "relevance_score": 0.5}, {"title": "Video shows moment Nobel Peace prize recipient learns about honor", "description": "An emotional Maria Corina Machado can be heard saying she was honored, humbled and grateful \"on behalf of the Venezuelan people\" to receive the Nobel Peace Prize.", "content": "Venezuelan opposition leader Maria Corina Machado said receiving the Nobel Peace Prize was \"an achievement of a whole society.\"\r\nA video shared on social media shows Kristian Berg Harpviken, the dire… [+2827 chars]", "url": "https://www.cbsnews.com/news/video-nobel-peace-prize-maria-corina-machado-venezuela/", "source": "CBS News", "published_at": "2025-10-10T15:14:19Z", "relevance_score": 0.5}, {"title": "2025 Nobel Peace Prize awarded to Venezuela's Maria Corina Machado", "description": "Venezuelan opposition leader Maria Corina Machado was awarded the 2025 Nobel Peace Prize for fighting for democracy in her country.", "content": "The 2025 Nobel Peace Prize was awarded on Friday to Venezuelan political opposition leader Maria Corina Machado, \"for her tireless work promoting democratic rights for the people of Venezuela and for… [+3235 chars]", "url": "https://www.cbsnews.com/news/nobel-peace-prize-maria-corina-machado-venezuela-opposition-leader-2025/", "source": "CBS News", "published_at": "2025-10-10T09:11:11Z", "relevance_score": 0.5}, {"title": "Nobel Peace Prize awarded to Venezuela's Maria Corina Machado", "description": "The Nobel Peace Prize was awarded Friday to Venezuelan opposition leader María Corina Machado who lives in hiding after attempting to run against President Nicolás Maduro", "content": "The Nobel Peace Prize was awarded Friday to Venezuelan opposition leader María Corina Machado who lives in hiding after attempting to run against President Nicolás Maduro.\r\nMachado, 58, was recognize… [+1075 chars]", "url": "https://www.nbcnews.com/world/europe/nobel-peace-prize-awarded-venezuelas-maria-corina-machado-rcna236816", "source": "NBC News", "published_at": "2025-10-10T09:03:40Z", "relevance_score": 0.5}, {"title": "Venezuelan opposition leader Maria Corina Machado wins Nobel Peace Prize", "description": "Maria Corina Machado, a leading voice against President Nicolás Maduro, was awarded the Nobel Peace Prize. Machado, who is currently in hiding, was recognized for uniting Venezuela's opposition after last year's disputed election.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/venezuelan-opposition-leader-maria-corina-machado-wins-nobel-peace-prize/", "source": "CBS News", "published_at": "2025-10-10T15:04:00Z", "relevance_score": 0.48000000000000004}, {"title": "Nobel Peace Prize goes to Venezuelan leader Maria Machado: 'Democracy is in retreat'", "description": "The Nobel Committee called her \"a brave and committed champion of peace.\"", "content": "LONDON -- The 2025 Nobel Peace Prize has been awarded to Maria Corina Machado for her tireless work promoting democratic rights for the people of Venezuela and for her struggle to achieve a just and … [+3549 chars]", "url": "https://abcnews.go.com/International/nobel-peace-prize-awarded-maria-corina-machado/story?id=126355178", "source": "ABC News", "published_at": "2025-10-10T09:20:26Z", "relevance_score": 0.4750000000000001}, {"title": "Nobel Prize 2025: What they are, when will the awards be announced?", "description": "Nobel Prize for medicine to be announced on Monday, followed by five other prizes to be declared over the next week.", "content": "The Nobel Prize 2025 officially kicks off with the first award, for physiology or medicine, to be announced on Monday, setting the stage for a week of global anticipation.\r\nThe full schedule, spannin… [+9081 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/nobel-prize-2025-what-they-are-when-will-the-awards-be-announced", "source": "Al Jazeera English", "published_at": "2025-10-06T09:07:20Z", "relevance_score": 0.4650000000000001}, {"title": "5 things to know for Oct. 10: Government shutdown, Gaza ceasefire plan, Nobel Peace Prize, Letitia James, Philippines quake", "description": "CNN’s 5 Things AM brings you the news you need to know every morning.", "content": "Travelers waiting in airport security lines across the US will now be met with a new video blaming Democratic lawmakers for the government shutdown. Its a notable departure from standard practice, as… [+5601 chars]", "url": "https://www.cnn.com/2025/10/10/us/5-things-to-know-for-oct-10-government-shutdown-gaza-ceasefire-plan-nobel-peace-prize-letitia-james-philippines-quake", "source": "CNN", "published_at": "2025-10-10T10:35:04Z", "relevance_score": 0.395}, {"title": "Venezuelan opposition leader Maria Corina Machado wins Nobel Peace Prize", "description": "This is a developing news story.", "content": "María Corina Machado, a key opposition leader in Venezuela, has been awarded the Nobel Peace Prize for 2025.\r\nShe is receiving the Nobel Peace Prize for her tireless work promoting democratic rights … [+1749 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/nobel-peace-prize-2025-maria-corina-machado", "source": "Al Jazeera English", "published_at": "2025-10-10T09:09:37Z", "relevance_score": 0.38500000000000006}, {"title": "Israel announces timeline for implementing first phase of peace plan", "description": "A government spokesperson has laid out how Israel will implement the first phase of the peace plan for Gaza.", "content": "NewsFeed\r\nA government spokesperson has laid out how Israel will implement the first phase of US President Donald Trumps peace plan in Gaza, saying it will start after todays Israeli government cabin… [+10 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/israel-announces-timeline-for-implementing-first-phase-of-peace-plan", "source": "Al Jazeera English", "published_at": "2025-10-09T16:15:30Z", "relevance_score": 0.35500000000000004}, {"title": "Trump: US-Israel ‘very close to making a deal’ on Gaza peace plan", "description": "Donald Trump says a Middle East peace deal is “very close,” while pledging US security guarantees for Gaza.", "content": "NewsFeed\r\nDonald Trump says a Middle East peace deal is very close, pledging US security guarantees for Gaza two years after the war began. American envoys are heading to Egypt for what officials des… [+69 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/7/trump-us-israel-very-close-to-making-a-deal-on-gaza-peace-plan", "source": "Al Jazeera English", "published_at": "2025-10-07T20:36:31Z", "relevance_score": 0.35000000000000003}, {"title": "Can Trump turn a Gaza ceasefire into a lasting peace deal?", "description": "Israel and Hamas have agreed to the first phase of a peace deal", "content": "Available for over a year\r\nThere was an extraordinary moment at White House on Wednesday when, in front of reporters, secretary of state Marco Rubio handed Donald Trump a note that read the words ver… [+2036 chars]", "url": "https://www.bbc.co.uk/sounds/play/p0m7qcbp", "source": "BBC News", "published_at": "2025-10-09T16:32:00Z", "relevance_score": 0.34500000000000003}, {"title": "Trump appears to reveal another strike on alleged cartel drug boat", "description": "President Donald Trump appeared to reveal Sunday that the U.S. had carried out another strike on an alleged drug cartel boat from Venezuela.", "content": "President Donald Trump appeared on Sunday to reveal the U.S. had conducted another strike on an alleged cartel drug boat as he celebrated the 250th anniversary of the U.S. Navy aboard the aircraft ca… [+2529 chars]", "url": "https://abcnews.go.com/Politics/trump-appears-reveal-strike-alleged-cartel-drug-boat/story?id=126237676", "source": "ABC News", "published_at": "2025-10-06T00:45:40Z", "relevance_score": 0.34500000000000003}, {"title": "Jordanian-born Palestinian chemist awarded Nobel Prize", "description": "Omar M. Yaghi, a chemist born to Palestinian refugee parents in Jordan, has been awarded a Nobel Prize.", "content": "NewsFeed\r\nOmar M. Yaghi, a chemist born to Palestinian refugee parents in Jordan, has been awarded a joint Nobel Prize for his work on metal organic frameworks.", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/8/jordanian-born-palestinian-chemist-awarded-nobel-prize", "source": "Al Jazeera English", "published_at": "2025-10-08T17:43:44Z", "relevance_score": 0.34500000000000003}, {"title": "Trump’s use of the National Guard faces critical legal tests", "description": "In two courthouses on opposite sides of the country, Donald Trump’s attempt to send troops into Democratic-led cities will face a critical legal test on Thursday.", "content": "In two courthouses on opposite sides of the country, Donald Trumps attempt to send troops into Democratic-led cities will face a critical legal test on Thursday.\r\nThe Ninth Circuit Court of Appeals i… [+4123 chars]", "url": "https://abcnews.go.com/Politics/trumps-national-guard-faces-critical-legal-tests/story?id=126354650", "source": "ABC News", "published_at": "2025-10-09T11:21:57Z", "relevance_score": 0.34500000000000003}, {"title": "Putin backs Trump’s Gaza peace plan, will support ‘peaceful efforts’", "description": "Russian President Vladimir Putin said Moscow supports US President Donald Trump’s plan to end the Gaza war.", "content": "NewsFeed\r\nRussian President Vladimir Putin said Moscow supports US President Donald Trumps plan to end the Gaza war, expressing hope it will be implemented. Speaking at a regional summit in Tajikista… [+79 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/putin-backs-trumps-gaza-peace-plan-will-support-peaceful", "source": "Al Jazeera English", "published_at": "2025-10-09T16:04:45Z", "relevance_score": 0.34500000000000003}, {"title": "Is Donald Trump trying to dial back tensions with Brazil?", "description": "Trump's 50 percent tariffs on Brazil have strained ties. But experts say he might be smelling the coffee - literally.", "content": "Brazilian President Luiz Inacio Lula da Silva asked United States President Donald Trump to lift the 40 percent additional trade tariff imposed by the US government on Brazilian imports, in a phone c… [+8065 chars]", "url": "https://www.aljazeera.com/economy/2025/10/7/is-donald-trump-trying-to-dial-back-tensions-with-brazil", "source": "Al Jazeera English", "published_at": "2025-10-07T12:21:16Z", "relevance_score": 0.315}, {"title": "What impact has the genocide in Gaza had on US-Israeli relations?", "description": "US President Donald Trump pressed Israel&#039;s prime minister to agree to a ceasefire deal.", "content": "US President Donald Trump pressed Israels prime minister to agree to a ceasefire deal.A ceasefire agreement for Gaza and cautious hope among Palestinians for an end to two years of genocide.\r\nUS Pres… [+383 chars]", "url": "https://www.aljazeera.com/video/inside-story/2025/10/9/what-impact-has-the-genocide-in-gaza-had-on-us-israeli-relations", "source": "Al Jazeera English", "published_at": "2025-10-09T22:00:17Z", "relevance_score": 0.31}, {"title": "Nobel Prize for medicine awarded to immune system researchers", "description": "The international team discovered how the immune system is kept in check to prevent it attacking the body.", "content": "The Nobel Prize in physiology or medicine has been awarded to Mary E Brunkow, Fred Ramsdell and Shimon Sakaguchi for their work on the functioning of the human immune system.\r\nThe award, announced by… [+1505 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/nobel-prize-for-medicine-awarded-to-immune-system-researchers", "source": "Al Jazeera English", "published_at": "2025-10-06T09:37:31Z", "relevance_score": 0.29000000000000004}, {"title": "Nobel Prize for Physics awarded to trio for quantum mechanics discoveries", "description": "Prize awarded for \"discovery of macroscopic quantum mechanical tunnelling, energy quantisation in an electric circuit\".", "content": "The Royal Swedish Academy of Sciences has awarded the 2025 Nobel Prize in Physics to John Clarke, Michel H. Devoret, and John M. Martinis for work on quantum mechanic tunnelling.\r\nThe award, announce… [+780 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/nobel-prize-for-physics-awarded-for-quantum-mechanic-tunnelling", "source": "Al Jazeera English", "published_at": "2025-10-07T09:52:47Z", "relevance_score": 0.29000000000000004}, {"title": "A decolonised alternative to Trump’s Gaza peace plan", "description": "Only a decolonised plan centred on Palestinian sovereignty can bring lasting peace to Gaza.", "content": "United States President Donald Trumps 20-point Gaza peace plan offers some constructive proposals on hostages, humanitarian aid, and reconstruction. Yet it is marred by an unmistakable colonial frame… [+8883 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/8/a-decolonised-alternative-to-trumps-gaza-peace-plan", "source": "Al Jazeera English", "published_at": "2025-10-08T13:13:17Z", "relevance_score": 0.28500000000000003}, {"title": "Gaza bombarded despite Donald Trump telling Israel to stop", "description": "Israel struck Gaza killing dozens, in spite of Trump&#039;s call for it to immediately halt its bombing.", "content": "NewsFeed\r\nIsraeli attacks have continued across Gaza, killing dozens of Palestinians, in spite of US President Donald Trumps direct call for Israel to immediately halt its bombing. Hamas said it acce… [+54 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/5/gaza-bombarded-despite-donald-trump-telling-israel-to-stop", "source": "Al Jazeera English", "published_at": "2025-10-05T13:06:52Z", "relevance_score": 0.28}, {"title": "Will Trump’s Gaza Peace Plan Work?", "description": "Trump urges mediators to “move fast” as key Gaza talks begin.", "content": "Available for over a year\r\nToday, negotiators from Israel and Hamas head to Sharm El-Sheikh in Egypt to start indirect talks over an end to the Israel-Gaza war. \r\nIt appears this is the closest both … [+1659 chars]", "url": "https://www.bbc.co.uk/sounds/play/p0m72zf5", "source": "BBC News", "published_at": "2025-10-06T18:03:00Z", "relevance_score": 0.275}, {"title": "Trump touts 'momentous breakthrough' on Israel-Hamas ceasefire deal", "description": "President Trump took a victory lap on Israel and Hamas agreeing to implement the first phase of his 20-point peace plan, but questions remain about what happens after.", "content": "President Donald Trump, on the cusp of a major diplomatic achievement months in the making, took a victory lap Thursday on the agreement between Israel and Hamas to implement the first phase of his 2… [+3647 chars]", "url": "https://abcnews.go.com/Politics/trump-touts-momentous-breakthrough-israel-hamas-ceasefire-deal/story?id=126360613", "source": "ABC News", "published_at": "2025-10-09T21:04:50Z", "relevance_score": 0.26}, {"title": "Nobel Prize for Literature awarded to Hungarian writer László Krasznahorkai", "description": "Krasznahorkai, 71, was recognised for his \"compelling and visionary oeuvre\".", "content": "The Royal Swedish Academy of Sciences has awarded the 2025 Nobel Prize in Literature to Hungarian novelist and screenwriter László Krasznahorkai.\r\nThe second Hungarian to win the prestigious literary… [+1876 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/nobel-prize-for-literature-awarded", "source": "Al Jazeera English", "published_at": "2025-10-09T11:05:59Z", "relevance_score": 0.26}, {"title": "Chemistry Nobel Prize awarded to trio in field of metal–organic frameworks", "description": "Susumu Kitagawa, Richard Robson and Omar M Yaghi’s work can be used to harvest water from desert air.", "content": "The Royal Swedish Academy of Sciences has awarded the 2025 Nobel Prize in chemistry to Susumu Kitagawa, Richard Robson and Omar M Yaghi for their work in the development of metal-organic frameworks.\r… [+1226 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/nobel-prize-in-chemistry-awarded", "source": "Al Jazeera English", "published_at": "2025-10-08T09:56:46Z", "relevance_score": 0.26}, {"title": "Booker says shutdown standoff is a 'tsunami of Donald Trump's creation'", "description": "Democrat tells \"This Week\" \"It's really a moment of health care crisis.\"", "content": "Sen. Cory Booker, D-N.J., said talks are stalled on the fifth day of the government shutdown, with Democrats seeking to undo Medicaid cuts and restore Obamacare subsidies and Republicans demanding a … [+652 chars]", "url": "https://abcnews.go.com/Politics/booker-shutdown-standoff-tsunami-donaldtrumps-creation/story?id=126227211", "source": "ABC News", "published_at": "2025-10-05T13:45:40Z", "relevance_score": 0.245}, {"title": "Trump announces Gaza ceasefire deal: What we know and what’s next", "description": "This is the first phase of a 20-point plan announced by Trump last week.", "content": "United States President Donald Trump has announced that Israel and Hamas have agreed on the first phase of a peace framework that aims at a Gaza ceasefire and the release of Israeli captives and Pale… [+6862 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/trump-announces-gaza-ceasefire-deal-what-we-know-and-whats-next", "source": "Al Jazeera English", "published_at": "2025-10-09T05:05:38Z", "relevance_score": 0.23500000000000001}, {"title": "Trump: Hamas-held captives to be released ‘Monday or Tuesday’", "description": "US President Donald Trump says the Hamas-held captives in Gaza will be released “Monday or Tuesday&quot;.", "content": "NewsFeed\r\nUS President Donald Trump says the Hamas-held captives in Gaza will be released Monday or Tuesday as part of his ceasefire plan creating peace in the Middle East. He added it is time for th… [+71 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/trump-hamas-held-captives-to-be-released-monday-or", "source": "Al Jazeera English", "published_at": "2025-10-09T16:55:55Z", "relevance_score": 0.23000000000000004}, {"title": "Trump walks back offer to talk to Democrats as government shutdown extends", "description": "US President Donald Trump says Democrats must end the shutdown before talks can start after six days of gridlock.", "content": "US President Donald Trump suggested on Monday that he was ready to negotiate with Democrats over healthcare subsidies to break a deadlock over the continuing government shutdown, before walking back … [+2677 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/trump-walks-back-offer-to-talk-to-democrats-as-government-shutdown-extends", "source": "Al Jazeera English", "published_at": "2025-10-07T03:11:52Z", "relevance_score": 0.22500000000000003}, {"title": "Trump says UFC fight at White House to be staged on his 80th birthday", "description": "US President Donald Trump announces the 'big UFC fight' on the White House grounds will now take place on June 14.", "content": "An Ultimate Fighting Championship (UFC) fight planned at the White House will take place on Donald Trumps 80th birthday, the United States president said, despite the much-hyped event having been pre… [+2247 chars]", "url": "https://www.aljazeera.com/sports/2025/10/6/trump-says-ufc-fight-at-white-house-to-be-staged-on-his-80th-birthday", "source": "Al Jazeera English", "published_at": "2025-10-06T08:15:15Z", "relevance_score": 0.22500000000000003}, {"title": "Gov Newsom says Trump is sending California National Guard troops to Oregon", "description": "The deployment would mark the latest escalation of Donald Trump’s use of US federal intervention in Democrat-led cities.", "content": "California Governor Gavin Newsom has said that US President Donald Trump is sending 300 California National Guard members to Oregon, after a judge temporarily blocked his administration from deployin… [+3307 chars]", "url": "https://www.aljazeera.com/news/2025/10/5/gov-newsom-says-trump-is-sending-california-national-guard-troops-to-oregon", "source": "Al Jazeera English", "published_at": "2025-10-05T19:59:29Z", "relevance_score": 0.22500000000000003}, {"title": "Trump live: US courts to examine troop deployments in Chicago, Portland", "description": "US President Donald Trump's troop deployments will be further tested in two court hearings in different US states.", "content": "blinking-dot\r\nLive updatesLive updates, \r\nUS President Donald Trumps National Guard deployments will be tested in two court hearings in different US states, as governors resisting the militarisation … [+57 chars]", "url": "https://www.aljazeera.com/news/liveblog/2025/10/9/trump-live-us-courts-to-examine-troop-deployments-in-chicago-portland", "source": "Al Jazeera English", "published_at": "2025-10-09T14:00:49Z", "relevance_score": 0.22500000000000003}, {"title": "Russia says prospects for Ukraine peace deal now faded as its war rages on", "description": "Senior official Sergey Ryabkov says 'momentum generated' from the Trump-Putin summit has 'largely been undermined'.", "content": "Russia appears resigned to the collapse of peace efforts for the war it instigated, and prosecutes to this day, in Ukraine following President Vladimir Putins summit with his United States counterpar… [+4095 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/russia-says-prospects-for-ukraine-peace-deal-now-faded-as-its-war-rages-on", "source": "Al Jazeera English", "published_at": "2025-10-08T14:35:19Z", "relevance_score": 0.22000000000000003}, {"title": "US Senate fails to curb Trump’s power to strike drug cartels", "description": "Democrats say President Donald Trump does not have the power to use force without the approval of Congress.", "content": "Senate Republicans have voted down a bill that would have curtailed President Donald Trumps use of force against drug cartels after he authorised strikes on boats suspected of engaging in drug traffi… [+2644 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/us-senate-fails-to-curb-trumps-power-to-strike-drug-cartels", "source": "Al Jazeera English", "published_at": "2025-10-09T07:08:06Z", "relevance_score": 0.22000000000000003}, {"title": "WATCH: Trump says Sean 'Diddy' Combs asked him for a pardonvv", "description": "President Donald Trump said that Sean \"Diddy\" Combs has reached out to ask him for a pardon following his conviction on two prostitution-related charges.", "content": "<ul><li>Nova music festival massacre survivor: 'I remember just running for my life'\r\n</li><li>Trump says Sean 'Diddy' Combs asked him for a pardon\r\n</li><li>Government shutdown's impact on air traff… [+4405 chars]", "url": "https://abcnews.go.com/US/video/trump-sean-diddy-combs-asked-pardon-126299891", "source": "ABC News", "published_at": "2025-10-07T16:52:50Z", "relevance_score": 0.21500000000000002}, {"title": "What to know about the proposed Israel-Hamas Gaza ceasefire", "description": "U.S. President Donald Trump's last month proposed a 20-point plan for for a ceasefire in the Gaza Strip ahead of this week's negotiations in Egypt.", "content": "LONDON -- LONDON and TEL AVIV -- Israeli Prime Minister Benjamin Netanyahu will convene his cabinet to discuss the proposed Gaza Strip ceasefire deal on Thursday, with the cabinet and the wider gover… [+3133 chars]", "url": "https://abcnews.go.com/International/israel-hamas-ceasefire-gaza-proposed-deal/story?id=126318216", "source": "ABC News", "published_at": "2025-10-09T11:53:22Z", "relevance_score": 0.21500000000000002}, {"title": "World reacts to Gaza ceasefire deal announced by Trump", "description": "Leaders and groups around the world celebrate negotiators signing off on first phase of the Gaza ceasefire agreement.", "content": "Israel and Hamas have agreed to the first phase of a ceasefire deal built off United States President Donald Trumps 20-point plan aimed at ending Israels war on Gaza.\r\nThis means that ALL of the Host… [+8491 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/world-reacts-to-gaza-ceasefire-deal-announced-by-trump", "source": "Al Jazeera English", "published_at": "2025-10-09T06:44:00Z", "relevance_score": 0.2}, {"title": "What’s next for the Palestinian resistance movements?", "description": "Donald Trump&#039;s 20-point plan bars any future Gaza role for Hamas or armed groups.", "content": "Donald Trumps 20-point plan bars any future Gaza role for Hamas or armed groups.The first phase of the Gaza ceasefire agreement has come into effect.\r\nPart of US President Donald Trumps 20-point plan… [+583 chars]", "url": "https://www.aljazeera.com/video/inside-story/2025/10/10/what-is-next-for-the-palestinian-resistance-movements", "source": "Al Jazeera English", "published_at": "2025-10-10T19:11:15Z", "relevance_score": 0.2}, {"title": "WATCH: President Trump signs proclamation protecting Columbus Day name", "description": "President Trump signed a proclamation protecting the name Columbus Day before hosting a Cabinet meeting on Thursday.", "content": "<ul><li>Israel's security cabinet approves 1st phase of Israel-Hamas ceasefire agreement\r\n</li><li>Inside Gaza as the 1st step toward a ceasefire unfolds\r\n</li><li>Trump says there will be 'everlasti… [+4642 chars]", "url": "https://abcnews.go.com/US/video/president-trump-signs-proclamation-protecting-columbus-day-126379332", "source": "ABC News", "published_at": "2025-10-09T20:22:15Z", "relevance_score": 0.195}, {"title": "Trump predicts Gaza ceasefire talks will go ‘very quickly’", "description": "US President Donald Trump said he believes negotiations involving Israel and Hamas will go “very quickly”.", "content": "NewsFeed\r\nUS President Donald Trump said he believes negotiations involving Israel and Hamas will go very quickly as mediators arrive in Egypt to discuss the details of his 20-point plan to end the G… [+7 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/6/trump-predicts-gaza-ceasefire-talks-will-go-very", "source": "Al Jazeera English", "published_at": "2025-10-06T06:56:36Z", "relevance_score": 0.195}, {"title": "Trump: Netanyahu ‘more popular today than five days ago’", "description": "US President Donald Trump said Israel’s Benjamin Netanyahu “should be very popular right now”.", "content": "NewsFeed\r\nHes much more popular today than we he was five days ago. US President Donald Trump said Israels Benjamin Netanyahu should be very popular right now because of the US-backed ceasefire, but … [+44 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/trump-netanyahu-more-popular-today-than-five-days", "source": "Al Jazeera English", "published_at": "2025-10-09T17:55:15Z", "relevance_score": 0.195}, {"title": "When the bombs in Gaza stop, the true pain starts", "description": "When the guns fall quiet, Gaza is left with the ache of survival and the wounds that peace can’t heal.", "content": "On Thursday morning, President Donald Trump announced that the United States, working with Egypt, Turkiye and Qatar, had finally reached a ceasefire deal for Gaza. For a moment, it seemed as if Gazas… [+6851 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/10/when-the-bombs-in-gaza-stop-the-true-pain-starts", "source": "Al Jazeera English", "published_at": "2025-10-10T13:20:50Z", "relevance_score": 0.195}, {"title": "Trump-appointed prosecutor seeks indictment of New York AG Letitia James: Sources", "description": "A Trump-appointed prosecutor has presented evidence to a grand jury seeking an indictment against New York Attorney General Letitia James, sources tell ABC News.", "content": "New York Attorney General Letitia James has been indicted on at least one count of alleged fraud, becoming the second political figure in a span of just three weeks to face prosecution after Presiden… [+1552 chars]", "url": "https://abcnews.go.com/US/trump-appointed-prosecutor-seeks-indictment-new-york-ag/story?id=126378516", "source": "ABC News", "published_at": "2025-10-09T20:24:19Z", "relevance_score": 0.19}, {"title": "Melania Trump says she and Putin communicating about children affected by war", "description": "First lady Melania Trump announced that she and Russian President Vladimir Putin have had an \"open channel of communication\" regarding children impacted by the war.", "content": "First lady Melania Trump announced Friday that she and Russian President Vladimir Putin have had an \"open channel of communication\" regarding children impacted by the Russian-Ukraine war.\r\n\"We have a… [+259 chars]", "url": "https://abcnews.go.com/Politics/melania-trump-putin-communicating-children-affected-war/story?id=126397912", "source": "ABC News", "published_at": "2025-10-10T15:15:23Z", "relevance_score": 0.19}, {"title": "Machado’s Nobel is “terrific news” for democracy in Venezuela", "description": "Juan Pappier of Human Rights Watch says Maria Corina Machado’s Nobel Prize is boost for Venezuela’s fight for democracy.", "content": "Toggle Play\r\nMachado's Nobel is \"terrific news\" for democracy in Venezuela", "url": "https://www.aljazeera.com/video/quotable/2025/10/10/machados-nobel-is-terrific-news-for-democracy-in-venezuela", "source": "Al Jazeera English", "published_at": "2025-10-10T14:14:49Z", "relevance_score": 0.185}, {"title": "WATCH: Melania Trump greets sailors with 'hooyah' at Navy 250 event", "description": "First lady Melania Trump greeted sailors with a \"hooyah\" as she spoke at an event celebrating the U.S. Navy's 250th anniversary in Norfolk, Virginia.", "content": "<ul><li>Democrats and Republicans at a deadlock as shutdown continues\r\n</li><li>Tensions rise amid anti-ICE protests in Chicago\r\n</li><li>Just come to the table and do something to help Americans: Bo… [+4480 chars]", "url": "https://abcnews.go.com/US/video/melania-trump-greets-sailors-hooyah-navy-250-event-126237289", "source": "ABC News", "published_at": "2025-10-05T21:15:20Z", "relevance_score": 0.185}, {"title": "WATCH: Illinois governor responds to Trump's call to jail Democratic leaders", "description": "Illinois Gov. JB Pritzker responded after President Donald Trump called for his jailing in a social media post claiming Pritzker and Chicago Mayor Brandon Johnson have failed to protect ICE officers.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Rabbi reflects on Oct. 7 annive… [+4426 chars]", "url": "https://abcnews.go.com/US/video/illinois-governor-responds-trumps-call-jail-democratic-leaders-126343677", "source": "ABC News", "published_at": "2025-10-08T20:21:02Z", "relevance_score": 0.18}, {"title": "Trump draws international praise as broker of Israel-Hamas deal", "description": "Israeli President Isaac Herzog thanked Trump \"for his incredible leadership.\"", "content": "LONDON -- World leaders on Thursday issued a wave of statements commending Israel and Hamas for agreeing to the first phase of a ceasefire deal, with many also praising U.S. President Donald Trump fo… [+5096 chars]", "url": "https://abcnews.go.com/International/trump-draws-international-praise-broker-israel-hamas-deal/story?id=126356500", "source": "ABC News", "published_at": "2025-10-09T12:59:40Z", "relevance_score": 0.16999999999999998}, {"title": "WATCH: Speaker Johnson has emotional exchange with a military mom about shutdown", "description": "A military mom confronted House Speaker Johnson on C-SPAN over the lack of a standalone bill to pay troops if the government shutdown extends beyond Oct. 15.", "content": "<ul><li>Israel's security cabinet approves 1st phase of Israel-Hamas ceasefire agreement\r\n</li><li>Inside Gaza as the 1st step toward a ceasefire unfolds\r\n</li><li>Trump says there will be 'everlasti… [+4642 chars]", "url": "https://abcnews.go.com/US/video/speaker-johnson-emotional-exchange-military-mom-shutdown-126379234", "source": "ABC News", "published_at": "2025-10-09T20:22:20Z", "relevance_score": 0.165}, {"title": "WATCH: The story behind the viral surprise father-daughter wedding dance video", "description": "Marissa Nielsen surprised her dad Greg Wickles by inviting her three older sisters to join in on a father-daughter dance at her wedding.", "content": "<ul><li>Israel's security cabinet approves 1st phase of Israel-Hamas ceasefire agreement\r\n</li><li>Inside Gaza as the 1st step toward a ceasefire unfolds\r\n</li><li>Trump says there will be 'everlasti… [+4642 chars]", "url": "https://abcnews.go.com/GMA/Family/video/story-viral-surprise-father-daughter-wedding-dance-video-126377848", "source": "ABC News", "published_at": "2025-10-09T19:33:49Z", "relevance_score": 0.165}, {"title": "Day one of Gaza peace talks ends on ‘positive’ note in Egypt", "description": "Sources familiar with the talks with Israel and Hamas say that progress was made on Monday, negotiations to continue.", "content": "The first day of resumed indirect talks between Israel and Hamas in Egypt ended on a positive note, amid hopes of a potential deal to implement US President Donald Trumps 20-point plan to end the war… [+3483 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/day-one-of-gaza-peace-talks-ends-on-positive-note-in-egypt", "source": "Al Jazeera English", "published_at": "2025-10-07T01:51:19Z", "relevance_score": 0.165}, {"title": "Potential hurdles litter road as Israel and Hamas head to Gaza peace talks", "description": "Indirect negotiations between Israel and Hamas over Trump's 20-point plan are set to begin in Sharm el-Sheikh.", "content": "Delegations from Hamas, Israel and the United States are due to convene in Egypt for talks on US President Donald Trumps proposal to end the war in Gaza.\r\nIndirect negotiations between Israel and Ham… [+5341 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/potential-hurdles-litter-road-as-israel-and-hamas-head-to-gaza-peace-talks", "source": "Al Jazeera English", "published_at": "2025-10-06T12:44:15Z", "relevance_score": 0.165}, {"title": "'They're survivors': Brother of 2 Israeli hostages fights for their return", "description": "Liran Berman, whose twin brothers Gali and Ziv Berman are hostages who may still be alive, spoke to ABC News Live on Tuesday.", "content": "It's been two years since twins Gali and Ziv Berman were taken hostage by Hamas during the Oct. 7, 2023, terrorist attack on Israel. Their brother, Liran Berman, has been fighting every day to get th… [+1938 chars]", "url": "https://abcnews.go.com/International/brother-2-israeli-hostages-fights-return-theyre-survivors/story?id=126305281", "source": "ABC News", "published_at": "2025-10-07T20:53:38Z", "relevance_score": 0.16}, {"title": "Israel-Hamas war: Glimpses of possible peace after 2 years of systematic, brutal war", "description": "The sinews of the conflict have stretched wider in the last year.", "content": "LONDON -- As Israel's military prepared last month to launch its ground offensive into Gaza City, the Israel Defense Forces published a warning about al-Kawthar Tower, a residential high-rise in the … [+10585 chars]", "url": "https://abcnews.go.com/International/after-2-years-israel-hamas-war-systematic-brutal/story?id=126244465", "source": "ABC News", "published_at": "2025-10-07T09:17:04Z", "relevance_score": 0.155}, {"title": "'This is the closest we’ve come to getting' hostages released: Rubio", "description": "Secretary of State Rubio optimistic that deal between Hamas and Israel within reach, saying Sunday it's “the closest we’ve come to getting all of the hostages released.”", "content": "Secretary of State Marco Rubio expressed optimism Sunday that a deal between Hamas and Israel to end the war in Gaza could finally be reached, saying it is the closest weve come to getting all of the… [+1577 chars]", "url": "https://abcnews.go.com/Politics/closest-weve-hostages-gaza-released-rubio/story?id=126227202", "source": "ABC News", "published_at": "2025-10-05T13:06:35Z", "relevance_score": 0.155}, {"title": "Celebrate the ceasefire, but don’t forget: Gaza survived on its own", "description": "Western leaders now claim credit for 'peace', but Gaza’s survival belongs to its people alone.", "content": "On November 7, 2023, children stood before cameras at al-Shifa Hospital and spoke in English, not their mother tongue, but in the language of those they thought might save them. We want to live, we w… [+7437 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/9/celebrate-the-ceasefire-but-dont-forget-gaza-survived-on-its-own", "source": "Al Jazeera English", "published_at": "2025-10-09T19:27:56Z", "relevance_score": 0.155}, {"title": "WATCH: London police dismantle international phone theft gang", "description": "Police in London have made dozens of arrests linked to a criminal gang who are alleged to have smuggled 40,000 stolen mobile phones from the U.K. to China.", "content": "<ul><li>Air traffic control shortages worsen as shutdown drags on\r\n</li><li>James Comey to be arraigned Wednesday\r\n</li><li>Former surgeon generals warn US about RFK Jr.\r\n</li><li>Tropical Storm Jerr… [+4442 chars]", "url": "https://abcnews.go.com/International/video/london-police-dismantle-international-phone-theft-gang-126320757", "source": "ABC News", "published_at": "2025-10-08T11:02:28Z", "relevance_score": 0.15}, {"title": "Starmer: UK urges swift action on Gaza ceasefire ‘without delay’", "description": "Speaking in Mumbai, UK Prime Minister Keir Starmer welcomed the first stage of US President Donald Trump’s Gaza peace pl", "content": "NewsFeed\r\nSpeaking from Mumbai, UK Prime Minister Keir Starmer welcomed the first stage of US President Donald Trumps Gaza peace plan, urging its immediate implementation and the lifting of all restr… [+27 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/starmer-uk-urges-swift-action-on-gaza-ceasefire-without", "source": "Al Jazeera English", "published_at": "2025-10-09T19:22:44Z", "relevance_score": 0.14}, {"title": "LIVE: Israel, Hamas agree on ‘first phase’ of Gaza ceasefire deal", "description": "Gaza ceasefire breakthrough announced on third day of talks in Egypt’s Sharm el-Sheikh.", "content": "blinking-dot\r\nLive updatesLive updates, \r\nGaza ceasefire breakthrough announced on third day of talks in Egypts Sharm el-Sheikh on US President Donald Trumps 20-point peace proposal.", "url": "https://www.aljazeera.com/news/liveblog/2025/10/9/live-israel-hamas-agree-on-first-phase-of-gaza-ceasefire-deal", "source": "Al Jazeera English", "published_at": "2025-10-09T00:00:00Z", "relevance_score": 0.135}, {"title": "Trump threatens 'massive' tariffs on China, triggering stock market sell-off", "description": "China imposed limits on rare earth minerals a day earlier.", "content": "President Donald Trump on Friday voiced frustration with what he called China's \"trade hostility,\" threatening to respond with large tariffs on China and to cancel his upcoming meeting with Chinese P… [+1435 chars]", "url": "https://abcnews.go.com/Politics/trump-threatens-massive-tariffs-china-triggering-stock-market/story?id=126405187", "source": "ABC News", "published_at": "2025-10-10T16:50:42Z", "relevance_score": 0.13}, {"title": "Israel-Gaza live updates: Egypt to host ceasefire talks with Hamas and Israel", "description": "Hamas responded positively to President Donald Trump's proposal for peace in Gaza, though said more negotiations will be needed before a full agreement can be signed.", "content": "Leaving the White House for the Navys 250th celebration on Sunday, President Donald Trump continued to celebrate his Gaza peace proposal while admitting that negotiations are still ongoing.\r\nThey're … [+1028 chars]", "url": "https://abcnews.go.com/International/live-updates/israel-gaza-live-updates-egypt-host-ceasefire-talks/?id=126242055", "source": "ABC News", "published_at": "2025-10-06T07:35:39Z", "relevance_score": 0.11000000000000001}, {"title": "WATCH: National Guard now on duty in Chicago area despite local opposition", "description": "In two courthouses on opposite sides of the country, President Donald Trump’s attempt to send troops into Democratic-led Chicago and Portland, Oregon, will face a critical legal test on Thursday.", "content": "<ul><li>Trump says there will be 'everlasting peace' in the Middle East\r\n</li><li>Major challenges lie ahead for Gaza, Israel if ceasefire deal rolls out\r\n</li><li>Trump's use of the National Guard f… [+4658 chars]", "url": "https://abcnews.go.com/US/video/national-guard-now-duty-chicago-area-despite-local-126371677", "source": "ABC News", "published_at": "2025-10-09T16:51:57Z", "relevance_score": 0.10500000000000001}, {"title": "Council seeks more time to name new prosecutor in Georgia election interference case", "description": "The council tasked with naming a prosecutor to replace Fani Willis in Georgia's election interference case against President Trump and others has asked for an extension.", "content": "A day after the trial judge overseeing Georgia's election interference case against President Donald Trump and others set a 14-day deadline for the appointment of a new prosecutor following the dismi… [+2824 chars]", "url": "https://abcnews.go.com/US/council-seeks-time-replace-fani-willis-prosecutor-georgia/story?id=126264300", "source": "ABC News", "published_at": "2025-10-06T21:48:12Z", "relevance_score": 0.10500000000000001}, {"title": "A 10-point plan for Israel", "description": "Here is what needs to happen to put Palestinians and Israelis on the path to peace.", "content": "On Friday, Hamas sent its response to the 20-point Gaza peace plan put forward by United States President Donald Trump. Importantly, the Palestinian group agreed to hand over the administration of Ga… [+5134 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/6/a-10-point-plan-for-israel", "source": "Al Jazeera English", "published_at": "2025-10-06T14:34:43Z", "relevance_score": 0.08}, {"title": "White House threatens mass layoffs amid deepening US government shutdown", "description": "US President Donald Trump blames Democrats for looming federal layoffs as shutdown enters fifth day.", "content": "The White House has warned that mass layoffs of federal workers could begin if US President Donald Trump concludes that negotiations with congressional Democrats to end a partial government shutdown … [+2795 chars]", "url": "https://www.aljazeera.com/economy/2025/10/5/white-house-threatens-mass-layoffs-amid-deepening-us-government-shutdown", "source": "Al Jazeera English", "published_at": "2025-10-05T19:49:43Z", "relevance_score": 0.08}, {"title": "Tennessee National Guard to mobilize in Memphis for anti-crime deployment", "description": "Tennessee National Guard units will mobilize in Memphis on Friday as the Trump admin turns to states' citizen-soldiers as an anti-crime measure across the U.S.", "content": "Tennessee National Guard units will mobilize in Memphis on Friday as President Donald Trump's administration turns to states' citizen-soldiers as an anti-crime measure in some of the nation's biggest… [+2016 chars]", "url": "https://abcnews.go.com/US/tennessee-national-guard-mobilize-memphis-anti-crime-deployment/story?id=126379599", "source": "ABC News", "published_at": "2025-10-10T00:04:53Z", "relevance_score": 0.075}, {"title": "Will Israel end its occupation of Palestinian territories?", "description": "Talks to implement Donald Trump&#039;s 20-point plan for Gaza are under way.", "content": "Talks to implement Donald Trumps 20-point plan for Gaza are under way.Hamas and Israel appear to have agreed to most of the conditions of US President Donald Trumps 20-point ceasefire plan, which mea… [+851 chars]", "url": "https://www.aljazeera.com/video/inside-story/2025/10/5/will-israel-end-its-occupation-of-palestinian-territories", "source": "Al Jazeera English", "published_at": "2025-10-05T18:01:48Z", "relevance_score": 0.075}, {"title": "Texas National Guard seen at training center in Chicago suburbs", "description": "Members of the Texas National Guard have been seen at an Army Reserve Training Center in the southwest suburbs of Chicago, ABC News has learned.", "content": "Members of the Texas National Guard have been seen at an Army Reserve Training Center in the southwest suburbs of Chicago, ABC News has learned.\r\nTexas Gov. Greg Abbott on Monday shared a photo on so… [+1364 chars]", "url": "https://abcnews.go.com/US/texas-national-guard-training-center-chicago-suburbs/story?id=126320753", "source": "ABC News", "published_at": "2025-10-08T11:15:48Z", "relevance_score": 0.07}, {"title": "DOJ adds 2 out-of-state attorneys to Comey case ahead of his arraignment", "description": "The DOJ has added two assistant U.S. attorneys from out of state to work on the case against former FBI Director James Comey ahead of Comey's arraignment on Wednesday.", "content": "Ahead of Wednesday's arraignment of former FBI Director James Comey in Virginia, the Department of Justice has added two assistant U.S. attorneys from out of state to work on the case.\r\nTwo prosecuto… [+1418 chars]", "url": "https://abcnews.go.com/US/doj-adds-2-state-attorneys-comey-case-ahead/story?id=126306467", "source": "ABC News", "published_at": "2025-10-07T22:17:58Z", "relevance_score": 0.07}, {"title": "WATCH: Beloved March Madness icon Sister Jean dies at 106", "description": "Sister Jean Dolores Schmidt, the team chaplain for the Loyola University Chicago basketball team who became a national celebrity during the school's 2018 underdog March Madness run, has died at 106.", "content": "<ul><li>Trump threatens 'massive' increase of tariffs on China\r\n</li><li>Multiple dead in 'devastating blast' at explosives manufacturer: Sheriff\r\n</li><li>Kilmar Abrego Garcia's attorneys return to … [+4560 chars]", "url": "https://abcnews.go.com/US/video/beloved-march-madness-icon-sister-jean-dies-106-126411786", "source": "ABC News", "published_at": "2025-10-10T17:56:52Z", "relevance_score": 0.065}, {"title": "WATCH: Authorities announce arrest in connection with Palisades fire", "description": "A 29-year-old man has been arrested in connection with the Palisades Fire, which killed a dozen people earlier this year and caused widespread destruction in Los Angeles County, the DOJ announced.", "content": "<ul><li>Man arrested, faces federal charge in connection with Palisades Fire: DOJ\r\n</li><li>James Comey pleads not guilty, trial date set for January\r\n</li><li>US delegation expected to join peace ta… [+4418 chars]", "url": "https://abcnews.go.com/US/video/authorities-announce-arrest-connection-palisades-firev-126335430", "source": "ABC News", "published_at": "2025-10-08T17:26:43Z", "relevance_score": 0.065}, {"title": "WATCH: Supreme Court denies Ghislaine Maxwell appeal", "description": "The Supreme Court has declined to take up the appeal of Maxwell, who was contesting her prosecution and conviction on grounds that the government had violated an agreement made with Jeffrey Epstein before his death.", "content": "<ul><li>Illinois files lawsuit to block deployment of National Guard\r\n</li><li>Trump administration pushes back on order to block National Guard deployment\r\n</li><li>South Carolina judge's house fire… [+4225 chars]", "url": "https://abcnews.go.com/US/video/supreme-court-denies-ghislaine-maxwell-appeal-126257745", "source": "ABC News", "published_at": "2025-10-06T16:04:10Z", "relevance_score": 0.065}, {"title": "Bondi faces grilling from Senate Democrats on DOJ 'weaponization,' Epstein files", "description": "The hearing follows a tumultuous summer for the Department of Justice.", "content": "President Donald Trump's tightening grip over the Justice Department to target his political opponents and lawmakers' increasing calls for the release of more files from federal investigations into d… [+7209 chars]", "url": "https://abcnews.go.com/Politics/democrats-highlight-doj-weaponization-epstein-files-bondis-senate/story?id=126260560", "source": "ABC News", "published_at": "2025-10-07T13:24:23Z", "relevance_score": 0.045}, {"title": "WATCH: Crypto scam almost costs woman her life savings", "description": "The FBI says scams perpetrated using bitcoin ATMs cost Americans nearly $250 million in 2024, more than double the sum from the previous year.", "content": "<ul><li>Major challenges lie ahead for Gaza, Israel if ceasefire deal rolls out\r\n</li><li>Trump's use of the National Guard faces critical legal tests\r\n</li><li>'My kids could die': Mom begs Johnson … [+4641 chars]", "url": "https://abcnews.go.com/US/video/crypto-scam-costs-woman-life-savings-126369926", "source": "ABC News", "published_at": "2025-10-09T15:58:02Z", "relevance_score": 0.04}, {"title": "BBC Inside Science", "description": "Renewables overtake coal as the world’s biggest source of electricity.", "content": "Available for over a year\r\nThis week, renewables overtake coal as the worlds biggest source of electricity. China is leading the renewable charge despite its global reputation as a coal burning pollu… [+1315 chars]", "url": "https://www.bbc.co.uk/sounds/play/m002kgs9", "source": "BBC News", "published_at": "2025-10-09T16:00:00Z", "relevance_score": 0.035}, {"title": "Major challenges remain for Gaza and Israel if ceasefire deal rolls out", "description": "There are many questions surrounding the Israel-Hamas ceasefire deal and what it means for the region.", "content": "As U.S. officials and leaders in the Middle East are celebrating the proposed Gaza ceasefire deal between the Israeli government and Hamas but there are still many questions over the timeline and cha… [+2540 chars]", "url": "https://abcnews.go.com/Politics/major-challenges-remain-gaza-israel-ceasefire-deal-rolls/story?id=126360503", "source": "ABC News", "published_at": "2025-10-09T19:01:30Z", "relevance_score": 0.035}, {"title": "Consumer sentiment sours as government shutdown threatens economic damage", "description": "The fresh data marked three consecutive months of worsening shopper attitudes.", "content": "Consumer sentiment soured in October as a government shutdown threatens to weaken a wobbly economy beset by an uptick in inflation and a sharp slowdown of hiring, fresh data on Friday showed. The rea… [+334 chars]", "url": "https://abcnews.go.com/Business/consumer-sentiment-sours-government-shutdown-threatens-economic-damage/story?id=126398088", "source": "ABC News", "published_at": "2025-10-10T14:07:45Z", "relevance_score": 0.035}, {"title": "Former FBI Director James Comey to make 1st court appearance", "description": "Former FBI Director James Comey will appear in court on Wednesday for the first time since he was indicted last month on charges of lying to Congress.", "content": "Former FBI Director James Comey will appear in court on Wednesday for the first time since he was indicted last month on charges of lying to Congress.\r\nComey's arraignment is scheduled for 10 a.m. ET… [+1739 chars]", "url": "https://abcnews.go.com/Politics/former-fbi-director-james-comey-make-1st-court/story?id=126322951", "source": "ABC News", "published_at": "2025-10-08T13:40:52Z", "relevance_score": 0.035}, {"title": "Texas National Guard headed to Illinois, as Pritzker decries 'authoritarian march'", "description": "Gov. JB Pritzker accused the president of using troops for political gain.", "content": "As members of the Texas National Guard boarded a plane on Monday, state and city leaders in Illinois were holding a news conference asking them to stay away from Chicago.\r\nIt was not immediately clea… [+2542 chars]", "url": "https://abcnews.go.com/US/texas-national-guard-headed-illinois-gov-pritzker-calls/story?id=126283676", "source": "ABC News", "published_at": "2025-10-07T15:14:25Z", "relevance_score": 0.035}, {"title": "Italy to propose global ceasefire for 2026 Winter Olympics", "description": "A global truce for the duration of February's 2026 Milano Cortina Winter Olympics will be sought by hosts Italy.", "content": "Italy will submit a proposal for a worldwide ceasefire to the United Nations before next years Milano Cortina Winter Olympics, Minister of Foreign Affairs Antonio Tajani said.\r\nAs a concept, a global… [+1777 chars]", "url": "https://www.aljazeera.com/sports/2025/10/7/italy-to-propose-global-ceasefire-for-2026-winter-olympics", "source": "Al Jazeera English", "published_at": "2025-10-07T14:35:06Z", "relevance_score": 0.035}, {"title": "WATCH: Near-supermoon lights up American skies", "description": "Time-lapse imagery captured the nearly full moon, a forerunner to the harvest supermoon, rising and setting over U.S. cities.", "content": "<ul><li>Government shutdown's impact on air traffic controllers\r\n</li><li>Parties no closer to deal to end government shutdown\r\n</li><li>Standoff over National Guard intensifies\r\n</li><li>Medical hel… [+4389 chars]", "url": "https://abcnews.go.com/US/video/supermoon-lights-american-skies-126288444", "source": "ABC News", "published_at": "2025-10-07T13:17:22Z", "relevance_score": 0.03}, {"title": "WATCH: Monarch butterfly gets wing transplant, continues migration", "description": "An injured monarch butterfly was able to continue its migration after undergoing a wing transplant at a nature preserve in New York.", "content": "<ul><li>Trump announces hostage, prisoner exchange between Israel and Hamas\r\n</li><li>How much of a role did Trump play in the latest Israel-Hamas peace deal?\r\n</li><li>National Guard troops set to d… [+4684 chars]", "url": "https://abcnews.go.com/US/video/monarch-butterfly-gets-wing-transplant-continues-migration-126352326", "source": "ABC News", "published_at": "2025-10-09T05:57:02Z", "relevance_score": 0.015000000000000003}, {"title": "WATCH: Hundreds of hikers trapped by blizzard on Mount Everest", "description": "An effort is underway to rescue hundreds of hikers who became trapped on Mount Everest due to an unexpected blizzard.", "content": "<ul><li>Illinois files lawsuit to block deployment of National Guard\r\n</li><li>Trump administration pushes back on order to block National Guard deployment\r\n</li><li>South Carolina judge's house fire… [+4225 chars]", "url": "https://abcnews.go.com/International/video/hundreds-hikers-trapped-blizzard-mount-everest-126258058", "source": "ABC News", "published_at": "2025-10-06T15:53:48Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Ex-FBI Director James Comey pleads not guilty", "description": "Former FBI Director James Comey pleaded not guilty on Wednesday. He is charged with one count of false statements and one count of obstruction of a congressional proceeding.", "content": "<ul><li>James Comey pleads not guilty, trial date set for January\r\n</li><li>US delegation expected to join peace talks between Israel and Hamas\r\n</li><li>Inside Nasser Hospital's malnutrition ward am… [+4405 chars]", "url": "https://abcnews.go.com/US/video/fbi-director-james-comey-pleads-guilty-126330331", "source": "ABC News", "published_at": "2025-10-08T15:28:28Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Former NFL QB Mark Sanchez facing felony charge after physical altercation", "description": "Former NFL QB Mark Sanchez, who was arrested following a physical altercation this weekend, is now facing a felony charge of battery involving serious bodily injury, prosecutors in Indianapolis said.", "content": "<ul><li>Government shutdown's impact on air traffic controllers\r\n</li><li>Parties no closer to deal to end government shutdown\r\n</li><li>Standoff over National Guard intensifies\r\n</li><li>Medical hel… [+4389 chars]", "url": "https://abcnews.go.com/US/video/former-nfl-qb-mark-sanchez-facing-felony-charge-126288356", "source": "ABC News", "published_at": "2025-10-07T13:12:06Z", "relevance_score": 0.0}, {"title": "WATCH: Air traffic controller shortages amid shutdown lead to canceled flights, delays", "description": "Flight delays and cancellations are climbing as sick calls involving air traffic controllers leave a number of airport towers and control facilities without enough staff to handle all flights.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Man arrested, faces federal cha… [+4400 chars]", "url": "https://abcnews.go.com/US/video/air-traffic-controller-shortages-amid-shutdown-lead-canceled-126339446", "source": "ABC News", "published_at": "2025-10-08T19:08:39Z", "relevance_score": 0.0}, {"title": "WATCH: Bystanders help lift helicopter after crash in Sacramento", "description": "New video shows drivers racing to lift a medical helicopter that crashed Monday night on a busy Sacramento highway.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Rabbi reflects on Oct. 7 annive… [+4426 chars]", "url": "https://abcnews.go.com/US/video/bystanders-lift-helicopter-after-crash-sacramento-126343225", "source": "ABC News", "published_at": "2025-10-08T20:13:57Z", "relevance_score": 0.0}]}