{"timestamp": 1760020528.1718452, "data": [{"title": "Banking alliance that Carney launched to fight climate change folds after mass exodus", "description": "A global banking group that Prime Minister Mark Carney helped launch in 2021 to fight climate change has voted to shut down.", "content": "A global banking group that Prime Minister Mark Carney helped launch in 2021 to fight climate change has voted to shut down.\r\nA spokesperson for the UN-backed Net-Zero Banking Alliance says members v… [+2278 chars]", "url": "https://www.cbc.ca/news/science/carney-banking-climate-1.7651041", "source": "CBC News", "published_at": "2025-10-03T22:04:45Z", "relevance_score": 0.8999999999999999}, {"title": "Sunrise Movement, Founded to Fight Climate Change, Pivots to Fighting Trump", "description": "As Trump targets his critics on the left, Sunrise says it needs to battle authoritarianism to protect the climate.\nThe post Sunrise Movement, Founded to Fight Climate Change, Pivots to Fighting Trump appeared first on The Intercept.", "content": "The youth-led climate activist group Sunrise Movement is expanding its mission to battle authoritarianism as the Trump administration targets left-leaning organizations and puts one of the groups maj… [+5406 chars]", "url": "https://theintercept.com/2025/10/02/sunrise-movement-climate-change-trump-protest/", "source": "The Intercept", "published_at": "2025-10-02T14:00:00Z", "relevance_score": 0.845}, {"title": "This Data Scientist Sees Progress in the Climate Change Fight", "description": "Countries are falling short on reducing emissions, but British data scientist Hannah Ritchie looks at the numbers and sees the world making real gains on climate change. In an interview, she talks about the unheralded progress she sees in the global shift to …", "content": "It has been 10 years since countries signed on to the Paris Agreement, and emissions and temperatures continue to reach new highs, fueling unprecedented weather disasters around the globe. Meanwhile,… [+10496 chars]", "url": "https://e360.yale.edu/features/hannah-ritchie-interview", "source": "Yale.edu", "published_at": "2025-10-06T07:13:00Z", "relevance_score": 0.84}, {"title": "Inhalers for asthma, COPD are climate change contributors, study finds", "description": "\"These emissions drive global warming, exacerbating the very respiratory conditions inhalers are meant to relieve,\" researchers wrote.", "content": "Inhalers that provide fast-acting treatment for people with certain respiratory conditions are contributing to greenhouse gas emissions, which can worsen both climate change and the conditions themse… [+2242 chars]", "url": "https://www.cbsnews.com/news/inhalers-produce-carbon-emissions-study/", "source": "CBS News", "published_at": "2025-10-07T20:58:55Z", "relevance_score": 0.6599999999999999}, {"title": "The Panama Canal needs a staggering amount of water to operate. Climate change could threaten that, study warns", "description": "The vital commercial artery depends on a supply of fresh water to move ships between the two oceans. Drought conditions that were once rare could become common by the end of the century, greatly impacting the canal’s operation.", "content": "The Panama Canal — a critical route for global maritime trade — may be at risk from reduced rainfall and increased evaporation due to climate change if greenhouse gas emissions aren't reduced, accord… [+5916 chars]", "url": "https://www.livescience.com/planet-earth/climate-change/the-panama-canal-needs-a-staggering-amount-of-water-to-operate-climate-change-could-threaten-that-study-warns", "source": "Live Science", "published_at": "2025-10-02T09:34:57Z", "relevance_score": 0.6599999999999999}, {"title": "How Climate Change Is Driving Home Insurance Turmoil", "description": "Climate-fueled storms and wildfires are increasing costs and pushing insurers to the limit. What happens if the market breaks?", "content": "This is Naked Capitalism fundraising week. 554 donors have already invested in our efforts to combat corruption and predatory conduct, particularly in the financial realm. Please join us and particip… [+16986 chars]", "url": "https://www.nakedcapitalism.com/2025/10/how-climate-change-is-driving-home-insurance-turmoil.html", "source": "Nakedcapitalism.com", "published_at": "2025-10-02T05:07:36Z", "relevance_score": 0.63}, {"title": "Grundfos: Water is the Messenger of Climate Change", "description": "As climate extremes intensify, water reveals the urgency of unified global action.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/grundfos-water-is-the-messenger-of-climate-change/", "source": "CBS News", "published_at": "2025-10-02T04:00:00Z", "relevance_score": 0.63}, {"title": "Wildfire-smoke-related deaths in the US could climb to 70,000 per year by 2050 due to climate change, study finds", "description": "The number of deaths from exposure to wildfire smoke in the U.S. could rise by more than 70% in the next 25 years. The human and economic costs involved would be astronomical, researchers say.", "content": "Deaths resulting from exposure to wildfire smoke could cost the U.S. economy more by 2050 than all other climate-related harms combined, a new study suggests.\r\nWildfire smoke pollution is estimated t… [+5584 chars]", "url": "https://www.livescience.com/health/viruses-infections-disease/wildfire-smoke-related-deaths-in-the-us-could-climb-to-70-000-per-year-by-2050-due-to-climate-change-study-finds", "source": "Live Science", "published_at": "2025-10-02T17:26:08Z", "relevance_score": 0.605}, {"title": "Why climate change adaptation is a key piece of our climate risk puzzle", "description": "Many Australians will have been reading up recently on whether they are likely to be among the 1.5 million reported to be at risk of sea level rise or the 190% increase in heat-related deaths in Sydney.", "content": "Many Australians will have been reading up recently on whether they are likely to be among the 1.5 million reported to be at risk of sea level rise or the 190% increase in heat-related deaths in Sydn… [+7183 chars]", "url": "https://phys.org/news/2025-10-climate-key-piece-puzzle.html", "source": "Phys.Org", "published_at": "2025-10-03T11:10:08Z", "relevance_score": 0.6}, {"title": "Intense rain, landslides and potholes everywhere: How climate change is trashing Australia's roads", "description": "Australia has one of the world's longest road networks, covering almost 900,000 kilometers. More than 80% of it is rural or remote.", "content": "Australia has one of the world's longest road networks, covering almost 900,000 kilometers. More than 80% of it is rural or remote.\r\nIt was hard and expensive enough to maintain this network before c… [+6650 chars]", "url": "https://phys.org/news/2025-10-intense-landslides-potholes-climate-trashing.html", "source": "Phys.Org", "published_at": "2025-10-06T15:35:05Z", "relevance_score": 0.6}, {"title": "Bill Gates: Our best weapon against climate change is ingenuity", "description": "It’s a foregone conclusion that the world will not meet the goals for limiting emissions and global warming laid out in the 2015 Paris Agreement. Many people want to blame politicians and corporations for this failure, but there’s an even more fundamental rea…", "content": "But I dont think this is a reason to be pessimistic. I see it as cause for optimism, because humans are very good at inventing things. In fact, weve already created many tools that are reducing emiss… [+3207 chars]", "url": "https://www.technologyreview.com/2025/10/06/1124265/bill-gates-ingenuity-climate-change-tech-investment/", "source": "MIT Technology Review", "published_at": "2025-10-06T10:45:00Z", "relevance_score": 0.6}, {"title": "The kids who sued America over climate change aren’t done yet", "description": "They want an international human rights body to hold the U.S. accountable — and are spotlighting Indigenous communities on the frontlines.", "content": "In 2015, nearly two dozen American youth sued the federal government, alleging that the United States violated their constitutional rights by facilitating the burning of fossil fuels and allowing gre… [+5856 chars]", "url": "https://grist.org/global-indigenous-affairs-desk/the-kids-who-sued-america-over-climate-change-arent-done-yet/", "source": "Grist", "published_at": "2025-10-03T08:15:00Z", "relevance_score": 0.6}, {"title": "2025 Climate Tech Companies to Watch: Pairwise and its climate-adapted crops", "description": "Climate change will make it increasingly difficult to grow crops across many parts of the world. Pairwise is leveraging CRISPR gene editing to develop plants that can better withstand adverse conditions. Pairwise uses cutting-edge gene editing to produce crop…", "content": "Among its early efforts, the company is developing and field testing shorter, sturdier types of corn, blackberries and other crops that could survive high winds and other extreme weather events ampli… [+2527 chars]", "url": "https://www.technologyreview.com/2025/10/06/1124278/2025-climate-tech-companies-to-watch-pairwise-gene-edited-crops/", "source": "MIT Technology Review", "published_at": "2025-10-06T10:45:00Z", "relevance_score": 0.36}, {"title": "Smart wearable concept lets runners, commuters navigate the heat", "description": "Smart wearable concept lets runners, commuters navigate the heatWATI is an innovative wearable concept designed to help people safely navigate rising temperatures in urban environments. As cities become hotter due to climate change...", "content": "WATI is an innovative wearable concept designed to help people safely navigate rising temperatures in urban environments. As cities become hotter due to climate change and the Urban Heat Island effec… [+2408 chars]", "url": "https://www.yankodesign.com/2025/10/04/smart-wearable-concept-lets-runners-commuters-navigate-the-heat/", "source": "Yanko Design", "published_at": "2025-10-04T22:30:29Z", "relevance_score": 0.3}, {"title": "New Zealand's seas warming faster than global average: Report", "description": "The seas around New Zealand are warming much faster than global averages, scientists said Wednesday in a new study warning how climate change could batter the island nation.", "content": "The seas around New Zealand are warming much faster than global averages, scientists said Wednesday in a new study warning how climate change could batter the island nation.\r\nThe government study fou… [+2539 chars]", "url": "https://phys.org/news/2025-10-zealand-seas-faster-global-average.html", "source": "Phys.Org", "published_at": "2025-10-08T09:40:01Z", "relevance_score": 0.3}, {"title": "Study shows the world is far more ablaze now with damaging fires than in the 1980s", "description": "Earth's nastiest and costliest wildfires are blazing four times more often now than they did in the 1980s because of human-caused climate change and people moving closer to wildlands, a new study found.", "content": "Earth's nastiest and costliest wildfires are blazing four times more often now than they did in the 1980s because of human-caused climate change and people moving closer to wildlands, a new study fou… [+5815 chars]", "url": "https://phys.org/news/2025-10-world-ablaze-1980s.html", "source": "Phys.Org", "published_at": "2025-10-02T19:16:13Z", "relevance_score": 0.3}, {"title": "How marine heat waves reshape ocean food webs and slow deep sea carbon transport", "description": "New research shows that marine heat waves can reshape ocean food webs, which in turn can slow the transport of carbon to the deep sea and hamper the ocean's ability to buffer against climate change.", "content": "New research shows that marine heat waves can reshape ocean food webs, which in turn can slow the transport of carbon to the deep sea and hamper the ocean's ability to buffer against climate change.\r… [+7003 chars]", "url": "https://phys.org/news/2025-10-marine-reshape-ocean-food-webs.html", "source": "Phys.Org", "published_at": "2025-10-06T09:00:05Z", "relevance_score": 0.3}, {"title": "10% of Earth’s Land Is at Risk of Wildfire Disaster, Study Finds", "description": "A new study found that climate change has driven a surge of “societally disastrous” wildfires over the last four decades, with 43% of the most costly events occurring in the last 10 years.", "content": "In January, firefighters spent nearly a month battling more than a dozen wildfires across Los Angeles. Despite their best efforts, the two largestthe Eaton and Palisades firesnow rank as the second- … [+3663 chars]", "url": "https://gizmodo.com/10-of-earths-land-is-at-risk-of-wildfire-disaster-study-finds-2000667312", "source": "Gizmodo.com", "published_at": "2025-10-03T17:38:58Z", "relevance_score": 0.24}, {"title": "Death of a rainmaker: When drought means murder in South Sudan", "description": "For a group of people whose job means life, climate change can spell death.", "content": "Torit, South Sudan Solomon Oture was on the run.\r\nAs a rainmaker, his job was to summon rain the lifeblood of his small farming community through prayer and ritual.\r\nlist of 3 itemsend of list\r\nBut a… [+19086 chars]", "url": "https://www.aljazeera.com/features/2025/10/3/death-of-a-rainmaker-when-drought-means-murder-in-south-sudan", "source": "Al Jazeera English", "published_at": "2025-10-03T06:52:57Z", "relevance_score": 0.24}, {"title": "Green Capitalism in the Americas: False Solutions, Real Threats", "description": "How policies toward climate change containment amount to green capitalism, as in eco-colonialism and environmental degradation", "content": "This is Naked Capitalism fundraising week. 857 donors have already invested in our efforts to combat corruption and predatory conduct, particularly in the financial realm. Please join us and particip… [+15457 chars]", "url": "https://www.nakedcapitalism.com/2025/10/green-capitalism-in-the-americas-false-solutions-real-threats.html", "source": "Nakedcapitalism.com", "published_at": "2025-10-04T08:31:31Z", "relevance_score": 0.24}, {"title": "What insurance data reveals about how bad wildfires are getting", "description": "Scientists tapped into 44 years of data to show how these societally destructive wildfires — ones that kill people and cause huge financial losses — are growing all across the world and are becoming much more common because of climate change.", "content": "Jasper, Lytton, Los Angeles, Fort McMurray the last few years have been filled with unprecedented fire disasters, taking lives and destroying communities and economies.\r\nNow, scientists have the data… [+4754 chars]", "url": "https://www.cbc.ca/news/science/insurance-data-wildfires-climate-change-1.7649790", "source": "CBC News", "published_at": "2025-10-02T23:00:42Z", "relevance_score": 0.24}, {"title": "Harry's trying to save Tasmania's 'alien' plants using people's backyards", "description": "The backyards of ordinary Tasmanians are becoming urban climate refuges for a \"biobank\" of alpine plants threatened by climate change and bushfire.", "content": "Scattered across Tasmania's mountainous regions are ancient plants described by enthusiasts as \"alien\" and \"spectacular\".\r\nSome of them transform entire hillsides into a crisp orange hue, others look… [+6315 chars]", "url": "https://www.abc.net.au/news/2025-10-04/backyard-biobanking-tasmania-alpine-plants-bushfire-threat/105730036", "source": "ABC News (AU)", "published_at": "2025-10-03T22:28:17Z", "relevance_score": 0.24}, {"title": "How we picked promising climate tech companies in an especially unsettling year", "description": "MIT Technology Review’s reporters and editors faced a dilemma as we began to mull nominees for this year’s list of Climate Tech Companies to Watch. How do you pick companies poised to succeed in a moment of such deep uncertainty, at a time when the new Trump …", "content": "We as a publication are focused more on identifying companies developing technologies that can address the escalating threats of climate change, than on businesses positioned purely for market succes… [+1180 chars]", "url": "https://www.technologyreview.com/2025/10/06/1124275/2025-climate-tech-companies-to-watch-methodology/", "source": "MIT Technology Review", "published_at": "2025-10-06T10:45:00Z", "relevance_score": 0.21}, {"title": "Accelerating climate modeling at a lower cost", "description": "Scientists are increasingly turning to AI to model future changes in the climate. However, existing approaches often face a trade-off between accuracy, speed, and computational cost.", "content": "Scientists are increasingly turning to AI to model future changes in the climate. However, existing approaches often face a trade-off between accuracy, speed, and computational cost.\r\nResearchers at … [+1670 chars]", "url": "https://phys.org/news/2025-10-climate.html", "source": "Phys.Org", "published_at": "2025-10-06T17:20:01Z", "relevance_score": 0.19}, {"title": "Tories pledge to scrap landmark climate legislation", "description": "Conservative leader Kemi Badenoch says her party would axe legally binding targets to cut emissions.", "content": "Becky MortonPolitical reporter\r\nThe Conservatives have pledged to scrap the UK's landmark climate change legislation and replace it with a strategy for \"cheap and reliable\" energy.\r\nThe Climate Chang… [+3362 chars]", "url": "https://www.bbc.com/news/articles/czrp2k3m3deo", "source": "BBC News", "published_at": "2025-10-02T05:19:31Z", "relevance_score": 0.18}, {"title": "Hotel prices lead countries to consider skipping COP30 climate summit", "description": "BRUSSELS (Reuters) -Dozens of countries have yet to secure accommodation at next month's COP30 climate summit in Brazil and some delegates are considering...", "content": "(Adds dropped name of minister in paragraph 5)\r\nBy Kate Abnett\r\nBRUSSELS (Reuters) -Dozens of countries have yet to secure accommodation at next month's COP30 climate summit in Brazil and some delega… [+3372 chars]", "url": "https://ca.news.yahoo.com/hotel-prices-lead-countries-consider-062154001.html", "source": "Yahoo Entertainment", "published_at": "2025-10-06T06:21:54Z", "relevance_score": 0.155}, {"title": "The Download: introducing the 10 climate tech companies to watch for 2025", "description": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. Introducing: 10 climate tech companies to watch Every year, the MIT Technology Review newsroom produces a list of some of…", "content": "Every year, the MIT Technology Review newsroom produces a list of some of the most promising climate tech firms on the planet. Its an exercise that we hope brings positive attention to companies work… [+1636 chars]", "url": "https://www.technologyreview.com/2025/10/06/1124939/the-download-introducing-the-10-climate-tech-companies-to-watch-for-2025/", "source": "MIT Technology Review", "published_at": "2025-10-06T12:10:00Z", "relevance_score": 0.155}, {"title": "Microsoft Windows 11 Pro Deal Is 94% Off, You Could Pay With a $10 Bill and Still Get Change", "description": "Save 94% on a license to upgrade to Windows 11 Pro over at StackSocial for a limited time.\nThe post Microsoft Windows 11 Pro Deal Is 94% Off, You Could Pay With a $10 Bill and Still Get Change appeared first on Kotaku.", "content": "Xbox Game Pass Ultimate just shot up another 50%, jumping from $20 to $30 per month. Folks are canceling subscriptions left and right with reports of the web page to change you Microsoft subscription… [+2363 chars]", "url": "https://kotaku.com/microsoft-windows-11-pro-deal-is-94-off-you-could-pay-with-a-10-bill-and-still-get-change-2000630686", "source": "Kotaku", "published_at": "2025-10-02T16:10:56Z", "relevance_score": 0.155}, {"title": "Hotel Prices Lead Countries To Consider Skipping COP30 Climate Summit", "description": "Dozens of countries have yet to secure accommodation at next month's COP30 climate summit in Brazil and some delegates are considering staying away as a shortage of hotels has driven prices to hundreds of dollars per night. Reuters: Small island states on the…", "content": "Small island states on the frontline of rising sea levels are confronted with having to consider reducing the size of delegations they send to Belem, while two European nations said they were conside… [+442 chars]", "url": "https://news.slashdot.org/story/25/10/03/166218/hotel-prices-lead-countries-to-consider-skipping-cop30-climate-summit", "source": "Slashdot.org", "published_at": "2025-10-03T21:22:00Z", "relevance_score": 0.15}, {"title": "The Saudi Arabia Assassin’s Creed Mirage Expansion Makes A Big Change", "description": "Basim's legs are no longer glued to the ground\nThe post The Saudi Arabia Assassin’s Creed Mirage Expansion Makes A Big Change appeared first on Kotaku.", "content": "Will the jump button come back in the next Assassin’s Creed? Will Battlefield 6 really work right out of the box? Can PowerWash Simulator 2 prevent the further atomization of modern society? It’s the… [+2682 chars]", "url": "https://kotaku.com/assassins-creed-mirage-dlc-jump-button-battlefield-6-disc-2000632532", "source": "Kotaku", "published_at": "2025-10-07T15:11:36Z", "relevance_score": 0.15}, {"title": "Silicon Valley Rep. Ro Khanna says the H-1B visa needs change — but a 'blanket' $100k fee isn't the solution", "description": "Ro Khanna said that the H-1B system needs changes. But he said the $100,000 fee could hurt startups, many of which are located in his district.", "content": "Ro Khanna said that startups will be hurt by a \"blanket\" fee on H-1B visas.Bryan Dozier/Middle East Images/AFP via Getty Images\r\n<ul><li>Ro Khanna criticized Trump's $100,000 H-1B visa fee, citing th… [+2599 chars]", "url": "https://www.businessinsider.com/ro-khanna-blanket-100k-fee-on-h1b-not-the-solution-2025-10", "source": "Business Insider", "published_at": "2025-10-03T04:43:29Z", "relevance_score": 0.15}, {"title": "I'll change the monarchy when I'm king, says Prince William", "description": "Shitt's Creek and American Pie actor Eugene Levy asks Prince William about his future role as King.", "content": "Daniela RelphSenior Royal correspondent\r\nPrince William told actor Eugene Levy in Windsor he does not fear \"change for good\"\r\nThe Prince of Wales has said he will bring change to the monarchy when he… [+4271 chars]", "url": "https://www.bbc.com/news/articles/c20vyjevxe3o", "source": "BBC News", "published_at": "2025-10-02T21:00:33Z", "relevance_score": 0.125}, {"title": "Earth is getting darker and it’s changing the planet’s climate balance", "description": null, "content": "If you click 'Accept all', we and our partners, including 238 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]", "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_45f4e9bc-607f-4aaa-9a9b-f91c4002c7c0", "source": "Yahoo Entertainment", "published_at": "2025-10-05T16:07:00Z", "relevance_score": 0.12}, {"title": "Unearthing Israel’s past: Archaeological discoveries change our understanding of history", "description": "As all these discoveries show, the land’s buried secrets have the power to transform our understanding of history, faith, and the human experience. Few...", "content": "As all these discoveries show, the lands buried secrets have the power to transform our understanding of history, faith, and the human experience.\r\nFew places on Earth carry as much weight of history… [+11570 chars]", "url": "https://www.jpost.com/archaeology/article-869513", "source": "The Jerusalem Post", "published_at": "2025-10-06T13:00:52Z", "relevance_score": 0.12}, {"title": "A recipe for avoiding 15 million deaths a year and climate disaster is fixing food, scientists say", "description": "About 15 million deaths could be avoided each year and agricultural emissions could drop by 15% if people worldwide shift to healthier, predominantly plant-based diets, according to the EAT-Lancet Commission, which brought together scientists worldwide to rev…", "content": "About 15 million deaths could be avoided each year and agricultural emissions could drop by 15% if people worldwide shift to healthier, predominantly plant-based diets, according to the EAT-Lancet Co… [+5759 chars]", "url": "https://phys.org/news/2025-10-recipe-million-deaths-year-climate.html", "source": "Phys.Org", "published_at": "2025-10-03T09:10:01Z", "relevance_score": 0.12}, {"title": "Disney quietly makes a harsh change at theme park shops", "description": "Over the past year, after gradually implementing price hikes for tickets and services, DisneyDIS theme parks have faced criticism for becoming too expensive ...", "content": "Over the past year, after gradually implementing price hikes for tickets and services, Disney (DIS) theme parks have faced criticism for becoming too expensive for families.\r\nA survey from LendingTre… [+2500 chars]", "url": "https://www.thestreet.com/entertainment/disney-quietly-makes-a-harsh-change-at-theme-park-shops", "source": "TheStreet", "published_at": "2025-10-08T03:33:00Z", "relevance_score": 0.12}, {"title": "Brian Stauffer’s “Winds of Change”", "description": "Françoise Mouly writes about the artist Brian Stauffer’s cover for the October 13, 2025, issue of The New Yorker.", "content": "For the cover of the October 13, 2025, issue, the artist Brian Stauffer chose to see the beauty in what many consider a noisy nuisance. One of the things I love about the city is the endless stream o… [+230 chars]", "url": "https://www.newyorker.com/culture/cover-story/cover-story-2025-10-13", "source": "The New Yorker", "published_at": "2025-10-06T10:00:00Z", "relevance_score": 0.12}, {"title": "Six months in 'climate hell': Relentless heat causes routine fainting episodes in textile factories, investigation shows", "description": "\"Almost every day [in the hot season] in our factory, five to seven people faint. Five to seven people just fall down.\"", "content": "\"Almost every day [in the hot season] in our factory, five to seven people faint. Five to seven people just fall down.\"\r\n\"Sometimes I feel my hand muscles[s] and my leg muscle[s] [are] cramped. And s… [+13547 chars]", "url": "https://phys.org/news/2025-10-months-climate-hell-relentless-routine.html", "source": "Phys.Org", "published_at": "2025-10-06T15:30:03Z", "relevance_score": 0.12}, {"title": "Federal government offers hunters cash to make key change to how they hunt: 'We are committed'", "description": "The program addresses a serious issue.", "content": "Hunters can receive up to $100 back when they purchase ammunition that won't poison wildlife, the Mountain West News Bureau reported.\r\nThe U.S. Fish and Wildlife Service launched this rebate program … [+2276 chars]", "url": "https://www.yahoo.com/news/articles/federal-government-offers-hunters-cash-023000919.html", "source": "Yahoo Entertainment", "published_at": "2025-10-05T02:30:00Z", "relevance_score": 0.12}, {"title": "'He fought too many times': How the loss to Ankalaev forced Pereira to change", "description": "Alex Pereira had multiple injuries, including a stress fracture in his tibia, in his last fight against Magomed Ankalaev.", "content": "LAS VEGAS -- Jorge Guimarães knew there was something truly off when former UFC middleweight and then-light heavyweight champion Alex Pereira actually complained about the way he was feeling ahead of… [+6580 chars]", "url": "https://www.espn.com/mma/story/_/id/46465902/ufc-320-mma-how-loss-magomed-ankalaev-forced-alex-pereira-change", "source": "ESPN", "published_at": "2025-10-03T12:23:56Z", "relevance_score": 0.12}, {"title": "My kids and their friends didn't know how to file taxes or change a tire. My husband and I decided to become mentors.", "description": "I wish I had had someone to tell me how to do simple life tasks like laundry. I decided to become the mentor I didn't have to my kids and their friends.", "content": "The author says she sometimes learns alongside her adult kids.Courtesy of the author\r\n<ul><li>My husband and I realized that it wasn't just our kids who didn't have certain life skills.</li><li>They … [+4824 chars]", "url": "https://www.businessinsider.com/became-mentor-to-adult-kids-and-their-friends-2025-10", "source": "Business Insider", "published_at": "2025-10-03T19:27:01Z", "relevance_score": 0.12}, {"title": "One of Earth’s most vital carbon sinks is faltering. Can we save it?", "description": "For decades, forest, grasslands and other land ecosystems have collectively absorbed up to a third of the carbon dioxide we emit each year - but this climate buffer may be collapsing far sooner than anyone expected", "content": "Image Professionals GmbH/Alamy\r\nClimate change deniers love to point out that plants flourish when carbon dioxide levels rise. As we burn fossil fuels, their thinking goes, the Earth will become gree… [+14452 chars]", "url": "https://www.newscientist.com/article/2497724-one-of-earths-most-vital-carbon-sinks-is-faltering-can-we-save-it/", "source": "New Scientist", "published_at": "2025-10-07T16:00:11Z", "relevance_score": 0.09}, {"title": "'SNL' returns to a late-night world still finding its footing in Trump's 2nd term", "description": "Political satire has long been a hallmark of \"Saturday Night Live.\" The climate for late-night comedy, however, has changed.", "content": "NBC's \"Saturday Night Live\" has long skewered Trump and other political leaders in its sketches.NBC/Will Heath/NBC via Getty Images\r\n<ul><li>\"Saturday Night Live\" is back with Bad Bunny hosting.</li>… [+3483 chars]", "url": "https://www.businessinsider.com/snl-return-late-night-trump-jimmy-kimmel-charlie-kirk-comedy-2025-10", "source": "Business Insider", "published_at": "2025-10-05T00:02:08Z", "relevance_score": 0.06}, {"title": "This Map Of La Niña Is Making Some Key Predictions About Winter 2025", "description": "A new climate outlook highlights how changing ocean conditions may influence winter weather across the U.S. in unexpected ways for the rest of 2025.", "content": "If you've lived through a soggy Pacific Northwest winter or a scorching California autumn, you probably know the names El Niño and La Niña all too well. These Pacific-born climate patterns are powerf… [+3696 chars]", "url": "https://www.islands.com/1988705/la-nina-map-forecast-predictions-winter-2025-what-is/", "source": "Islands.com", "published_at": "2025-10-06T20:42:52Z", "relevance_score": 0.035}, {"title": "Expert dismantles myth about cold weather: 'That's exactly what scientists have been warning us about'", "description": "\"Weather does not equal climate.\"", "content": "Amid a chilly winter, it's tempting to dismiss the effects of the changing climate. But one expert explained how one doesn't negate the other.\r\nIn a video shared by AAP FactCheck (@aapfactcheck) on T… [+2800 chars]", "url": "https://www.yahoo.com/news/articles/expert-dismantles-myth-cold-weather-163000595.html", "source": "Yahoo Entertainment", "published_at": "2025-10-05T16:30:00Z", "relevance_score": 0.035}, {"title": "Community leader calls for action after deadly Grand Rapids shooting", "description": "GRAND RAPIDS, Mich. (WOOD) — After a 17-year-old was shot and killed in Grand Rapids Saturday night, community members are speaking out — calling for change ...", "content": "GRAND RAPIDS, Mich. (WOOD) After a 17-year-old was shot and killed in Grand Rapids Saturday night, community members are speaking out calling for change and action to stop the violence.\r\nMarian Barre… [+2100 chars]", "url": "https://www.woodtv.com/news/grand-rapids/community-leader-calls-for-action-after-deadly-grand-rapids-shooting/", "source": "WOODTV.com", "published_at": "2025-10-06T02:38:31Z", "relevance_score": 0.035}, {"title": "Building a Diwheel to Add More Tank Controls to Your Commute", "description": "It’s often said that one should not reinvent the wheel, but that doesn’t mean that you cannot change how the use of said wheel should be interpreted. After initially taking the rather z…", "content": "It’s often said that one should not reinvent the wheel, but that doesn’t mean that you cannot change how the use of said wheel should be interpreted. After initially taking the rather zany concept of… [+1635 chars]", "url": "https://hackaday.com/2025/10/07/building-a-diwheel-to-add-more-tank-controls-to-your-commute/", "source": "Hackaday", "published_at": "2025-10-07T23:00:00Z", "relevance_score": 0.035}, {"title": "Bengals' Taylor planning 'to look at all personnel'", "description": "Bengals coach Zac Taylor sounded open to the possibility of a potential quarterback change after Jake Browning struggled again in a 37-24 loss to the Lions on Sunday.", "content": "CINCINNATI -- Bengals coach Zac Taylor sounded open to the possibility of a potential quarterback change after Jake Browning struggled again in a 37-24 loss to the Detroit Lions on Sunday.\r\nTaylor sa… [+3435 chars]", "url": "https://www.espn.com/nfl/story/_/id/46504233/bengals-taylor-mulls-changes-browning-struggles-again", "source": "ESPN", "published_at": "2025-10-06T02:06:49Z", "relevance_score": 0.035}, {"title": "Pope Leo XIV Blesses Huge 20,000-Year-Old Chunk Of Greenland Ice", "description": "Artist Olafur Eliasson transported the ice slab to the Raising Hope climate conference in Rome to call attention to the threat of fast-melting glaciers worldwide.", "content": "Pope Leo XIV sits beside a chunk of a Greenlandic glacier at the international conference Raising Hope for Climate Justice in Rome last week.\r\nNurPhoto via Getty Images\r\nPope Leo XIV stood on stage a… [+3315 chars]", "url": "https://www.forbes.com/sites/lesliekatz/2025/10/06/pope-leo-xiv-blesses-huge-20000-year-old-chunk-of-greenland-ice/", "source": "Forbes", "published_at": "2025-10-06T19:52:27Z", "relevance_score": 0.035}, {"title": "‘Running Man’ Will Have a New, Stephen King-Approved Ending", "description": "Modern history dictates a change to the new 'Running Man' movie, one that Stephen King and Edgar Wright hope you'll like.", "content": "In just over a month, Edgar Wright’s new take on The Running Man will be out, and it’ll have some changes to source material. This also includes its conclusion, and if you don’t want to know how the … [+1750 chars]", "url": "https://gizmodo.com/running-man-will-have-a-new-stephen-king-approved-ending-2000667741", "source": "Gizmodo.com", "published_at": "2025-10-05T20:15:59Z", "relevance_score": 0.035}, {"title": "New Supreme Court term will reshape Trump's powers", "description": "Legal challenges have been the main means of slowing Trump's unilateral power  grab attempts. That's about to change", "content": "Anthony ZurcherSenior North America reporter\r\nThe US Supreme Court begins its new term on Monday with a docket already full of potentially significant cases that could define the scope of Donald Trum… [+6829 chars]", "url": "https://www.bbc.com/news/articles/cly959ppezeo", "source": "BBC News", "published_at": "2025-10-06T20:08:48Z", "relevance_score": 0.03}, {"title": "Israel stops 13 Gaza aid boats, organisers say, sparking international criticism", "description": "A video from the Israeli foreign ministry verified by Reuters showed the most prominent of the flotilla's passengers, Swedish climate campaigner Greta...", "content": "(Reuters) -Israeli forces have stopped 13 boats carrying foreign activists and aid bound for Gaza, but 30 boats are continuing to sail towards the war-ravaged Palestinian enclave, flotilla organisers… [+5361 chars]", "url": "https://www.yahoo.com/news/articles/israel-stops-13-gaza-aid-031924240.html", "source": "Yahoo Entertainment", "published_at": "2025-10-02T03:19:24Z", "relevance_score": 0.03}, {"title": "There Is No Green Transition Without Consequences", "description": "A new book argues that simply replacing fossil-fuel extraction with critical-mineral mining is no way out of the climate crisis.", "content": "U.S. politics currently allow for vanishingly few areas of bipartisan consensus. But one thing government officials of all kinds tend to agree on is the importance of mining. In particular, they seek… [+12201 chars]", "url": "https://www.theatlantic.com/books/2025/10/extraction-mineral-mining-thea-riofrancos-book-review/684214/", "source": "The Atlantic", "published_at": "2025-10-02T19:06:00Z", "relevance_score": 0.03}, {"title": "Seeking nominations for Business Insider's inaugural list of the rising stars of luxury", "description": "We are looking for designers, dealmakers, and entrepreneurs driving change in the worlds of luxury, beauty, and fashion.", "content": "Do you know someone shaking up the luxury industry? Nominate them for our first-ever list of Rising Stars of Luxury.Europa Press News/Europa Press via Getty Images\r\n<ul><li>We're seeking nominations … [+1230 chars]", "url": "https://www.businessinsider.com/seeking-nominations-rising-stars-luxury-list-fashion-beauty-executive-entrepreneur-2025-10", "source": "Business Insider", "published_at": "2025-10-07T19:14:34Z", "relevance_score": 0.03}, {"title": "Nuclear fusion, the ‘holy grail’ of power, was always 30 years away—now it’s a matter of when, not if, fusion comes online to power AI", "description": "Fusion has the potential to solve the world's energy demand and climate goals, but questions remain about crossing the technology finish line and scaling up ...", "content": "Microsoft founder Bill Gates says the coolest things hes working are fusion energy and next-generation nuclear fission projects.\r\nIf you know how to build a fusion power plant, you can have unlimited… [+12729 chars]", "url": "https://finance.yahoo.com/news/nuclear-fusion-holy-grail-power-170000773.html", "source": "Yahoo Entertainment", "published_at": "2025-10-02T17:00:00Z", "relevance_score": 0.03}, {"title": "Eliminating contrails from flying could be incredibly cheap", "description": "Could we halve aviation's climate impact at a fraction of the cost of sustainable aviation fuels?", "content": "Eliminating CO2 emissions from flying is going to be expensive, regardless of the solution the world adopts.1\r\nBut aviation also contributes to global warming through its non-CO2 effects. Those are m… [+15164 chars]", "url": "https://www.sustainabilitybynumbers.com/p/eliminating-contrails", "source": "Sustainabilitybynumbers.com", "published_at": "2025-10-07T19:07:07Z", "relevance_score": 0.03}, {"title": "The rich must eat less meat", "description": "Here’s a sobering fact: Even if the entire world transitions away from fossil fuels, the way we farm and eat will cause global temperatures to rise 1.5 degrees Celsius above preindustrial levels — the critical threshold set in the Paris Climate Agreement. The…", "content": "Heres a sobering fact: Even if the entire world transitions away from fossil fuels, the way we farm and eat will cause global temperatures to rise 1.5 degrees Celsius above preindustrial levels the c… [+11860 chars]", "url": "https://www.vox.com/future-perfect/463643/eat-lancet-plant-based-diet-climate-week", "source": "Vox", "published_at": "2025-10-02T23:37:17Z", "relevance_score": 0.03}, {"title": "NYC's First Quantum Computer Is Officially Online (And It Has A Clear AI Directive)", "description": "A first-of-its-kind quantum computer is now live in NYC, built with AI in mind. But can it really change the future of model training and efficiency?", "content": "The domain of artificial intelligence is progressing at a breakneck pace, but at the same time, it is also running into a variety of challenges. The compute costs and energy requirements are extremel… [+3516 chars]", "url": "https://www.slashgear.com/1985009/new-york-city-first-quantum-computer-data-center/", "source": "SlashGear", "published_at": "2025-10-07T13:15:00Z", "relevance_score": 0.03}, {"title": "People Have Some Pretty Strong Thoughts About Taylor Swift’s New Song “CANCELLED!”", "description": "“‘I like my friends cancelled’ is the most tone deaf lyric a white billionaire with MAGA friends could release in this climate.”View Entire Post ›", "content": "I was thinking Brittany and Sabrina, one user said, while another pointed out that Sabrina was accused of stealing someone's man too.\r\nOne fan suggested, I think this song isnt necessarily about any … [+306 chars]", "url": "https://www.buzzfeed.com/leylamohammed/taylor-swift-new-song-cancelled-lyrics-explained-backlash", "source": "Buzzfeed", "published_at": "2025-10-03T12:23:07Z", "relevance_score": 0.03}, {"title": "Why did Crunchyroll's subtitles just get worse?", "description": "A small change to operations may undermine a key differentiator for the anime streamer.", "content": "Since the most recent round of Crunchyroll layoffs, subscribers have noticed frequent issues such as new episodes airing late, audio tracks getting swapped, typesetting mishaps, and more. But now it … [+14316 chars]", "url": "https://animebythenumbers.substack.com/p/worse-crunchyroll-subtitles", "source": "Substack.com", "published_at": "2025-10-03T04:24:58Z", "relevance_score": 0.03}, {"title": "New report warns of impending catastrophe that could impact more than 1 million people: 'It's too late to avoid any impacts'", "description": "\"It's no longer a forecast, a projection, or prediction.\"", "content": "As Australia desperately tries to reduce pollution and negative climate effects from polluting gases, its government warns that rising heat and sea levels could have a catastrophic effect on Australi… [+2870 chars]", "url": "https://www.yahoo.com/news/articles/report-warns-impending-catastrophe-could-011500673.html", "source": "Yahoo Entertainment", "published_at": "2025-10-04T01:15:00Z", "relevance_score": 0.005000000000000001}, {"title": "Zombie Fires and Historic Hurricanes: The 8 Wildest Weather Events of Summer 2025", "description": "A surge in zombie fires. Back-to-back black rainstorms. This summer’s weather was something else.", "content": "This year has produced some really wild weather. And when I say wild, I mean truly unexpected, record-breaking, extreme events that defied our understanding of Earths climate system.\r\nTo be fair to t… [+8065 chars]", "url": "https://gizmodo.com/zombie-fires-and-historic-hurricanes-the-8-wildest-weather-events-of-summer-2025-2000667518", "source": "Gizmodo.com", "published_at": "2025-10-08T11:00:50Z", "relevance_score": 0.005000000000000001}, {"title": "Antarctica may have crossed a tipping point that leads to rising seas", "description": "Scientists are beginning to understand the sudden loss of sea ice in Antarctica – and there is growing evidence that it represents a permanent shift with potentially catastrophic consequences", "content": "Melting ice sheets in Antarctica will raise sea levels\r\nDurkTalsma/Getty Images\r\nAntarctica may have passed a climate tipping point of no return, scientists are warning, with mounting evidence that a… [+4519 chars]", "url": "https://www.newscientist.com/article/2498509-antarctica-may-have-crossed-a-tipping-point-that-leads-to-rising-seas/", "source": "New Scientist", "published_at": "2025-10-02T15:00:44Z", "relevance_score": 0.005000000000000001}, {"title": "New study finds staggering number of deaths caused by one major factor: 'More people are dying than ever before'", "description": "These deaths can be avoided.", "content": "A new University of Oxford study has estimated the number of heat-related deaths in Zurich caused by changes in global weather patterns.\r\nWhat's happening?\r\nData collected by researchers at the Unive… [+2652 chars]", "url": "https://www.yahoo.com/news/articles/study-finds-staggering-number-deaths-030000008.html", "source": "Yahoo Entertainment", "published_at": "2025-10-04T03:00:00Z", "relevance_score": 0.005000000000000001}, {"title": "Officials issue warning amid concerning surge in rattlesnake attacks — here's what you need to know", "description": "Some snakes will relocate to areas they have never lived before.", "content": "The warming climate continues to threaten the habitats of living things in every corner of the world. As the United Nations reports, this, coupled with human overuse of land, endangers biodiversity a… [+1948 chars]", "url": "https://www.yahoo.com/news/articles/officials-issue-warning-amid-concerning-091500371.html", "source": "Yahoo Entertainment", "published_at": "2025-10-02T09:15:00Z", "relevance_score": 0.005000000000000001}, {"title": "Japan Saw Record Number Treated For Heatstroke in Hottest-Ever Summer", "description": "More than 100,000 people were sent to hospitals due to heatstroke in Japan between May 1 and Sunday, according to preliminary data from the Fire and Disaster Management Agency. Bloomberg, via Japan Times: The number is the most on record, according to NHK. Tr…", "content": "The number is the most on record, according to NHK. Transport to hospitals of patients linked to heatstroke over the period rose almost 3% to 100,143 from a year earlier as Japan saw its national tem… [+667 chars]", "url": "https://news.slashdot.org/story/25/10/02/0811215/japan-saw-record-number-treated-for-heatstroke-in-hottest-ever-summer", "source": "Slashdot.org", "published_at": "2025-10-02T14:40:00Z", "relevance_score": 0.0}, {"title": "UK will leave ECHR if Tories win election, Badenoch says", "description": "The European Convention on Human Rights has become a focal point in debates around changing immigration policy.", "content": "Sam FrancisPolitical reporter\r\nThe Conservatives will take the UK out of the European Convention on Human Rights (ECHR) if they win the next election, Kemi Badenoch has announced. \r\nThe announcement … [+4360 chars]", "url": "https://www.bbc.com/news/articles/c1mxy2j2elro", "source": "BBC News", "published_at": "2025-10-03T21:23:15Z", "relevance_score": 0.0}, {"title": "U.N. food agency to suspend food aid for 750,000 people in Somalia next month", "description": "The U.N. food agency announced on Friday that it is cutting food assistance for hundreds of thousands of people in Somalia, where millions are facing...", "content": "NAIROBI, Kenya (AP) The U.N. food agency announced on Friday that it is cutting food assistance for hundreds of thousands of people in Somalia, where millions are facing devastating effects of climat… [+1465 chars]", "url": "https://www.yahoo.com/news/articles/u-n-food-agency-suspend-115405183.html", "source": "Yahoo Entertainment", "published_at": "2025-10-03T11:54:05Z", "relevance_score": 0.0}, {"title": "Hundreds of Hikers Still Stranded on Mount Everest After Brutal Blizzard Hits", "description": "Hikers suddenly found themselves in a life-threatening situation as a rare October blizzard buried their camps in snow.", "content": "A brutal blizzard struck Tibet and Nepal on Friday evening, stranding hundreds of hikers near the eastern face of Mount Everest. While 350 have reportedly been brought to safety, more than 200 are st… [+3411 chars]", "url": "https://gizmodo.com/hundreds-of-hikers-still-stranded-on-mount-everest-after-brutal-blizzard-hits-2000668131", "source": "Gizmodo.com", "published_at": "2025-10-06T16:45:22Z", "relevance_score": 0.0}, {"title": "Company bids less than a penny per ton in biggest US coal sale in over a decade", "description": "A Navajo tribe-owned company bid $186,000 to lease 167 million tons of coal on federal lands in southeastern Montana on Monday in the biggest U.S. coal sale ...", "content": "BILLINGS, Mont. (AP) A Navajo tribe-owned company bid $186,000 to lease 167 million tons of coal on federal lands in southeastern Montana on Monday in the biggest U.S. coal sale in more than a decade… [+2495 chars]", "url": "https://finance.yahoo.com/news/company-bids-less-penny-per-181028810.html", "source": "Yahoo Entertainment", "published_at": "2025-10-06T18:10:28Z", "relevance_score": 0.0}, {"title": "South Africa’s Coast Is Rising—And Scientists Have a New Explanation Why", "description": "Human water management contributes to sinking land across the globe, and it may also be responsible for an unexpected rise", "content": "For decades geologists thought the slow rise of South Africa’s southern coast was driven by forces deep below—buoyant plumes of molten rock ascending through Earth’s mantle and heaving the crust upwa… [+6144 chars]", "url": "https://www.scientificamerican.com/article/south-africas-coast-is-rising-and-scientists-have-a-new-explanation-why/", "source": "Scientific American", "published_at": "2025-10-07T10:45:00Z", "relevance_score": 0.0}, {"title": "Officials issue sweeping ban on common power tool usage: 'Enforcement will be carried out'", "description": "\"A permit is issued only after inspection.\"", "content": "The Nigerian state of Kano has enacted a law, coupled with strict fines and enforcement, to maintain natural resources.\r\nAccording to Business Day, the law bans the use of chainsaws for cutting, fell… [+1913 chars]", "url": "https://www.yahoo.com/news/articles/officials-issue-sweeping-ban-common-233000501.html", "source": "Yahoo Entertainment", "published_at": "2025-10-06T23:30:00Z", "relevance_score": 0.0}, {"title": "'I heard their opinion' - Postecoglou undaunted as fans turn", "description": "Ange Postecoglou remains defiant despite Nottingham Forest fans turning on the new manager after a sixth game without a win.", "content": "Ange Postecoglou remained defiant as Nottingham Forest fans called for him to be sacked after barely three weeks in charge.\r\nA damaging 3-2 Europa League defeat by Midtjylland means Postecoglou is wi… [+3466 chars]", "url": "https://www.bbc.com/sport/football/articles/cd72wenj4vdo", "source": "BBC News", "published_at": "2025-10-02T22:39:34Z", "relevance_score": 0.0}, {"title": "Why time matters for Tory MPs deciding Kemi Badenoch's future", "description": "For many Tory MPs looking at Kemi Badenoch's leadership, they are already wondering how much more time she needs to turn around the party's fortunes.", "content": "Matt Chorley5 Live presenter\r\nLouis Armstrong had all of it in the world. The Beautiful South needed a little more. \r\nFor Kemi Badenoch, and her 118 MPs, time is also on their minds.\r\nThe Conservativ… [+9202 chars]", "url": "https://www.bbc.com/news/articles/cn0rnj6504yo", "source": "BBC News", "published_at": "2025-10-06T01:21:44Z", "relevance_score": 0.0}, {"title": "Trio win Nobel chemistry prize for developing 'Hermione's handbag' materials", "description": "STOCKHOLM (Reuters) -Scientists Susumu Kitagawa, Richard Robson and Omar Yaghi won the 2025 Nobel chemistry prize for developing a new form of molecular...", "content": "By Johan Ahlander and Niklas Pollard\r\nSTOCKHOLM (Reuters) -Scientists Susumu Kitagawa, Richard Robson and Omar Yaghi won the 2025 Nobel chemistry prize for developing a new form of molecular architec… [+3083 chars]", "url": "https://ca.news.yahoo.com/trio-win-nobel-chemistry-prize-104321456.html", "source": "Yahoo Entertainment", "published_at": "2025-10-08T10:43:21Z", "relevance_score": 0.0}, {"title": "Record Amazon fires release more carbon than an entire country", "description": "The Amazon has suffered its most destructive fire season in more than two decades, releasing a staggering 791 million tons of carbon dioxide—on par with Germany’s annual emissions. Scientists found that for the first time, fire-driven degradation, not defores…", "content": "A new study by researchers at the European Commission's Joint Research Centre reveals that the Amazon rainforest has just undergone its most devastating forest fire season in over two decades, which … [+3031 chars]", "url": "https://www.sciencedaily.com/releases/2025/10/251008030932.htm", "source": "Science Daily", "published_at": "2025-10-08T11:18:54Z", "relevance_score": 0.0}, {"title": "Africa's 'great green wall' is stalling: In Senegal very few planted areas show progress", "description": "Africa's Great Green Wall project began as an ambitious plan to build a 15-kilometer-wide band of trees across the north of Africa. The African Union launched the project in 2007 with plans for the trees to extend for 6,000 kilometers through 11 countries in …", "content": "Africa's Great Green Wall project began as an ambitious plan to build a 15-kilometer-wide band of trees across the north of Africa. The African Union launched the project in 2007 with plans for the t… [+7312 chars]", "url": "https://phys.org/news/2025-10-africa-great-green-wall-stalling.html", "source": "Phys.Org", "published_at": "2025-10-07T16:31:05Z", "relevance_score": 0.0}, {"title": "How Verizon uses AI, drones, and robots to keep your phone connected during a crisis", "description": "I saw firsthand how Verizon Frontline is using emerging technologies to respond to natural disasters — here's how it might help you when it matters most.", "content": "Connectivity is something we often take for granted in the digital age, but it can be gone in an instant — and when it matters most — in the event of a natural disaster. When cellular connectivity dr… [+6593 chars]", "url": "https://www.androidcentral.com/phones/verizon-wireless/how-verizon-is-using-ai-drones-and-robots-to-keep-your-phone-connected-during-crisis", "source": "Android Central", "published_at": "2025-10-07T17:04:00Z", "relevance_score": 0.0}, {"title": "TAG Heuer's New Smartwatch Ditches Google's Wear OS to Be Apple Friendly", "description": "The Connected Calibre E5 runs bespoke OS, so it works with Android but, crucially, now gets that coveted Made-for-iPhone certification—and all for a cool $1,800.", "content": "Right as Google's Wear OS is hitting its stridenow feature-rich with robust smartwatches that can go toe-to-toe with the Apple Watchluxury watchmaker TAG Heuer has decided to ditch the operating syst… [+2956 chars]", "url": "https://www.wired.com/story/tag-heuer-connected-calibre-e5/", "source": "Wired", "published_at": "2025-10-08T14:00:00Z", "relevance_score": 0.0}, {"title": "Photographer captures striking image of rare creature in unexpected location — here's why it's so unusual", "description": "Each sighting provides valuable information.", "content": "A peaceful stroll along a County Durham stream turned into a thrilling wildlife encounter when photographer Brian Howes spotted a grey wagtail a bird rarely seen in the area during the colder months.… [+2074 chars]", "url": "https://www.yahoo.com/news/articles/photographer-captures-striking-image-rare-061500843.html", "source": "Yahoo Entertainment", "published_at": "2025-10-06T06:15:00Z", "relevance_score": 0.0}, {"title": "India wants to lure its best minds back from the US - but it won't be easy", "description": "Driving reverse migration from the US at scale will require a concerted effort that's currently missing, experts say.", "content": "A hostile immigration environment is prompting some Indians in the US to think of returning home\r\nUS President Donald Trump's abrupt decision to hike H-1B visa fees to $100,000 has prompted policymak… [+6249 chars]", "url": "https://www.bbc.com/news/articles/c1792qwg85qo", "source": "BBC News", "published_at": "2025-10-05T22:52:47Z", "relevance_score": 0.0}, {"title": "Why US Power Bills Are Surging", "description": "Americans are paying more for electricity—and rates will keep rising. But after a period of pain, rates should level off as the benefits of a shift away from fossil fuels begin to be felt.", "content": "Now, electricity prices are surging in addition to all of the uncorked demand from the Covid-19 pandemic, when the global economic slowdown and pressure from policymakers kept a lid on utility bills.… [+1673 chars]", "url": "https://www.wired.com/story/power-bills-in-the-us-are-soaring-and-will-rise-further-still/", "source": "Wired", "published_at": "2025-10-04T11:00:00Z", "relevance_score": 0.0}, {"title": "Ocean Acidification Threshold Pushes Earth Past Another Planetary Boundary", "description": "Earth has breached a critical boundary for ocean acidification, with potentially grim effects for ocean ecosystems and human livelihoods", "content": "Our planet is sick, and its life-threatening symptoms are getting worse, a new report warns.\r\nEarth has been pushed past multiple physical and chemical boundaries crucial for keeping the world a liva… [+5934 chars]", "url": "https://www.scientificamerican.com/article/ocean-acidification-threshold-pushes-earth-past-another-planetary-boundary/", "source": "Scientific American", "published_at": "2025-10-03T11:30:00Z", "relevance_score": 0.0}, {"title": "WATCH: What does the government shutdown mean for you and your family?", "description": "ABC News' senior White House correspondent Selina Wang answers the most searched questions on the first day of the government shutdown.", "content": "<ul><li>2 planes clip each other after hard landing at LGA\r\n</li><li>American families caught in the middle as government shutdown enters day 2\r\n</li><li>UK police respond to suspected stabbing and c… [+4604 chars]", "url": "https://abcnews.go.com/US/video/government-shutdown-family-126150783", "source": "ABC News", "published_at": "2025-10-02T13:26:38Z", "relevance_score": 0.0}, {"title": "WATCH: Fact-checking JD Vance's comments regarding government shutdown", "description": "ABC News' Katherine Faulders fact-checks the vice president's comments on the partisan divide hindering the passage of a funding deal.", "content": "<ul><li>2 planes clip each other after hard landing at LGA\r\n</li><li>American families caught in the middle as government shutdown enters day 2\r\n</li><li>UK police respond to suspected stabbing and c… [+4604 chars]", "url": "https://abcnews.go.com/US/video/fact-checking-jd-vances-comments-government-shutdown-126150594", "source": "ABC News", "published_at": "2025-10-02T13:26:07Z", "relevance_score": 0.0}, {"title": "WATCH: Part of high-rise apartment building collapses in New York City", "description": "An investigation is underway after an explosion in the Bronx caused part of a NYCHA apartment building to collapse on Wednesday morning.", "content": "<ul><li>2 planes clip each other after hard landing at LGA\r\n</li><li>American families caught in the middle as government shutdown enters day 2\r\n</li><li>UK police respond to suspected stabbing and c… [+4604 chars]", "url": "https://abcnews.go.com/US/video/part-high-rise-apartment-building-collapses-new-york-126150869", "source": "ABC News", "published_at": "2025-10-02T13:28:43Z", "relevance_score": 0.0}, {"title": "WATCH: Government shutdown enters day 2", "description": "The next vote on bills that could get federal money flowing again is not scheduled until Friday, as thousands of workers remain furloughed and many government services are at a standstill.", "content": "<ul><li>White House: Cuts to federal programs, firings 'very real'\r\n</li><li>Arrests made in deadly UK synagogue stabbing\r\n</li><li>How everyday Americans feel about the government shutdown\r\n</li><li… [+4576 chars]", "url": "https://abcnews.go.com/US/video/government-shutdown-enters-day-2-126157768", "source": "ABC News", "published_at": "2025-10-02T17:25:46Z", "relevance_score": 0.0}, {"title": "Australia, Papua New Guinea sign mutual defence treaty", "description": "Pukpuk treaty commits the two neighbours to greater military cooperation, although the text is yet to be released.", "content": "Australias Prime Minister Anthony Albanese and the Prime Minister of Papua New Guinea (PNG) James Marape have signed a mutual defence treaty in Canberra, with the leaders saying the text of the agree… [+2805 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/australia-papua-new-guinea-sign-mutual-defence-treaty", "source": "Al Jazeera English", "published_at": "2025-10-06T03:24:55Z", "relevance_score": 0.0}, {"title": "The battle is on for the Conservatives to show they matter", "description": "As the party's annual conference begins, there are reasons for the current leadership to be gloomy, writes Laura Kuenssberg.", "content": "\"Oh God,\" and then a pause, a sigh, and then, \"Oh God,\" again.\r\nJust as a senior Conservative was telling me the party might be able to climb out the terrible hole it's in, news popped up of another … [+11154 chars]", "url": "https://www.bbc.com/news/articles/c864dzn827xo", "source": "BBC News", "published_at": "2025-10-04T12:23:06Z", "relevance_score": 0.0}, {"title": "10 Weekend Reads", "description": "The weekend is here! Pour yourself a mug of Colombia Tolima Los Brasiles Peaberry Organic coffee, grab a seat outside, and get ready for our longer-form weekend reads: • The Mysterious Billionaire Boss at Jane Street Smashing Trading Records: The firm’s secre…", "content": "The Mysterious Billionaire Boss at Jane Street Smashing Trading Records: The firms secrecy-loving co-founder is raking in money faster than he can spend it on Burning Man, his own casino and, unwitti… [+2260 chars]", "url": "https://ritholtz.com/2025/10/10-weekend-reads-60/", "source": "Ritholtz.com", "published_at": "2025-10-04T10:30:44Z", "relevance_score": 0.0}, {"title": "How stereotypes shape AI – and what that means for the future of hiring", "description": "Hear the biggest stories from the world of science | 08 October 2025", "content": "Download the Nature Podcast 08 October 2025\r\nIn this episode:\r\n00:48 The stereotypes hidden in Internet images\r\nStereotyped assumptions about womens ages and their perceived job suitability are enhan… [+2119 chars]", "url": "https://www.nature.com/articles/d41586-025-03298-9", "source": "Nature.com", "published_at": "2025-10-08T00:00:00Z", "relevance_score": 0.0}, {"title": "Israeli forces intercept new aid flotilla bound for Gaza", "description": "Activists on board nine vessels carrying food and medical supplies for Palestinians will be deported, Israel says.", "content": "A new flotilla heading for the Gaza Strip with food and medical supplies on board has been intercepted by Israeli forces.\r\nThe fleet, made up of nine vessels and 150 people, was stopped in internatio… [+2178 chars]", "url": "https://www.bbc.com/news/articles/cwyn9qp9v11o", "source": "BBC News", "published_at": "2025-10-08T09:05:30Z", "relevance_score": 0.0}, {"title": "The Trailer for the Final Season of ‘The Witcher’ Teases Geralt’s Last Battle", "description": "The hunt for Ciri is on, and Geralt's got a whole new face to deal with it.", "content": "The end is nigh for Netflix’s adaptation of The Witcher, and it’s all climaxing in one last battle… and another hunt for Ciri (Freya Allan), as she once again becomes the key to all things for the fa… [+1636 chars]", "url": "https://gizmodo.com/witcher-season-4-trailer-netflix-liam-hemsworth-2000668837", "source": "Gizmodo.com", "published_at": "2025-10-07T15:30:36Z", "relevance_score": 0.0}, {"title": "Apple Releases Second iOS 26.1 Beta With a Useful Security Feature", "description": "Apple also adjusts a few other features, like your iPhone's alarm, in the beta.", "content": "Apple released the second public beta of iOS 26.1 on Tuesday, less than a month after the company released iOS 26, which introduced Liquid Glass, call screening and more to your device. \r\niOS 26.1 br… [+4752 chars]", "url": "https://www.cnet.com/tech/services-and-software/apple-releases-second-ios-26-1-beta-with-a-useful-security-feature/", "source": "CNET", "published_at": "2025-10-07T19:51:18Z", "relevance_score": 0.0}, {"title": "The surging price tag of wildfires, in one chart", "description": "The modern age of burning has been ignited by human hands.  Though wildfires are natural and necessary in many ecosystems, their expanding path of destruction in recent years has been worsened by all the different ways humanity has reshaped the environment. C…", "content": "The wildfires in Los Angeles earlier this year were likely the costliest blazes on record.\r\n\n\nThe modern age of burning has been ignited by human hands. \n\nThough wildfires are natural and necessary i… [+10195 chars]", "url": "https://www.vox.com/climate/463556/wildfire-insurance-climate-science-los-angeles-fire-insurance", "source": "Vox", "published_at": "2025-10-02T17:51:27Z", "relevance_score": 0.0}]}