{"timestamp": 1760215263.156343, "data": {"url": "https://www.cnn.com/world/dumphones-feature-phones-spc", "title": "‘Dumbphones’ are getting smarter, more costly and offering options for disillusioned consumers", "text": "The odds are you’re reading this on your phone. You may have come here via social media, the CNN app, an email or a good old-fashioned browser. The chances are you did not open your smartphone with the intention to load this story, but here you are.\n\nA necessity, a habit or an addiction, call it what you like: we’re all on our phones. The research and data around smartphone addiction and its negative impact on sleep, mental performance and mental health is alarming. Studies have found even when we’re not using them, if we’re in the same room as our smartphone it’s affecting our brains. Yet in less than a generation, they have become an indispensable part of our lives.\n\nNevertheless, plenty of people are finding ways to disconnect. Some want a digital detox to boost performance and wellbeing; some are concerned parents; others cite data privacy fears, or are choosing to wall themselves off from the attention economy. At the extreme end, some youths are turning their backs on technology and proudly defining themselves as Luddites.\n\nMany are turning to “dumbphones” instead — a pre-smartphone, or a new model with limited functions, sometimes called a feature phone or brick phone. There is a bubbling, and highly invested community of users offering advice online about where to buy “deadstock” (old handsets no longer in production) and detailed specification comparisons of current models, for those with the inclination or the luxury to make the change.\n\nThe feature phone market remains large according to Yang Wang, senior analyst at Counterpoint Research, though it’s gradually declining, as more people in developing countries upgrade to smartphones. Last year, around 15% of handsets sold globally were feature phones — nearly 210 million devices, with a value of $3.2 billion, he said. But only 1.7 million of that total were sold in North America, and only 12 million in Europe, largely in Central and Eastern Europe, Wang said.\n\nIn these and other developed economies, niche manufacturers are creating premium alternatives, catering to a culture shift fuelled by online movements like Bring Back Blackberry, hashtag #BringBackFlipPhones and UK grassroots scheme Smartphone Free Childhood.\n\nAs you might expect, some of these company founders have their own stories of disillusionment.\n\nPetter Neby founded Swiss company Punkt in 2008, inspired by his relationship with his Blackberry in the mid 2000s.\n\n“I was hooked,” he said. “It’s Saturday, you just need to send a message to your wife that you’re late and you’re going to buy ice cream, and suddenly (you’ve written) three emails. It’s problematic.”\n\nPunkt’s initial solution was the MP01. Launched in 2015 with a tactile keypad and sturdy design , it was capable of calls and texts, with a calendar, alarm and some other basic functions. The MP01 set the tone for Punkt’s “very strict and Lutheran” approach to product design, which Neby calls “digital minimalism.” But by giving users the ability to share a phone number with a paired smartphone, Punkt hinted the device was all about giving the user options, rather than forcing them to go cold turkey.\n\nKaiwei Tang, cofounder of mobile phone company Light, said the firm sprang from a Google Creative Lab incubator in 2014. He and future business partner Joe Hollier were surrounded by entrepreneurs boasting about their apps’ engagement time. “I asked myself,” said Tang, “What about me? What about my time?”\n\n“The problem is not the device, it’s the business model: the attention economy,” he explained. “Every free app, every social media platform, every browser, is trying to maximize engagement so they can make money collecting data and categorizing people into different groups so they can sell it to advertisers.”\n\nThe Light Phone was designed to shut out the attention economy. Tang and Hollier resolved to create a phone from the ground up; one that would not show users advertisements, that ensured every interaction had a clear ending, and that would never show you a feed to scroll through endlessly. When Tang pitched the phone to Foxconn, the Taiwanese manufacturer of iPhones and other smartphones, in 2015, an executive told him even his family might need one.\n\nThe first models shipped in 2017. Today, The Light Phone is in its third generation, and features 5G connectivity, NFC chip and fingerprint ID. The company continues to build every tool (it prefers the term to apps) from scratch, from messaging to maps.\n\n“I want to make it boring,” Tang said of the user experience, which leans into a black and white, text-based display. (The same tactic is employed by Punkt’s MP range — some research and a growing body of anecdotal evidence suggests switching to grayscale can reduce screen time.)\n\nThe Light Phone is looking at adding more tools, like two-factor authentication and contactless payment, and is even exploring integrating an AI assistant.\n\n“We’re not anti-technology,” Tang stressed. “We see ourselves as a lifestyle brand … We’re promoting a lifestyle that’s very different from a smartphone-centric lifestyle.”\n\nIn the spring, Light launched The Light Phone III, and over 100,000 people are using its devices worldwide, said the cofounder, despite Light forgoing paid advertising and retailing for a premium price.\n\nJust because a phone is dumb, or has limited features, that doesn’t mean it’s cheap. Economies of scale mean smaller companies are paying a premium for materials, and working with fewer R&D resources than the likes of Apple or Samsung.\n\nPunkt’s first dumbphone retailed for $229, raising eyebrows, and its fifth generation dumbphone, the MP02, sells for $299. Punkt sells around 50,000 units across its range annually, Neby said.\n\nThe Light Phone III retails at $699. Tang is quick to defend the price: “$699 is not a huge investment (to) get hours of your time and attention back,” adding the repairable device has been designed to last 5-10 years.\n\n“You could obviously get a $5-10 flip phone from Alibaba or Amazon — if that works for you, I’m all for it,” he said. “(We’re) not going back, we’re moving forward.”\n\nOver in Finland, manufacturer HMD Global is asking the question: Can a company do both?\n\nHMD, which stands for Human Mobile Devices, took over the Nokia brand and began releasing feature phones in 2016, including revived classic models the Nokia 3210 and Nokia 2660 Flip.\n\nBetween 2022 and 2023, its flip phone sales doubled, said head of product marketing Adam Ferguson, leaving HMD to wonder why. Research led the company to the #BringBackFlipPhones campaign on social media. “Last time I looked, something like 61 million people have used that hashtag. It’s ridiculous,” he said.\n\nAlongside its feature phone output, like Light and Punkt, HMD has begun developing smarter devices that hint at a future middle ground in the mobile phone market.\n\nIn August the HMD Fuse was released. A smartphone that starts life as a brick phone, it was designed for children, giving parents the power to unlock functions as their child gets older.\n\nIt’s the product of HMD’s Better Phone Project, for which the company spoke to 37,000 children and parents about their relationship with their phones.\n\n“This huge thing has been bubbling underneath our industry for a number of years now,” said Ferguson. “People are incredibly discontent with the way devices are set up at the moment and they want change,” he added — particularly parents introducing their children to mobile phones for the first time.\n\nBy default, every app on the Fuse is locked, including the camera. Caregivers can set the phone to only accept calls and messages from a set list of contacts. “Every family can tailor the experience to a child,” said Ferguson. “It forces those conversations, which is one of the big things that the research said was missing.”\n\nIts buzzy feature is the Fuse’s integration of HarmBlock, which detects nudity on screen. An AI developed by SafeToNet in collaboration with the Internet Watch Foundation, HarmBlock was trained on 22 million instances of inappropriate imagery, said Ferguson. Working in the background of the Fuse, the pixel recognition AI will shut down the camera if a user tries to take a sexual image, or blanks out nude content on a browser, or social or messaging apps.\n\n“We’ve been working with (HarmBlock) for over a year now to embed it deep into the device so that it can’t be bypassed,” Ferguson explained.\n\nPunkt and Light say their typical buyer skews young — in their 20s and 30s — and in Punkt’s case is male. By focusing on younger Gen Z and emerging Gen Alpha users, the Fuse wants to foster a healthier relationship with phones from the get-go.\n\nDevices like the Fuse, The Light Phone, and Punkt’s first smartphone, the MC02 (which is marketed on its robust privacy and security features) point to a widening — or at least more conscientious — view of what consumers want from their phones.\n\n“Once you get to (market) maturity … then it starts to go into more niches,” said Neby, who foresees “more fragmentation” within the smartphone industry.\n\nCould the biggest smartphone manufacturers fill those niches and go “dumb” themselves? It’s unlikely, said Wang, given how opposed it would be to their business model.\n\nBut there’s always the chance the big guns could be swayed by rising consumer demand and start adopting new ideas. Ferguson believes in the case of the Fuse’s child-safety functions, there’s “money to be made” that could tempt manufacturers to introduce them. That could come at HMD’s expense, but “if we can drive that kind of change, that is an absolute win,” he said.\n\n“It’s not easy to be a dwarf in this field of giants,” said Neby. Though he argued there’s a necessity for feature phone businesses like his to exist, and even thrive amid cultural change.\n\n“Punkt is not here to become the next Apple. Punkt is here to provide a choice,” he said.\n\n“We will always be a niche player. But we are trying to respond to the malaise of an industry. And since it’s the most important consumer industry in the world, we have an obligation to act.”", "authors": ["Tom Page"], "published_date": "2025-09-30T08:15:02.016000+00:00", "top_image": "https://media.cnn.com/api/v1/images/stellar/prod/dumbphones.jpg?c=16x9&q=w_800,c_fill", "summary": "Many are turning to “dumbphones” instead — a pre-smartphone, or a new model with limited functions, sometimes called a feature phone or brick phone.\nLast year, around 15% of handsets sold globally were feature phones — nearly 210 million devices, with a value of $3.2 billion, he said.\nPetter Neby founded Swiss company Punkt in 2008, inspired by his relationship with his Blackberry in the mid 2000s.\nKaiwei Tang, cofounder of mobile phone company Light, said the firm sprang from a Google Creative Lab incubator in 2014.\nThough he argued there’s a necessity for feature phone businesses like his to exist, and even thrive amid cultural change.", "keywords": ["dumbphones", "smarter", "costly", "offering", "options", "disillusioned", "consumers", "phone", "it’s", "light", "smartphone", "we’re", "phones", "feature", "company", "punkt", "tang", "devices", "punkt’s", "ferguson", "research", "million", "neby", "hmd", "fuse", "social", "parents", "attention", "functions", "users", "change", "set", "device", "mobile", "industry"], "success": true, "error": null}}