{"timestamp": 1760215524.938827, "data": {"url": "https://www.aljazeera.com/news/2025/10/10/who-are-the-five-nobel-peace-prize-judges-deciding-whether-trump-gets-it", "title": "Who are the five Nobel Peace Prize judges deciding whether Trump gets it?", "text": "Five members of Norway’s Nobel Committee could hold the key to United States President Donald Trump’s much-desired moment of glory – being named this year’s winner of the Nobel Peace Prize.\n\nEach year, the Nobel Committee, whose members are elected by Norway’s parliament, award the prize, established under the will of Alfred Nobel, to “the person who shall have done the most or the best work for fraternity between nations, the abolition or reduction of standing armies and for the holding and promotion of peace congresses”.\n\nRecommended Stories\n\nlist of 3 items\n\nlist 1 of 3Nobel Prize in Physics awarded to trio for quantum mechanics discoveries\n\nlist 2 of 3Chemistry Nobel Prize awarded to trio in field of metal organic frameworks\n\nlist 3 of 3Nobel Peace Prize 2025: What are Trump’s credentials, and can he win?\n\nend of list\n\nNominations for this year’s award closed on January 31, and the selection of the winner is shrouded in secrecy.\n\nThis year’s winner will be announced on Friday at 11am local time (09:00 GMT), at the Norwegian Nobel Institute in Oslo.\n\nSince he returned to office in January, US President Trump claims he has single-handedly ended eight wars around the world. He has repeatedly suggested that he deserves to win this year’s prize and has claimed it would be a “big insult” to America if he does not win.\n\nSo who are the five members of the Nobel Committee making this year’s crucial decision?\n\nWho are the five Nobel Peace Prize judges?\n\nThe Nobel Committee was established by the Norwegian Storting (Norway’s Parliament) in 1897 and is tasked with picking the laureates of the Nobel Peace Prize.\n\nThe members of the committee are elected for a period of six years and can be re-elected.\n\nAccording to the Nobel Peace Prize’s rules, members of the committee represent the strength of the different political parties in Norway’s Parliament, but cannot be sitting members of the parliament. Once elected, the committee picks its own chairman and deputy chairman, and the director of the Norwegian Nobel Institute serves as the committee’s secretary.\n\nThis year’s Nobel Committee members are:\n\nJorgen Watne Frydnes\n\nFrydnes is the chair of the Nobel Committee.\n\nAt 41, he is the youngest-ever chair of the committee. He was appointed in 2021 and will remain a member until 2026.\n\nFrydnes has spent his career working as a human rights advocate. He has also served as secretary-general of PEN Norway, a group that promotes freedom of expression.\n\nHe has worked with the nongovernment organisation (NGO), Medecins Sans Frontieres (Doctors without Borders, or MSF), and is a member of the human rights NGO, Norwegian Helsinki Committee.\n\nWhile Frydnes is officially nonpolitical, he is known to be supportive of Norway’s ruling Labour Party. He managed a memorial to the 69 Labour activist victims of the 2011 Utoeya massacre carried out by a Norwegian right-wing extremist. Frydnes has played an important role in rebuilding the island of Utoeya since then.\n\nAsle Toje\n\nAged 51, Toje is the vice chair of the Nobel Committee. He has been a member since 2018 and was reappointed to the committee for the period of 2024-2029.\n\nHe is considered a conservative and served as research director at the Norwegian Nobel Institute before joining the Nobel Committee. He has also published a book called The European Union as a Small Power: After the Post-Cold War.\n\nAnne Enger\n\nEnger, 75, has been a member of the committee since 2018 and has also been reappointed for the period from 2021 to 2026.\n\nShe studied nursing and began her career teaching the subject. She later switched to politics, supporting Norway’s Centre Party.\n\nEnger served as chief of the Ministry of Culture and deputy to the prime minister of Norway between 1997 and 1999, acting prime minister in 1998 and became acting chief of the Ministry of Petroleum and Energy briefly in 1999. She has been county governor of the region of Ostfold since 2004.\n\nEnger has also headed the secretariat of the People’s Movement against Free Abortion in Norway.\n\nKristin Clemet\n\nClemet, 68, was appointed to the committee in 2021 and will be a member till 2026.\n\nShe is a Norwegian politician for Hoyre, Norway’s Conservative Party.\n\nAn economist by profession, she was twice an adviser to Norway’s past prime minister, Kare Willoch of the Conservative Party, and has served as minister of education between 2001 and 2005.\n\nGry Larsen\n\nLarsen, 49, is a former Labour state secretary in the Foreign Ministry and head of Norwegian humanitarian organisation CARE Norway, which advocates for global women’s rights. She has previously criticised Trump’s cuts to foreign aid spending.\n\nShe was appointed to the committee for the period of 2024-2029.\n\nHow have they voted in the past?\n\nAccording to the rules of the Nobel Peace Prize, the Nobel Committee receives nominations from members of governments around the world, or the International Court of Justice in The Hague and university professors of of history, social sciences, law, philosophy, theology and religion, among others, by the end of January but are not permitted to reveal the names of the nominees until a winner is announced. In March, the committee prepares a short-list of candidates and announces the winner in October.\n\nThe selection process takes place in complete secrecy. Information on how individual members vote is also not revealed.\n\n“We discuss, we argue, there is a high temperature,” Frydnes, the chairman of the Norwegian Nobel Committee, told the BBC, which got access to the final meeting of the committee this year.\n\n“But also, of course, we are civilised, and we try to make a consensus-based decision every year,” he added.\n\nSince Frydnes became chair of the committee in the group has given the Nobel Peace Prize to Maria Ressa and Dmitry Muratov in 2021 for their efforts to safeguard freedom of expression; Belarusian dissident Ales Bialiatski in 2022 for protecting fundamental rights, and Iran’s Narges Mohammadi in 2023 for fighting for women’s rights.\n\nLast year, Frydnes and the committee announced Japan’s Nihon Hidankyo, a group of survivors of the 1945 US bombings of Hiroshima and Nagasaki, as the winner of the Peace Prize.\n\n“I grew up after the end of the Cold War, when democracy seemed unstoppable and nuclear disarmament realistic,” Frydnes said when he presented the award.\n\nHave any of the members been involved in any controversy?\n\nToje and Enger were also on the committee when Ethiopian Prime Minister Abiy Ahmed won the Prize in 2019 for his role in ending the 20-year military stalemate between Ethiopia and Eritrea. After Ahmed’s win, Ethiopia unleashed a new offensive in Tigray in 2020.\n\n“There are always some people who feel that this laureate was the wrong one,” Toje had said at an event hosted by the International Peace Institute (IPI) that same year.\n\n“Once the announcement has been made, we realise it lives its own life … if the Nobel Peace Prize didn’t spark outrage and strong emotions, well, we wouldn’t be living up to our reputation,” he added.\n\nIn 2023, Indian media also reported that Toje had endorsed India’s prime minister, Narendra Modi, for the Nobel Peace Prize. But BOOM, a fact-checking news organisation in the country, found that it was a false claim and that Toje had never made any such statement.\n\nBack in 1994, Enger had voted against Norway’s European Union membership. In her view, joining the EU would result in Norway losing its traditions and democracy. Enger has also championed anti-abortion campaigns but has been unsuccessful in reversing Norway’s abortion rights.\n\nMeanwhile, Larsen has faced criticism from the Norwegian Israel Centre Against Anti-Semitism (NIS). In 2006, the institute wrote a letter to the former Foreign Minister Jonas Gahr Stoere, accusing Larsen, his political adviser at the time, of demanding “a full boycott of Israel”.\n\n“She was appointed as political adviser despite her being responsible for anti-Israel activities,” the letter had said. It is not clear if Larsen responded to this claim.\n\nWhat do they think of Trump?\n\nTrump has been desperate to win the prize ever since US President Barack Obama won it in 2009.\n\nBesides reiterating that he deserves this year’s prize since he has resolved at least “seven wars” (now eight wars with the Gaza peace deal announced on Thursday), the US president has also called Norwegian diplomats, including former NATO chief Jens Stoltenberg, who is the country’s current finance minister, to lobby them for the Prize.\n\nBut Frydnes says the committee doesn’t give in to such pressure, and a decision is always made independently.\n\n“Every year, we receive thousands of letters, emails, requests, people saying ‘this is the one you should choose’ – so to have that campaign, the pressure … isn’t really something new,” he told the BBC.\n\nFrydnes did not openly refer to Trump in the interview, but in the past, he has called out the US president for cracking down on “democratic nations”.\n\nAnne Enger has remained entirely tight-lipped about her preferences for the Nobel Peace Prize, while Larsen has criticised Trump for cutting USAID and also for how he talks about women and human rights.\n\nClemet is also a Trump sceptic. “After just over 100 days as president, [Trump] is well underway in dismantling American democracy, and he is doing everything he can to tear down the liberal and rules-based world order,” she wrote in May.\n\nToje, on the other hand, attended Trump’s presidential inauguration earlier this year and called it a “f****** great party”. He has also said that Western liberals should take a more “nuanced” approach to him and the MAGA political movement.\n\nHowever, there is no indication of whether he could support Trump for the prize. He has also brushed off any sort of influence from lobbying.\n\n“These types of influence campaigns have a rather more negative effect than a positive one, because we talk about it on the committee. Some candidates push for it really hard, and we do not like it,” he told The National newspaper.\n\n“We are used to work[ing] in a locked room without being attempted to be influenced,” he added.\n\nHas this been a particularly tough year for Norway’s Nobel Committee?\n\nAmid ongoing wars and democratic repression in some countries, as well as Trump’s pressure to be awarded the prize, Frydnes told the BBC that he and the other members feel that “the world is listening, and the world is discussing, and discussing how we can achieve peace is a good thing”.\n\n“And we have to stay strong and principled in our choices … that’s our job.”\n\nWithin Norway, however, worries have arisen about what the US president might do if he does not win the prize.\n\nThe US has already imposed 15 percent tariffs on the country’s exports.\n\nThe Trump administration also told CNBC last month that the US was “very troubled” after Norway – which has an approximately $2 trillion sovereign fund – announced it would divest from US company Caterpillar because of its links to Israel’s war on Gaza.\n\nBut in an interview with Bloomberg on October 3, Foreign Minister Espen Barth Eide said Norway’s government was not involved in the Nobel Peace Prize decisions.\n\nWho are the other contenders?\n\nThe Nobel Committee has received 338 nominees for the prize, out of which 244 are individuals and 94 are organisations.\n\nBut according to the rules of the Nobel Peace Prize, the “committee does not confirm the names of nominees, neither to the media nor to the candidates themselves. There are cases where names of candidates appear in the media, either as a result of sheer speculation or because individuals themselves report to have nominated specific candidates”.\n\nSudan’s Emergency Response Rooms, a volunteer group helping civilians in the war-torn country, and Yulia Navalnaya, the wife of Russian opposition politician Alexey Navalny, who died last year in a Russian prison, are seen as potential contenders.\n\nAccording to bookies like Ladbrokes and oddsmakers, Trump and the Sudanese group are favourites.\n\nAmid speculation, Nina Graeger, director of the Peace Research Institute Oslo, told Al Jazeera that according to tradition, every year she comes up with a list of five potential candidates.\n\n“My list this year includes Sudan’s Emergency Response Rooms, who are local Sudanese organisers who provide humanitarian support to committees affected by the war in the country. These voluntary groups have set up communal kitchens, supported evacuations, offered medical care, fixed infrastructure and provided other services to communities,” she said.\n\nShe noted that awarding this year’s Peace Prize to a deserving humanitarian initiative such as the Emergency Response Rooms would “highlight the critical importance of access to lifesaving aid in times of conflict, and the power of everyday citizens to serve humanity in difficult times”.\n\nThe Committee to Protect Journalists is also a worthy potential recipient of the Peace Prize, she said.\n\n“At a time when the free press is under historic assault, awarding the Committee to Protect Journalists the Nobel Peace Prize would send a powerful message that peace and democracy are endangered if journalists are prevented from keeping the world informed, including from behind the front lines,” she added.", "authors": ["Priyanka Shankar"], "published_date": "2025-10-10T00:00:00", "top_image": "https://www.aljazeera.com/wp-content/uploads/2025/10/2023-10-06T082552Z_1294653203_RC2WM3AK2C3C_RTRMADP_3_NOBEL-PRIZE-PEACE-1760004585.jpg?resize=1920%2C1440", "summary": "Who are the five Nobel Peace Prize judges?\nThe Nobel Committee was established by the Norwegian Storting (Norway’s Parliament) in 1897 and is tasked with picking the laureates of the Nobel Peace Prize.\nThis year’s Nobel Committee members are: Jorgen Watne Frydnes Frydnes is the chair of the Nobel Committee.\nHe is considered a conservative and served as research director at the Norwegian Nobel Institute before joining the Nobel Committee.\nIn 2023, Indian media also reported that Toje had endorsed India’s prime minister, Narendra Modi, for the Nobel Peace Prize.", "keywords": ["judges", "deciding", "nobel", "prize", "peace", "trump", "committee", "norway’s", "frydnes", "members", "norwegian", "minister", "year’s", "enger", "president", "list", "rights", "norway", "toje", "winner", "win", "institute", "world", "larsen", "candidates", "told", "trump’s", "announced", "member", "group", "party", "prime", "parliament", "wars", "period"], "success": true, "error": null}}