{"timestamp": 1760206409.271708, "data": {"url": "https://climate.nasa.gov/news/3184/a-force-of-nature-hurricanes-in-a-changing-climate/", "title": "A Force of Nature: Hurricanes in a Changing Climate", "text": "By Angela Colbert, Ph.D.,\n\nNASA’s Jet Propulsion Laboratory\n\nIn Brief:\n\nDue to global warming, global climate models predict hurricanes will likely cause more intense rainfall and have an increased coastal flood risk due to higher storm surge caused by rising seas. Additionally, the global frequency of storms may decrease or remain unchanged, but hurricanes that form are more likely to become intense.\n\nFrom June 1 to November 30, many Americans turn their eyes to the tropics — not just because they’re dreaming of beach vacations, but because it’s hurricane season. Called by many names depending on where you live (hurricanes, typhoons, cyclones), scientists call these storms tropical cyclones. This is because they are large, rotating storms that need tropical conditions to form — so they originate mostly in the tropics.\n\nNote: Technically, hurricanes are tropical cyclones that have winds of more than 74 miles per hour (about 120 kilometers per hour). However, “hurricanes” will be used as a general term in this article to include tropical storms, which are tropical cyclones below hurricane intensity.\n\nWith that said, let’s talk about some science behind hurricanes and how they may change due to global warming.\n\nRecipe for a Hurricane\n\nHurricanes need four main ingredients to form and strengthen:\n\nwarm ocean water\n\nlots of moisture in the air\n\nlow vertical wind shear\n\na pre-existing disturbance (e.g., a cluster of thunderstorms)\n\nJust like making a perfect cookie, a hurricane needs all the ingredients for it to grow. Change any ingredient too much and the cookie will be too flat, too dry, too crumbly, etc. The same is true for hurricanes: If any of the four main ingredients changes too much, the storm cannot form or will weaken.\n\nOnce a hurricane forms, scientists shift their focus to where it is going and how strong it will be when it gets there. Where a hurricane goes depends mainly on the large-scale weather patterns around it at the time. If it moves over land, it brings with it a fury of strong wind, drenching rain, dangerous storm surge and sometimes tornadoes.\n\nWith so many moving parts, forecasting a hurricane is hard. Large-scale changes in the climate, such as El Niño and La Niña conditions in the tropical Pacific Ocean, also impact hurricanes over an entire season. Thus, trying to determine how climate change will impact hurricanes may seem like an impossible task. However, important tools are in place to help scientists tackle it. These include sophisticated global climate models, scientific understanding of how hurricanes form and evolve, and expanding observational records of past hurricane activity.\n\nWhat Do the Models Show?\n\nTom Knutson, senior scientist at NOAA’s Geophysical Fluid Dynamics Laboratory, is a leading scientist on hurricanes and climate change. He notes that “even if hurricanes themselves don’t change [due to climate change], the flooding from storm surge events will be made worse by sea level rise.” In addition, he says models show increases in a hurricane’s rainfall rate by 2100. This means that hurricanes are likely to cause more intense rain when they come ashore.\n\nScientists have long predicted that climate change would increase extreme rainfall events. In a warmer world, there is simply more moisture in the air in the form of gaseous water vapor. Think of heating up a pot of water on the stove. Once the liquid water becomes hot enough, it boils and creates steam (or hot water vapor). This process is called “evaporation,” or when a liquid changes to a gas.\n\nA similar process happens at Earth’s surface. As surface temperatures rise, more liquid water evaporates from the land and ocean. Evaporation adds moisture to the air. How much water vapor the air can hold is based on its temperature. Warmer air temperatures can hold more water vapor. The increased moisture in the air leads to more intense rainfall, especially during extreme events.\n\nIn a hurricane, spiraling winds draw moist air toward the center, fueling the towering thunderstorms that surround it. As the air continues to warm due to climate change, hurricanes can hold more water vapor, producing more intense rainfall rates in a storm.\n\nMoreover, according to Knutson, most models show that climate change brings a slight increase in hurricane wind intensity. This change is likely related to warming ocean temperatures and more moisture in the air, both of which fuel hurricanes. While most models show either no change or a decrease in hurricane frequency in a warmer climate, a greater proportion of the storms that form will reach very intense (Category 4 or 5) levels. In other words, while there may be fewer storms, the ones that form have a greater chance of becoming stronger.\n\nScientists continue to research these topics along with other important hurricane metrics, including any potential changes in the speed at which hurricanes move across the ocean, how large storms will get, and where hurricanes will go.\n\nWhat Do Observations Show?\n\nClimate models that help us understand future changes are a key part to the story, but have any changes in hurricane activity already been observed in recent years?\n\nSince the 1980s, the hurricane record has shown a more active period in the North Atlantic Ocean. On average, there have been more storms, stronger hurricanes, and an increase in hurricanes that rapidly intensify. Thus far, most of these increases are from natural climate variations. However, one recent study suggests that the latest increase in the proportion of North Atlantic hurricanes undergoing rapid intensification is a bit too large to be explained by natural variability alone. This could be the beginning of detecting the impact of climate change on hurricanes, the paper states. In contrast, the frequency of hurricanes making U.S. landfall (a subset of North Atlantic hurricanes) has not increased since 1900, despite significant global warming and the heating of the tropical Atlantic Ocean.\n\nOne current focus of hurricane research is “sampling hurricanes by flying into them for more accurate data,” says Shirley Murillo, deputy director of NOAA’s Hurricane Research Division. These higher-quality data are important for improving hurricane model forecasts now and in the future. NOAA partners with NASA to collect measurements of various aspects of hurricanes over time. “NASA weather satellites are a powerful tool for observations, as people cannot fly into every storm to gather data,” Murillo says. Satellites help expand the observational record. With a longer, more detailed record, scientists can detect changes in long-term data trends over time.\n\nThis partnership is also developing the next generation of satellites to further improve hurricane observations for models. Dr. Marangelly Fuentes, meteorologist and program manager for one of NASA’s Earth research contracts, says researchers “run tests with potential new data to see how they would impact the model’s ability to correctly forecast a hurricane.”\n\nFor example, researchers may test to see if more detailed data about the ocean’s surface temperature in front of a storm help to accurately predict its intensity. If they find something useful, they can use this information to inform the design of instruments on future satellites. Then as more data are collected, this will lead to a better understanding of forecasting hurricanes and how they may be impacted by climate change.\n\nWhat Does That Mean for Me?\n\nAnyone who has experienced a hurricane knows how much damage it can cause to life and property. Flooding remains one of the biggest concerns when a hurricane comes ashore, and climate change will likely make that worse. With impacts from climate change (like sea level rise) already happening, the likelihood of a billion-dollar disaster from a hurricane remains very high.", "authors": ["Alicia Cermak", "NASA Science Editorial Team"], "published_date": "2022-06-01T07:00:00-04:00", "top_image": "https://assets.science.nasa.gov/dynamicimage/assets/science/esd/climate/2023/12/westernhemisphere_geos_2019246_lrg.jpeg", "summary": "Thus, trying to determine how climate change will impact hurricanes may seem like an impossible task.\nThese include sophisticated global climate models, scientific understanding of how hurricanes form and evolve, and expanding observational records of past hurricane activity.\nTom Knutson, senior scientist at NOAA’s Geophysical Fluid Dynamics Laboratory, is a leading scientist on hurricanes and climate change.\nThis could be the beginning of detecting the impact of climate change on hurricanes, the paper states.\nFlooding remains one of the biggest concerns when a hurricane comes ashore, and climate change will likely make that worse.", "keywords": ["force", "nature", "changing", "hurricanes", "climate", "hurricane", "change", "water", "air", "models", "storms", "form", "storm", "tropical", "ocean", "data", "global", "intense", "scientists", "rainfall", "moisture", "vapor", "warming", "cyclones", "impact", "increase", "research", "atlantic", "satellites", "increased", "surge", "frequency", "large", "intensity", "ingredients"], "success": true, "error": null}}