{"timestamp": 1760321907.29615, "data": [{"title": "WATCH: Illinois governor responds to Trump's call to jail Democratic leaders", "description": "Illinois Gov. JB Pritzker responded after President Donald Trump called for his jailing in a social media post claiming Pritzker and Chicago Mayor Brandon Johnson have failed to protect ICE officers.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Rabbi reflects on Oct. 7 annive… [+4426 chars]", "url": "https://abcnews.go.com/US/video/illinois-governor-responds-trumps-call-jail-democratic-leaders-126343677", "source": "ABC News", "published_at": "2025-10-08T20:21:02Z", "relevance_score": 0.6599999999999999}, {"title": "Trump calls to jail Chicago mayor, Illinois governor in immigration dispute", "description": "Trump slams Chicago mayor and Illinois governor resisting his mass deportation campaign as US troops arrive in state.", "content": "United States President Donald Trump called for the jailing of Democratic officials in Illinois resisting his mass deportation campaign, a day after armed troops from Texas arrived in the state to bo… [+3623 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/trump-calls-to-jail-chicago-mayor-illinois-governor-in-immigration-dispute", "source": "Al Jazeera English", "published_at": "2025-10-08T21:28:36Z", "relevance_score": 0.655}, {"title": "US National Guard troops arrive in Illinois as Trump escalates crackdown", "description": "Troops arrive despite active legal challenges from Chicago and the state of Illinois in the courts.", "content": "National Guard troops from Texas have arrived in the US state of Illinois, ahead of a planned deployment to Chicago that is strongly opposed by local officials.\r\nThe arrival of the troops on Tuesday … [+4687 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/us-national-guard-troops-arrive-in-illinois-as-trump-escalates-crackdown", "source": "Al Jazeera English", "published_at": "2025-10-07T22:56:37Z", "relevance_score": 0.615}, {"title": "Illinois lawsuit seeks to block Trump sending National Guard to Chicago", "description": "State accuses Trump of 'unlawful and unconstitutional' use of National Guard in latest effort to stop deployment.", "content": "Illinois has become the latest state to launch legal action in hopes of blocking United States President Donald Trump from deploying the National Guard.\r\nThe lawsuit filed on Monday by Illinois Attor… [+3015 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/illinois-lawsuit-seeks-to-block-trump-sending-national-guard-to-chicago", "source": "Al Jazeera English", "published_at": "2025-10-06T17:15:56Z", "relevance_score": 0.5650000000000001}, {"title": "Illinois files lawsuit to block deployment of National Guard", "description": "The state of Illinois and city of Chicago filed a lawsuit Monday morning seeking to block President Trump's federalization and deployment of the National Guard.", "content": "The state of Illinois and city of Chicago filed a lawsuit Monday morning seeking to block President Donald Trump's federalization and deployment of the National Guard. \r\n\"The American people, regardl… [+286 chars]", "url": "https://abcnews.go.com/US/illinois-files-lawsuit-block-deployment-national-guard/story?id=126253079", "source": "ABC News", "published_at": "2025-10-06T14:26:08Z", "relevance_score": 0.54}, {"title": "Is Donald Trump trying to dial back tensions with Brazil?", "description": "Trump's 50 percent tariffs on Brazil have strained ties. But experts say he might be smelling the coffee - literally.", "content": "Brazilian President Luiz Inacio Lula da Silva asked United States President Donald Trump to lift the 40 percent additional trade tariff imposed by the US government on Brazilian imports, in a phone c… [+8065 chars]", "url": "https://www.aljazeera.com/economy/2025/10/7/is-donald-trump-trying-to-dial-back-tensions-with-brazil", "source": "Al Jazeera English", "published_at": "2025-10-07T12:21:16Z", "relevance_score": 0.52}, {"title": "Trump touts 'momentous breakthrough' on Israel-Hamas ceasefire deal", "description": "President Trump took a victory lap on Israel and Hamas agreeing to implement the first phase of his 20-point peace plan, but questions remain about what happens after.", "content": "President Donald Trump, on the cusp of a major diplomatic achievement months in the making, took a victory lap Thursday on the agreement between Israel and Hamas to implement the first phase of his 2… [+3647 chars]", "url": "https://abcnews.go.com/Politics/trump-touts-momentous-breakthrough-israel-hamas-ceasefire-deal/story?id=126360613", "source": "ABC News", "published_at": "2025-10-09T21:04:50Z", "relevance_score": 0.505}, {"title": "Trump: US-Israel ‘very close to making a deal’ on Gaza peace plan", "description": "Donald Trump says a Middle East peace deal is “very close,” while pledging US security guarantees for Gaza.", "content": "NewsFeed\r\nDonald Trump says a Middle East peace deal is very close, pledging US security guarantees for Gaza two years after the war began. American envoys are heading to Egypt for what officials des… [+69 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/7/trump-us-israel-very-close-to-making-a-deal-on-gaza-peace-plan", "source": "Al Jazeera English", "published_at": "2025-10-07T20:36:31Z", "relevance_score": 0.5}, {"title": "Appeals court keeps block on National Guard deployment in Illinois, OKs mobilization", "description": "A federal appeals court is maintaining a block on the Trump administration from deploying federalized National Guard troops anywhere within the state of Illinois.", "content": "A federal appeals court is maintaining a block on the Trump administration from deploying federalized National Guard troops anywhere within the state of Illinois but allowing the federal government t… [+1616 chars]", "url": "https://abcnews.go.com/Politics/appeals-court-block-national-guard-deployment-illinois-oks/story?id=126434734", "source": "ABC News", "published_at": "2025-10-11T21:40:57Z", "relevance_score": 0.5}, {"title": "Israel-Gaza live updates: Egypt to host ceasefire talks with Hamas and Israel", "description": "Hamas responded positively to President Donald Trump's proposal for peace in Gaza, though said more negotiations will be needed before a full agreement can be signed.", "content": "Leaving the White House for the Navys 250th celebration on Sunday, President Donald Trump continued to celebrate his Gaza peace proposal while admitting that negotiations are still ongoing.\r\nThey're … [+1028 chars]", "url": "https://abcnews.go.com/International/live-updates/israel-gaza-live-updates-egypt-host-ceasefire-talks/?id=126242055", "source": "ABC News", "published_at": "2025-10-06T07:35:39Z", "relevance_score": 0.4750000000000001}, {"title": "Trump draws international praise as broker of Israel-Hamas deal", "description": "Israeli President Isaac Herzog thanked Trump \"for his incredible leadership.\"", "content": "LONDON -- World leaders on Thursday issued a wave of statements commending Israel and Hamas for agreeing to the first phase of a ceasefire deal, with many also praising U.S. President Donald Trump fo… [+5096 chars]", "url": "https://abcnews.go.com/International/trump-draws-international-praise-broker-israel-hamas-deal/story?id=126356500", "source": "ABC News", "published_at": "2025-10-09T12:59:40Z", "relevance_score": 0.4750000000000001}, {"title": "Video: Israel strikes Gaza after agreeing Trump ceasefire plan", "description": "Smoke from Israeli attacks were seen rising over Gaza hours after Israel and Hamas agreed to the first phase ceasefire", "content": "NewsFeed\r\nPlumes of smoke from Israeli attacks were seen rising over Gaza hours after Israel and Hamas agreed to the first phase of a ceasefire plan, brokered by Donald Trump.", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/video-israel-strikes-gaza-after-agreeing-trump-ceasefire-plan", "source": "Al Jazeera English", "published_at": "2025-10-09T10:07:03Z", "relevance_score": 0.4750000000000001}, {"title": "Major challenges remain for Gaza and Israel if ceasefire deal rolls out", "description": "There are many questions surrounding the Israel-Hamas ceasefire deal and what it means for the region.", "content": "As U.S. officials and leaders in the Middle East are celebrating the proposed Gaza ceasefire deal between the Israeli government and Hamas but there are still many questions over the timeline and cha… [+2540 chars]", "url": "https://abcnews.go.com/Politics/major-challenges-remain-gaza-israel-ceasefire-deal-rolls/story?id=126360503", "source": "ABC News", "published_at": "2025-10-09T19:01:30Z", "relevance_score": 0.4700000000000001}, {"title": "Is it legal for Trump to put his picture on US Mint dollar coin?", "description": "Trump administration plans $1 coin with Trump's image, breaking norms of avoiding living presidents on currency.", "content": "President Donald Trump appears poised to put his image on both sides of a commemorative $1 coin issued by the United States Mint the countrys manufacturer of legal tender coinage that also produces c… [+7706 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/is-it-legal-for-trump-to-put-his-picture-on-us-mint-dollar-coin", "source": "Al Jazeera English", "published_at": "2025-10-08T10:27:59Z", "relevance_score": 0.4700000000000001}, {"title": "Trump says UFC fight at White House to be staged on his 80th birthday", "description": "US President Donald Trump announces the 'big UFC fight' on the White House grounds will now take place on June 14.", "content": "An Ultimate Fighting Championship (UFC) fight planned at the White House will take place on Donald Trumps 80th birthday, the United States president said, despite the much-hyped event having been pre… [+2247 chars]", "url": "https://www.aljazeera.com/sports/2025/10/6/trump-says-ufc-fight-at-white-house-to-be-staged-on-his-80th-birthday", "source": "Al Jazeera English", "published_at": "2025-10-06T08:15:15Z", "relevance_score": 0.4650000000000001}, {"title": "AstraZeneca agrees to lower drug prices for Medicaid under Trump administration deal", "description": "AstraZeneca has agreed to lower prescription drug costs for Medicaid under a deal with the Trump administration", "content": "WASHINGTON -- WASHINGTON (AP) AstraZeneca on Friday became the second major pharmaceutical manufacturer to announce it had agreed to lower the cost of prescription drugs for Medicaid under a deal str… [+3585 chars]", "url": "https://abcnews.go.com/Politics/wireStory/astrazeneca-agrees-lower-drug-prices-medicaid-trump-administration-126418888", "source": "ABC News", "published_at": "2025-10-10T23:21:40Z", "relevance_score": 0.45000000000000007}, {"title": "Trump predicts Gaza ceasefire talks will go ‘very quickly’", "description": "US President Donald Trump said he believes negotiations involving Israel and Hamas will go “very quickly”.", "content": "NewsFeed\r\nUS President Donald Trump said he believes negotiations involving Israel and Hamas will go very quickly as mediators arrive in Egypt to discuss the details of his 20-point plan to end the G… [+7 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/6/trump-predicts-gaza-ceasefire-talks-will-go-very", "source": "Al Jazeera English", "published_at": "2025-10-06T06:56:36Z", "relevance_score": 0.44999999999999996}, {"title": "US President Trump says Israeli captives to be released from Gaza on Monday", "description": "The US president told reporters that the bodies of Israelis who died in captivity in Gaza are 'being unearthed'.", "content": "Israelis held in Gaza by Hamas and other armed groups are slated to come back on Monday, United States President Donald Trump said, with 20 living captives and the bodies of 28 others who died in cap… [+2296 chars]", "url": "https://www.aljazeera.com/news/2025/10/11/us-president-trump-says-israeli-captives-to-be-released-from-gaza-on-monday", "source": "Al Jazeera English", "published_at": "2025-10-11T02:24:45Z", "relevance_score": 0.44500000000000006}, {"title": "Relief and disbelief greet ceasefire announcement in Israel", "description": "After two years of war on Gaza, Israelis struggle to believe that the conflict may have finally ended.", "content": "Across Israeli society, the reaction to the news of a Gaza ceasefire deal has been almost uniform: Joy.\r\nIn Tel Aviv, the families of those taken captive during the Hamas-led attack on Israel in Octo… [+7057 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/relief-and-disbelief-greet-ceasefire-announcement-in-israel", "source": "Al Jazeera English", "published_at": "2025-10-09T16:27:19Z", "relevance_score": 0.43000000000000005}, {"title": "Why gold’s historic rally is about more than just Trump", "description": "The price of gold has soared 50 percent in 2025. Experts say the 'safe haven' asset is becoming an all-occasions asset.", "content": "The price of gold has soared to a historic high, crossing $4,000 per troy ounce (31.1g) as global investors have flocked to the asset over the past year.\r\nGold futures, which are contracts to buy or … [+5541 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/why-golds-historic-rally-is-about-more-than-just-trump", "source": "Al Jazeera English", "published_at": "2025-10-08T12:04:03Z", "relevance_score": 0.43000000000000005}, {"title": "WATCH: Jared Kushner, Ivanka Trump speak in Israel after ceasefire announcement", "description": "Jared Kushner and Ivanka Trump addressed a crowd gathered in Tel Aviv following the announcement of the ceasefire agreement in Gaza.", "content": "<ul><li>Joe Biden undergoing radiation therapy for prostate cancer treatment\r\n</li><li>Nor'easter develops as East Coast set for impact\r\n</li><li>Official shares new details on deadly explosion in Te… [+4466 chars]", "url": "https://abcnews.go.com/International/video/jared-kushner-ivanka-trump-speak-israel-after-ceasefire-126434451", "source": "ABC News", "published_at": "2025-10-11T19:30:30Z", "relevance_score": 0.42000000000000004}, {"title": "LIVE: Palestinians return to destroyed Gaza homes as Israel ceases fire", "description": "US President Donald Trump says Israeli captives held in Gaza will be released on Monday.", "content": "blinking-dot\r\nLive updatesLive updates, \r\nUS President Donald Trump says Israeli captives held in Gaza will be released on Monday.", "url": "https://www.aljazeera.com/news/liveblog/2025/10/11/live-trump-says-captive-swap-due-monday-as-israel-gaza-ceasefire-unfolds", "source": "Al Jazeera English", "published_at": "2025-10-11T00:00:00Z", "relevance_score": 0.41500000000000004}, {"title": "Homeland Security Sec. Kristi Noem visits ICE facility at center of Portland protests", "description": "Noem met with local law enforcement officials at the ICE facility, according to the Portland Police Bureau.", "content": "Department of Homeland Security Secretary Kristi Noem made a high-profile visit to an Immigration and Customs Enforcement (ICE) facility in Portland on Tuesday amid a legal battle over sending federa… [+4386 chars]", "url": "https://abcnews.go.com/US/kristi-noem-portland-ice-facility/story?id=126312341", "source": "ABC News", "published_at": "2025-10-08T01:35:30Z", "relevance_score": 0.405}, {"title": "Tennessee National Guard to mobilize in Memphis for anti-crime deployment", "description": "Tennessee National Guard units will mobilize in Memphis on Friday as the Trump admin turns to states' citizen-soldiers as an anti-crime measure across the U.S.", "content": "Tennessee National Guard units will mobilize in Memphis on Friday as President Donald Trump's administration turns to states' citizen-soldiers as an anti-crime measure in some of the nation's biggest… [+2016 chars]", "url": "https://abcnews.go.com/US/tennessee-national-guard-mobilize-memphis-anti-crime-deployment/story?id=126379599", "source": "ABC News", "published_at": "2025-10-10T00:04:53Z", "relevance_score": 0.385}, {"title": "What impact has the genocide in Gaza had on US-Israeli relations?", "description": "US President Donald Trump pressed Israel&#039;s prime minister to agree to a ceasefire deal.", "content": "US President Donald Trump pressed Israels prime minister to agree to a ceasefire deal.A ceasefire agreement for Gaza and cautious hope among Palestinians for an end to two years of genocide.\r\nUS Pres… [+383 chars]", "url": "https://www.aljazeera.com/video/inside-story/2025/10/9/what-impact-has-the-genocide-in-gaza-had-on-us-israeli-relations", "source": "Al Jazeera English", "published_at": "2025-10-09T22:00:17Z", "relevance_score": 0.385}, {"title": "Texas National Guard headed to Illinois, as Pritzker decries 'authoritarian march'", "description": "Gov. JB Pritzker accused the president of using troops for political gain.", "content": "As members of the Texas National Guard boarded a plane on Monday, state and city leaders in Illinois were holding a news conference asking them to stay away from Chicago.\r\nIt was not immediately clea… [+2542 chars]", "url": "https://abcnews.go.com/US/texas-national-guard-headed-illinois-gov-pritzker-calls/story?id=126283676", "source": "ABC News", "published_at": "2025-10-07T15:14:25Z", "relevance_score": 0.38000000000000006}, {"title": "Melania Trump touts return of displaced children amid Russia-Ukraine war", "description": "In a brief speech, the US first lady revealed she had an 'open channel' of communication with Russian President Putin.", "content": "Melania Trump, the wife of United States President Donald Trump, has revealed that she was involved in negotiations with the Russian government to return eight children displaced during its invasion … [+6673 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/melania-trump-touts-return-of-displaced-children-amid-russia-ukraine-war", "source": "Al Jazeera English", "published_at": "2025-10-10T19:00:54Z", "relevance_score": 0.38000000000000006}, {"title": "What to know about the proposed Israel-Hamas Gaza ceasefire", "description": "U.S. President Donald Trump's last month proposed a 20-point plan for for a ceasefire in the Gaza Strip ahead of this week's negotiations in Egypt.", "content": "LONDON -- LONDON and TEL AVIV -- Israeli Prime Minister Benjamin Netanyahu will convene his cabinet to discuss the proposed Gaza Strip ceasefire deal on Thursday, with the cabinet and the wider gover… [+3133 chars]", "url": "https://abcnews.go.com/International/israel-hamas-ceasefire-gaza-proposed-deal/story?id=126318216", "source": "ABC News", "published_at": "2025-10-09T11:53:22Z", "relevance_score": 0.38}, {"title": "WATCH: Authorities announce arrest in connection with Palisades fire", "description": "A 29-year-old man has been arrested in connection with the Palisades Fire, which killed a dozen people earlier this year and caused widespread destruction in Los Angeles County, the DOJ announced.", "content": "<ul><li>Man arrested, faces federal charge in connection with Palisades Fire: DOJ\r\n</li><li>James Comey pleads not guilty, trial date set for January\r\n</li><li>US delegation expected to join peace ta… [+4418 chars]", "url": "https://abcnews.go.com/US/video/authorities-announce-arrest-connection-palisades-firev-126335430", "source": "ABC News", "published_at": "2025-10-08T17:26:43Z", "relevance_score": 0.37}, {"title": "Trump live: US courts to examine troop deployments in Chicago, Portland", "description": "US President Donald Trump's troop deployments will be further tested in two court hearings in different US states.", "content": "blinking-dot\r\nLive updatesLive updates, \r\nUS President Donald Trumps National Guard deployments will be tested in two court hearings in different US states, as governors resisting the militarisation … [+57 chars]", "url": "https://www.aljazeera.com/news/liveblog/2025/10/9/trump-live-us-courts-to-examine-troop-deployments-in-chicago-portland", "source": "Al Jazeera English", "published_at": "2025-10-09T14:00:49Z", "relevance_score": 0.35500000000000004}, {"title": "Trump announces Gaza ceasefire deal: What we know and what’s next", "description": "This is the first phase of a 20-point plan announced by Trump last week.", "content": "United States President Donald Trump has announced that Israel and Hamas have agreed on the first phase of a peace framework that aims at a Gaza ceasefire and the release of Israeli captives and Pale… [+6862 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/trump-announces-gaza-ceasefire-deal-what-we-know-and-whats-next", "source": "Al Jazeera English", "published_at": "2025-10-09T05:05:38Z", "relevance_score": 0.35500000000000004}, {"title": "US buys Argentinian pesos, finalises $20bn currency swap, says US Treasury", "description": "Argentina's right-wing President Milei, a close ally of President Trump, faces a critical midterm election this month.", "content": "The administration of United States President Donald Trump has purchased Argentinian pesos and finalised a $20bn currency swap framework with Argentinas central bank in a deal aimed at shoring up the… [+2577 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/us-buys-argentinian-pesos-finalises-20bn-currency-swap-says-us-treasury", "source": "Al Jazeera English", "published_at": "2025-10-09T22:21:03Z", "relevance_score": 0.35500000000000004}, {"title": "Israel-Gaza: Why Is Hamas Recalling Fighters?", "description": "And Israelis and Palestinians wait for the release of hostages and prisoners.", "content": "Available for over a year\r\nToday, we look at the progress of the Trump peace plan for Israel and Gaza as Hamas recalls 7,000 fighters to reassert control over Gaza amid fears of renewed internal viol… [+1309 chars]", "url": "https://www.bbc.co.uk/sounds/play/p0m83h8w", "source": "BBC News", "published_at": "2025-10-11T18:17:00Z", "relevance_score": 0.35000000000000003}, {"title": "Nobel Peace Prize 2025: What are Trump’s credentials, and can he win?", "description": "With the Gaza ceasefire deal, Trump claims to have helped broker peace in eight wars. Do his assertions hold up?", "content": "As the Norwegian Nobel Committee prepares to announce this years winner of the Nobel Peace Prize, one name, one persona hovers over its decision the United States president, Donald Trump.\r\nSince step… [+11807 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/nobel-peace-prize-2025-what-are-trumps-credentials-and-can-he-win", "source": "Al Jazeera English", "published_at": "2025-10-09T10:39:50Z", "relevance_score": 0.35000000000000003}, {"title": "Conservative writer Bari Weiss named editor-in-chief of CBS News", "description": "Appointment of media figure known for pro-Israel, anti-'woke' stances comes as US media firms feel Trump pressure.", "content": "The United States media conglomerate Paramount has announced a deal securing the acquisition of the commentary website Free Press and naming its founder, conservative media figure Bari Weiss, as the … [+2445 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/conservative-writer-bari-weiss-named-editor-in-chief-of-cbs-news", "source": "Al Jazeera English", "published_at": "2025-10-06T15:34:00Z", "relevance_score": 0.34500000000000003}, {"title": "Canada’s Carney makes second White House visit as trade tensions loom", "description": "US's Trump said the two leaders would discuss trade as tariffs weigh on the Canadian economy.", "content": "Canadas Prime Minister Mark Carney is on his second visit to the White House in five months as he deals with increasing pressure to address US tariffs on steel, autos and other goods that are hurting… [+4325 chars]", "url": "https://www.aljazeera.com/economy/2025/10/7/canadas-carney-makes-second-white-house-visit-as-trade-tensions-loom", "source": "Al Jazeera English", "published_at": "2025-10-07T17:43:32Z", "relevance_score": 0.34500000000000003}, {"title": "Trump announces 25 percent tariffs on medium and heavy imported trucks", "description": "It is not clear if countries under trade agreements with the US would also be subjected to this new tariff.", "content": "United States President Donald Trump has said that all medium- and heavy-duty trucks imported into the country will face a 25 percent tariff rate starting November 1, a significant escalation of his … [+2684 chars]", "url": "https://www.aljazeera.com/economy/2025/10/6/trump-announces-25-percent-tariffs-on-medium-and-heavy-imported-trucks", "source": "Al Jazeera English", "published_at": "2025-10-06T20:26:46Z", "relevance_score": 0.32999999999999996}, {"title": "Pam Bondi, DOJ officials caught off guard by Tish James indictment: Sources", "description": "Sources said that Tish James' indictment for alleged fraud came as surprise.", "content": "Attorney General Pam Bondi and other senior leadership of the Justice Department were caught off guard Thursday by news that the Trump-installed U.S. attorney for the Eastern District of Virginia had… [+2409 chars]", "url": "https://abcnews.go.com/US/pam-bondi-doj-officials-caught-off-guard-tish/story?id=126401855", "source": "ABC News", "published_at": "2025-10-10T14:56:49Z", "relevance_score": 0.32}, {"title": "WATCH: The story behind the viral surprise father-daughter wedding dance video", "description": "Marissa Nielsen surprised her dad Greg Wickles by inviting her three older sisters to join in on a father-daughter dance at her wedding.", "content": "<ul><li>Israel's security cabinet approves 1st phase of Israel-Hamas ceasefire agreement\r\n</li><li>Inside Gaza as the 1st step toward a ceasefire unfolds\r\n</li><li>Trump says there will be 'everlasti… [+4642 chars]", "url": "https://abcnews.go.com/GMA/Family/video/story-viral-surprise-father-daughter-wedding-dance-video-126377848", "source": "ABC News", "published_at": "2025-10-09T19:33:49Z", "relevance_score": 0.32}, {"title": "DOJ adds 2 out-of-state attorneys to Comey case ahead of his arraignment", "description": "The DOJ has added two assistant U.S. attorneys from out of state to work on the case against former FBI Director James Comey ahead of Comey's arraignment on Wednesday.", "content": "Ahead of Wednesday's arraignment of former FBI Director James Comey in Virginia, the Department of Justice has added two assistant U.S. attorneys from out of state to work on the case.\r\nTwo prosecuto… [+1418 chars]", "url": "https://abcnews.go.com/US/doj-adds-2-state-attorneys-comey-case-ahead/story?id=126306467", "source": "ABC News", "published_at": "2025-10-07T22:17:58Z", "relevance_score": 0.31}, {"title": "What’s next for the Palestinian resistance movements?", "description": "Donald Trump&#039;s 20-point plan bars any future Gaza role for Hamas or armed groups.", "content": "Donald Trumps 20-point plan bars any future Gaza role for Hamas or armed groups.The first phase of the Gaza ceasefire agreement has come into effect.\r\nPart of US President Donald Trumps 20-point plan… [+583 chars]", "url": "https://www.aljazeera.com/video/inside-story/2025/10/10/what-is-next-for-the-palestinian-resistance-movements", "source": "Al Jazeera English", "published_at": "2025-10-10T19:11:15Z", "relevance_score": 0.31}, {"title": "Melania Trump says she and Putin communicating about children affected by war", "description": "First lady Melania Trump announced that she and Russian President Vladimir Putin have had an \"open channel of communication\" regarding children impacted by the war.", "content": "First lady Melania Trump announced Friday that she and Russian President Vladimir Putin have had an \"open channel of communication\" regarding children impacted by the Russian-Ukraine war.\r\n\"We have a… [+259 chars]", "url": "https://abcnews.go.com/Politics/melania-trump-putin-communicating-children-affected-war/story?id=126397912", "source": "ABC News", "published_at": "2025-10-10T15:15:23Z", "relevance_score": 0.31}, {"title": "US Supreme Court declines to hear Ghislaine Maxwell appeal", "description": "Former girlfriend of convicted sex abuser Jeffrey Epstein is serving a 20-year prison sentence for sex trafficking.", "content": "The United States Supreme Court has rejected an appeal from Ghislaine Maxwell, the imprisoned former girlfriend of Jeffrey Epstein, to have her sex trafficking conviction overturned.\r\nThe top court t… [+2185 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/us-supreme-court-declines-to-hear-ghislaine-maxwell-appeal", "source": "Al Jazeera English", "published_at": "2025-10-06T17:08:16Z", "relevance_score": 0.31}, {"title": "WATCH: Beloved March Madness icon Sister Jean dies at 106", "description": "Sister Jean Dolores Schmidt, the team chaplain for the Loyola University Chicago basketball team who became a national celebrity during the school's 2018 underdog March Madness run, has died at 106.", "content": "<ul><li>Trump threatens 'massive' increase of tariffs on China\r\n</li><li>Multiple dead in 'devastating blast' at explosives manufacturer: Sheriff\r\n</li><li>Kilmar Abrego Garcia's attorneys return to … [+4560 chars]", "url": "https://abcnews.go.com/US/video/beloved-march-madness-icon-sister-jean-dies-106-126411786", "source": "ABC News", "published_at": "2025-10-10T17:56:52Z", "relevance_score": 0.305}, {"title": "Trump quest for Peace Prize falls short...", "description": "The White House is responding bitterly to President Donald Trump being passed over for the Nobel Peace Prize despite efforts from Republicans and world leaders. A White House spokesman said Friday members of “the Nobel Committee proved they place politics ove…", "content": "WASHINGTON (AP) President Donald Trump was passed over for the Nobel Peace Prize on Friday despite jockeying from his fellow Republicans, various world leaders and most vocally himself.\r\nVenezuelan o… [+6165 chars]", "url": "https://apnews.com/article/donald-trump-misses-out-on-nobel-peace-prize-729973788d8953da9af1cbc136232e96", "source": "Associated Press", "published_at": "2025-10-10T11:37:37Z", "relevance_score": 0.29500000000000004}, {"title": "Snubbed by Nobel, Trump to head to Middle East to celebrate Gaza ‘peace’", "description": "White House decries Nobel Committee's decision not to hand Peace Prize to Donald Trump after Gaza ceasefire deal.", "content": "United States President Donald Trump is heading to the Middle East on Sunday as he looks to assert his perceived role as a peacemaker in the region after the Gaza ceasefire deal.\r\nThe visit would com… [+3589 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/snubbed-by-nobel-trump-to-head-to-middle-east-to-celebrate-gaza-peace", "source": "Al Jazeera English", "published_at": "2025-10-10T15:32:15Z", "relevance_score": 0.29000000000000004}, {"title": "Who are the five Nobel Peace Prize judges deciding whether Trump gets it?", "description": "Donald Trump insists he wins the prize, which will be announced on Friday. These five people decide who gets it.", "content": "Five members of Norways Nobel Committee could hold the key to United States President Donald Trumps much-desired moment of glory being named this years winner of the Nobel Peace Prize.\r\nEach year, th… [+13373 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/who-are-the-five-nobel-peace-prize-judges-deciding-whether-trump-gets-it", "source": "Al Jazeera English", "published_at": "2025-10-10T02:15:31Z", "relevance_score": 0.29000000000000004}, {"title": "Will Trump’s Gaza Peace Plan Work?", "description": "Trump urges mediators to “move fast” as key Gaza talks begin.", "content": "Available for over a year\r\nToday, negotiators from Israel and Hamas head to Sharm El-Sheikh in Egypt to start indirect talks over an end to the Israel-Gaza war. \r\nIt appears this is the closest both … [+1659 chars]", "url": "https://www.bbc.co.uk/sounds/play/p0m72zf5", "source": "BBC News", "published_at": "2025-10-06T18:03:00Z", "relevance_score": 0.28500000000000003}, {"title": "Is the US trying to topple Venezuela’s President Nicolas Maduro?", "description": "US military build-up and strikes off coast in recent weeks.", "content": "A United States military build-up and strikes on boats near Venezuela.\r\nPresident Donald Trump says hes targeting drug gangs without presenting evidence.\r\nVenezuelan President Nicolas Maduro says hel… [+328 chars]", "url": "https://www.aljazeera.com/video/inside-story/2025/10/8/is-the-us-trying-to-topple-venezuelas-president-nicolas-maduro", "source": "Al Jazeera English", "published_at": "2025-10-08T21:29:54Z", "relevance_score": 0.28500000000000003}, {"title": "Appeals court lifts order on Portland National Guard, deployment still blocked", "description": "The broader order stopping any state's National Guard deploying still in effect.", "content": "In a move that does not change the situation on the ground in Portland, the Ninth Circuit Court of Appeals has temporarily lifted a lower court's order blocking the deployment of Oregon National Guar… [+1476 chars]", "url": "https://abcnews.go.com/US/appeals-court-lifts-order-portland-national-guard-deployment/story?id=126345146", "source": "ABC News", "published_at": "2025-10-08T21:24:40Z", "relevance_score": 0.275}, {"title": "Trump: Netanyahu ‘more popular today than five days ago’", "description": "US President Donald Trump said Israel’s Benjamin Netanyahu “should be very popular right now”.", "content": "NewsFeed\r\nHes much more popular today than we he was five days ago. US President Donald Trump said Israels Benjamin Netanyahu should be very popular right now because of the US-backed ceasefire, but … [+44 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/trump-netanyahu-more-popular-today-than-five-days", "source": "Al Jazeera English", "published_at": "2025-10-09T17:55:15Z", "relevance_score": 0.26}, {"title": "Netanyahu faces right-wing threat to collapse his government", "description": "Benjamin Netanyahu’s cabinet has voted to accept the Gaza ceasefire deal, despite threats from coalition partners.", "content": "NewsFeed\r\nBenjamin Netanyahus cabinet has voted to accept the Gaza ceasefire deal, despite threats from right-wing coalition partners to bring down his government. Donald Trump, who brokered the deal… [+84 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/10/netanyahu-faces-right-wing-threat-to-collapse-his-government", "source": "Al Jazeera English", "published_at": "2025-10-10T12:30:54Z", "relevance_score": 0.26}, {"title": "Israel-Hamas war: Glimpses of possible peace after 2 years of systematic, brutal war", "description": "The sinews of the conflict have stretched wider in the last year.", "content": "LONDON -- As Israel's military prepared last month to launch its ground offensive into Gaza City, the Israel Defense Forces published a warning about al-Kawthar Tower, a residential high-rise in the … [+10585 chars]", "url": "https://abcnews.go.com/International/after-2-years-israel-hamas-war-systematic-brutal/story?id=126244465", "source": "ABC News", "published_at": "2025-10-07T09:17:04Z", "relevance_score": 0.25}, {"title": "Why is the US military is being deployed in US cities?", "description": "Al Jazeera&#039;s @AlexGatopoulos asks why the focus of the US military appears to be turning inward", "content": "Toggle Play\r\nAs Donald Trump orders more deployments of federal troops to US cities, what's afoot?", "url": "https://www.aljazeera.com/video/project-force-2/2025/10/7/why-is-the-us-military-is-being-deployed-in-us-cities", "source": "Al Jazeera English", "published_at": "2025-10-07T04:32:20Z", "relevance_score": 0.25}, {"title": "WATCH: Trump says Sean 'Diddy' Combs asked him for a pardonvv", "description": "President Donald Trump said that Sean \"Diddy\" Combs has reached out to ask him for a pardon following his conviction on two prostitution-related charges.", "content": "<ul><li>Nova music festival massacre survivor: 'I remember just running for my life'\r\n</li><li>Trump says Sean 'Diddy' Combs asked him for a pardon\r\n</li><li>Government shutdown's impact on air traff… [+4405 chars]", "url": "https://abcnews.go.com/US/video/trump-sean-diddy-combs-asked-pardon-126299891", "source": "ABC News", "published_at": "2025-10-07T16:52:50Z", "relevance_score": 0.245}, {"title": "WATCH: London police dismantle international phone theft gang", "description": "Police in London have made dozens of arrests linked to a criminal gang who are alleged to have smuggled 40,000 stolen mobile phones from the U.K. to China.", "content": "<ul><li>Air traffic control shortages worsen as shutdown drags on\r\n</li><li>James Comey to be arraigned Wednesday\r\n</li><li>Former surgeon generals warn US about RFK Jr.\r\n</li><li>Tropical Storm Jerr… [+4442 chars]", "url": "https://abcnews.go.com/International/video/london-police-dismantle-international-phone-theft-gang-126320757", "source": "ABC News", "published_at": "2025-10-08T11:02:28Z", "relevance_score": 0.24}, {"title": "Trump: Hamas-held captives to be released ‘Monday or Tuesday’", "description": "US President Donald Trump says the Hamas-held captives in Gaza will be released “Monday or Tuesday&quot;.", "content": "NewsFeed\r\nUS President Donald Trump says the Hamas-held captives in Gaza will be released Monday or Tuesday as part of his ceasefire plan creating peace in the Middle East. He added it is time for th… [+71 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/trump-hamas-held-captives-to-be-released-monday-or", "source": "Al Jazeera English", "published_at": "2025-10-09T16:55:55Z", "relevance_score": 0.23500000000000001}, {"title": "Trump pressure key for Gaza deal to be more than ‘another one-phase’ truce", "description": "Analysts stress Trump pressure essential to prevent Netanyahu from disrupting the Gaza ceasefire for political survival.", "content": "Washington, DC, United States  In announcing the Gaza ceasefire deal, Hamas praised United States President Donald Trump in one sentence and called on him to compel Israel to live up to its obligatio… [+6428 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/trump-pressure-key-for-gaza-deal-to-be-more-than-another-one-phase-truce", "source": "Al Jazeera English", "published_at": "2025-10-09T21:28:12Z", "relevance_score": 0.23500000000000001}, {"title": "Can Trump turn a Gaza ceasefire into a lasting peace deal?", "description": "Israel and Hamas have agreed to the first phase of a peace deal", "content": "Available for over a year\r\nThere was an extraordinary moment at White House on Wednesday when, in front of reporters, secretary of state Marco Rubio handed Donald Trump a note that read the words ver… [+2036 chars]", "url": "https://www.bbc.co.uk/sounds/play/p0m7qcbp", "source": "BBC News", "published_at": "2025-10-09T16:32:00Z", "relevance_score": 0.22500000000000003}, {"title": "Trump’s use of the National Guard faces critical legal tests", "description": "In two courthouses on opposite sides of the country, Donald Trump’s attempt to send troops into Democratic-led cities will face a critical legal test on Thursday.", "content": "In two courthouses on opposite sides of the country, Donald Trumps attempt to send troops into Democratic-led cities will face a critical legal test on Thursday.\r\nThe Ninth Circuit Court of Appeals i… [+4123 chars]", "url": "https://abcnews.go.com/Politics/trumps-national-guard-faces-critical-legal-tests/story?id=126354650", "source": "ABC News", "published_at": "2025-10-09T11:21:57Z", "relevance_score": 0.22500000000000003}, {"title": "How an altercation between Mark Sanchez and a truck driver revealed the pressure on the leaders of America’s big cities", "description": "Observers from around the country tuned into Monday’s news conference featuring the Marion County, Indiana, prosecutor and the Indianapolis police chief...", "content": "Observers from around the country tuned into Mondays news conference featuring the Marion County, Indiana, prosecutor and the Indianapolis police chief interested to hear more about the bizarre incid… [+7907 chars]", "url": "https://www.cnn.com/2025/10/07/sport/mark-sanchez-indianapolis-crime-politics", "source": "CNN", "published_at": "2025-10-07T11:14:07Z", "relevance_score": 0.22500000000000003}, {"title": "Zelenskyy urges Trump to broker end to Ukraine war after Gaza deal agreed", "description": "Ukraine's president praises Trump's efforts to secure Gaza ceasefire, says other wars 'can be stopped as well'.", "content": "Ukrainian President Volodymyr Zelenskyy has urged Donald Trump to broker peace in Ukraine like in the Middle East during a phone call, saying if the United States president could stop one war, others… [+3569 chars]", "url": "https://www.aljazeera.com/news/2025/10/11/zelenskyy-urges-trump-to-broker-end-to-ukraine-war-after-gaza-deal-agreed", "source": "Al Jazeera English", "published_at": "2025-10-11T21:05:37Z", "relevance_score": 0.22000000000000003}, {"title": "US Senate fails to curb Trump’s power to strike drug cartels", "description": "Democrats say President Donald Trump does not have the power to use force without the approval of Congress.", "content": "Senate Republicans have voted down a bill that would have curtailed President Donald Trumps use of force against drug cartels after he authorised strikes on boats suspected of engaging in drug traffi… [+2644 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/us-senate-fails-to-curb-trumps-power-to-strike-drug-cartels", "source": "Al Jazeera English", "published_at": "2025-10-09T07:08:06Z", "relevance_score": 0.205}, {"title": "‘Should throw them out of NATO’: Trump blasts Spain over defence spending", "description": "The US president has harboured a months-long feud with Spain after it rejected his call to increase NATO defence funds.", "content": "The meeting was supposed to be the prelude to the purchase of Finnish icebreaker ships.\r\nBut as United States President Donald Trump welcomed Finlands President Alexander Stubb to the Oval Office on … [+3398 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/should-throw-them-out-of-nato-trump-blasts-spain-over-defence-spending", "source": "Al Jazeera English", "published_at": "2025-10-09T23:10:10Z", "relevance_score": 0.205}, {"title": "Trump reveals prescription drug deal with pharmaceutical giant AstraZeneca", "description": "The US president told reporters he didn't think the deal would have been possible without his 100-percent tariff threat.", "content": "United States President Donald Trump has unveiled a second deal with a major pharmaceutical company to offer lower-cost prescription drugs direct to American consumers.\r\nThis time, the agreement conc… [+6058 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/trump-reveals-prescription-drug-deal-with-pharmaceutical-giant-astrazeneca", "source": "Al Jazeera English", "published_at": "2025-10-10T23:41:19Z", "relevance_score": 0.2}, {"title": "Trump appears to reveal another strike on alleged cartel drug boat", "description": "President Donald Trump appeared to reveal Sunday that the U.S. had carried out another strike on an alleged drug cartel boat from Venezuela.", "content": "President Donald Trump appeared on Sunday to reveal the U.S. had conducted another strike on an alleged cartel drug boat as he celebrated the 250th anniversary of the U.S. Navy aboard the aircraft ca… [+2529 chars]", "url": "https://abcnews.go.com/Politics/trump-appears-reveal-strike-alleged-cartel-drug-boat/story?id=126237676", "source": "ABC News", "published_at": "2025-10-06T00:45:40Z", "relevance_score": 0.19}, {"title": "Trump walks back offer to talk to Democrats as government shutdown extends", "description": "US President Donald Trump says Democrats must end the shutdown before talks can start after six days of gridlock.", "content": "US President Donald Trump suggested on Monday that he was ready to negotiate with Democrats over healthcare subsidies to break a deadlock over the continuing government shutdown, before walking back … [+2677 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/trump-walks-back-offer-to-talk-to-democrats-as-government-shutdown-extends", "source": "Al Jazeera English", "published_at": "2025-10-07T03:11:52Z", "relevance_score": 0.19}, {"title": "Trump-appointed prosecutor seeks indictment of New York AG Letitia James: Sources", "description": "A Trump-appointed prosecutor has presented evidence to a grand jury seeking an indictment against New York Attorney General Letitia James, sources tell ABC News.", "content": "New York Attorney General Letitia James has been indicted on at least one count of alleged fraud, becoming the second political figure in a span of just three weeks to face prosecution after Presiden… [+1552 chars]", "url": "https://abcnews.go.com/US/trump-appointed-prosecutor-seeks-indictment-new-york-ag/story?id=126378516", "source": "ABC News", "published_at": "2025-10-09T20:24:19Z", "relevance_score": 0.18}, {"title": "Council seeks more time to name new prosecutor in Georgia election interference case", "description": "The council tasked with naming a prosecutor to replace Fani Willis in Georgia's election interference case against President Trump and others has asked for an extension.", "content": "A day after the trial judge overseeing Georgia's election interference case against President Donald Trump and others set a 14-day deadline for the appointment of a new prosecutor following the dismi… [+2824 chars]", "url": "https://abcnews.go.com/US/council-seeks-time-replace-fani-willis-prosecutor-georgia/story?id=126264300", "source": "ABC News", "published_at": "2025-10-06T21:48:12Z", "relevance_score": 0.175}, {"title": "World reacts to Gaza ceasefire deal announced by Trump", "description": "Leaders and groups around the world celebrate negotiators signing off on first phase of the Gaza ceasefire agreement.", "content": "Israel and Hamas have agreed to the first phase of a ceasefire deal built off United States President Donald Trumps 20-point plan aimed at ending Israels war on Gaza.\r\nThis means that ALL of the Host… [+8491 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/world-reacts-to-gaza-ceasefire-deal-announced-by-trump", "source": "Al Jazeera English", "published_at": "2025-10-09T06:44:00Z", "relevance_score": 0.175}, {"title": "US federal court to weigh Trump’s deployment of National Guard to Chicago", "description": "National Guard troops have already arrived in the Chicago area, as President Trump condemns the city as a 'hellhole'.", "content": "United States President Donald Trumps deployment of the National Guard in Illinois is slated to face legal scrutiny at a pivotal court hearing.\r\nOn Thursday, US District Judge April Perry will hear a… [+3696 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/us-federal-court-to-weigh-trumps-deployment-of-national-guard-to-chicago", "source": "Al Jazeera English", "published_at": "2025-10-09T15:31:22Z", "relevance_score": 0.175}, {"title": "WATCH: President Trump signs proclamation protecting Columbus Day name", "description": "President Trump signed a proclamation protecting the name Columbus Day before hosting a Cabinet meeting on Thursday.", "content": "<ul><li>Israel's security cabinet approves 1st phase of Israel-Hamas ceasefire agreement\r\n</li><li>Inside Gaza as the 1st step toward a ceasefire unfolds\r\n</li><li>Trump says there will be 'everlasti… [+4642 chars]", "url": "https://abcnews.go.com/US/video/president-trump-signs-proclamation-protecting-columbus-day-126379332", "source": "ABC News", "published_at": "2025-10-09T20:22:15Z", "relevance_score": 0.16999999999999998}, {"title": "Trump announces layoffs amid government shutdown, despite legal questions", "description": "Reduction-in-force notifications have gone out to employees in departments including the Treasury and Homeland Security.", "content": "The administration of United States President Donald Trump has announced that it started laying off federal employees as the government shutdown grinds on, despite questions about Trumps legal author… [+4145 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/trump-announces-layoffs-amid-government-shutdown-despite-legal-questions", "source": "Al Jazeera English", "published_at": "2025-10-10T19:46:17Z", "relevance_score": 0.16999999999999998}, {"title": "Increased sick calls from controllers working without pay leads to flight delays", "description": "Controllers are considered essential workers and are exempt from being furloughed during a shutdown.", "content": "A week into the government shutdown, air traffic controller sick calls are beginning to cause delays and cancellations as a number of airport towers and control facilities dont have enough staff to p… [+6012 chars]", "url": "https://abcnews.go.com/US/air-traffic-controllers-working-pay-begin-call-sick/story?id=126289491", "source": "ABC News", "published_at": "2025-10-07T17:42:33Z", "relevance_score": 0.16}, {"title": "Lula asks Trump to lift 40 percent tariff from Brazilian goods", "description": "Trump had imposed a 40% tariff on Brazil in July on top of a 10% earlier even though US has a trade surplus with Brazil.", "content": "Brazilian President Luiz Inacio Lula da Silva has asked United States President Donald Trump to lift the 40 percent tariff imposed by the US government on Brazilian imports.\r\nThe leaders spoke for 30… [+1606 chars]", "url": "https://www.aljazeera.com/economy/2025/10/6/lula-asks-trump-to-lift-40-percent-tariff-from-brazilian-goods", "source": "Al Jazeera English", "published_at": "2025-10-06T17:41:00Z", "relevance_score": 0.16}, {"title": "Trump live: Ex-FBI chief Comey makes first court appearance", "description": "Trump critic James Comey expected to plead not guilty to charges that he made false statements to Congress.", "content": "blinking-dot\r\nLive updatesLive updates, \r\nFormer FBI Director James Comey appears in federal court to face criminal charges, marking the first prosecution by the Justice Department against one of Pre… [+38 chars]", "url": "https://www.aljazeera.com/news/liveblog/2025/10/8/trump-live-ex-fbi-chief-comey-to-make-first-court-appearance", "source": "Al Jazeera English", "published_at": "2025-10-08T14:01:28Z", "relevance_score": 0.15}, {"title": "Trump threatens 'massive' tariffs on China, triggering stock market sell-off", "description": "China imposed limits on rare earth minerals a day earlier.", "content": "President Donald Trump on Friday voiced frustration with what he called China's \"trade hostility,\" threatening to respond with large tariffs on China and to cancel his upcoming meeting with Chinese P… [+1435 chars]", "url": "https://abcnews.go.com/Politics/trump-threatens-massive-tariffs-china-triggering-stock-market/story?id=126405187", "source": "ABC News", "published_at": "2025-10-10T16:50:42Z", "relevance_score": 0.145}, {"title": "Bondi faces grilling from Senate Democrats on DOJ 'weaponization,' Epstein files", "description": "The hearing follows a tumultuous summer for the Department of Justice.", "content": "President Donald Trump's tightening grip over the Justice Department to target his political opponents and lawmakers' increasing calls for the release of more files from federal investigations into d… [+7209 chars]", "url": "https://abcnews.go.com/Politics/democrats-highlight-doj-weaponization-epstein-files-bondis-senate/story?id=126260560", "source": "ABC News", "published_at": "2025-10-07T13:24:23Z", "relevance_score": 0.145}, {"title": "Trump threatens to nix meeting with China’s Xi Jinping over trade tensions", "description": "The US president's announcement comes after China pledged to impose restrictions on the export of rare earth minerals.", "content": "United States President Donald Trump has suggested he may scrap a planned meeting with his Chinese counterpart Xi Jinping this month over questions of technology and trade.\r\nTrump and Xi had been exp… [+3215 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/trump-threatens-to-nix-meeting-with-chinas-xi-jinping-over-trade-tensions", "source": "Al Jazeera English", "published_at": "2025-10-10T17:21:21Z", "relevance_score": 0.145}, {"title": "WATCH: National Guard now on duty in Chicago area despite local opposition", "description": "In two courthouses on opposite sides of the country, President Donald Trump’s attempt to send troops into Democratic-led Chicago and Portland, Oregon, will face a critical legal test on Thursday.", "content": "<ul><li>Trump says there will be 'everlasting peace' in the Middle East\r\n</li><li>Major challenges lie ahead for Gaza, Israel if ceasefire deal rolls out\r\n</li><li>Trump's use of the National Guard f… [+4658 chars]", "url": "https://abcnews.go.com/US/video/national-guard-now-duty-chicago-area-despite-local-126371677", "source": "ABC News", "published_at": "2025-10-09T16:51:57Z", "relevance_score": 0.14}, {"title": "Can US strikes on suspected drug boats off Venezuela be legally justified?", "description": "Tensions rise between the US and Venezuela as Trump ratchets up military, political pressure against Venezuela's Maduro.", "content": "The US militarys recent strikes on boats allegedly transporting drugs near the Venezuelan coast have raised questions about the legality of such actions and heightened fears of a military escalation … [+11576 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/can-us-strikes-on-suspected-drug-boats-off-venezuela-be-legally-justified", "source": "Al Jazeera English", "published_at": "2025-10-06T16:29:36Z", "relevance_score": 0.135}, {"title": "White House reverses Trump claim firings have begun amid gov’t shutdown", "description": "US lawmakers remain at impasse as shutdown stretches into sixth day; White House again threatens layoffs.", "content": "The White House has dialled back US President Donald Trumps claim that federal workers were already being fired amid the ongoing United States government shutdown.\r\nThe backtrack on Monday came as th… [+4159 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/white-house-reverses-trump-claim-firings-have-begun-amid-govt-shutdown", "source": "Al Jazeera English", "published_at": "2025-10-06T21:02:20Z", "relevance_score": 0.13}, {"title": "NY Attorney General Letitia James indicted on fraud charges: Reports", "description": "James had been a target of US President Trump since successfully suing him for overstating his wealth to dupe lenders.", "content": "New York Attorney General Letitia James, a longtime foe of US President Donald Trump, has been indicted for bank fraud, the Reuters news agency has reported, citing a person familiar with the matter,… [+4154 chars]", "url": "https://www.aljazeera.com/economy/2025/10/9/ny-attorney-general-letitia-james-indicted-on-fraud-charges-reports", "source": "Al Jazeera English", "published_at": "2025-10-09T21:36:48Z", "relevance_score": 0.1}, {"title": "WATCH: Speaker Johnson has emotional exchange with a military mom about shutdown", "description": "A military mom confronted House Speaker Johnson on C-SPAN over the lack of a standalone bill to pay troops if the government shutdown extends beyond Oct. 15.", "content": "<ul><li>Israel's security cabinet approves 1st phase of Israel-Hamas ceasefire agreement\r\n</li><li>Inside Gaza as the 1st step toward a ceasefire unfolds\r\n</li><li>Trump says there will be 'everlasti… [+4642 chars]", "url": "https://abcnews.go.com/US/video/speaker-johnson-emotional-exchange-military-mom-shutdown-126379234", "source": "ABC News", "published_at": "2025-10-09T20:22:20Z", "relevance_score": 0.08}, {"title": "WATCH: Dog goes viral for loving mom's music", "description": "A dog has gone viral on social media for loving his professional pianist mom's jazz music.", "content": "<ul><li>Retired 4-star general on Israel-Hamas ceasefire\r\n</li><li>What happens next after a ceasefire between Israel and Hamas?\r\n</li><li>Trump threatens 'massive' increase of tariffs on China\r\n</li… [+4552 chars]", "url": "https://abcnews.go.com/Lifestyle/video/dog-viral-loving-moms-music-126418202", "source": "ABC News", "published_at": "2025-10-10T23:06:55Z", "relevance_score": 0.08}, {"title": "How Affordable Care Act subsidies became a sticking point in the government shutdown", "description": "As the federal government shutdown enters its tenth day, one major health care issue has continued to be a sticking point: insurance subsidies.", "content": "As the federal government shutdown enters its tenth day, one major health care issue has continued to be a sticking point: insurance subsidies.\r\nThe Affordable Care Act (ACA) subsidies, or premium ta… [+6879 chars]", "url": "https://abcnews.go.com/Health/affordable-care-act-subsidies-sticking-point-government-shutdown/story?id=126322841", "source": "ABC News", "published_at": "2025-10-11T09:20:20Z", "relevance_score": 0.07}, {"title": "Maria Corina Machado says her Nobel tells Venezuelans that \"we are not alone\"", "description": "Maria Corina Machado is the leader of the pro-democracy movement in Venezuela, which is under a dictatorship so brutal she has been forced to live in hiding.", "content": "Maria Corina Machado told CBS News on Friday that being awarded the Nobel Peace Prize serves as a message to her fellow Venezuelans that \"we are not alone.\"\r\n\"They have been part of this huge movemen… [+2834 chars]", "url": "https://www.cbsnews.com/news/maria-corina-machado-says-nobel-peace-prize-tells-venezuelans-we-are-not-alone/?ftag=YHF4eb9d17", "source": "CBS News", "published_at": "2025-10-11T00:31:00Z", "relevance_score": 0.07}, {"title": "FLIGHT DELAYS ACROSS COUNTRY", "description": "The impact of the government shutdown hit travelers across the United States  Monday, as air traffic controllers called out sick, closing a control tower and leading to delays at major airports.", "content": "A pilot preparing to take off Monday from Hollywood Burbank Airport in California took the routine step of radioing the air traffic control tower.\r\nBut instead of the usual back-and-forth conversatio… [+7859 chars]", "url": "https://www.cnn.com/2025/10/07/us/government-shutdown-air-travel-hnk", "source": "CNN", "published_at": "2025-10-07T11:07:36Z", "relevance_score": 0.065}, {"title": "Central witness undermines case against James Comey, prosecutors concluded: Sources", "description": "Ex-FBI Director James Comey is set to be arraigned Wednesday, but prosecutors investigating him determined that a central witness would prove \"problematic,\" sources say.", "content": "Federal prosecutors investigating former FBI Director James Comey for allegedly making false statements to Congress determined that a central witness in their probe would prove \"problematic\" and like… [+5466 chars]", "url": "https://abcnews.go.com/US/central-witness-undermines-case-james-comey-prosecutors-concluded/story?id=126311648", "source": "ABC News", "published_at": "2025-10-08T09:19:51Z", "relevance_score": 0.065}, {"title": "WATCH: Air traffic controller shortages amid shutdown lead to canceled flights, delays", "description": "Flight delays and cancellations are climbing as sick calls involving air traffic controllers leave a number of airport towers and control facilities without enough staff to handle all flights.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Man arrested, faces federal cha… [+4400 chars]", "url": "https://abcnews.go.com/US/video/air-traffic-controller-shortages-amid-shutdown-lead-canceled-126339446", "source": "ABC News", "published_at": "2025-10-08T19:08:39Z", "relevance_score": 0.06}, {"title": "WATCH: Farmer finds NASA equipment in neighbor’s wheat field", "description": "A woman in rural West Texas says she was caught by surprise when she spotted a car-sized piece of scientific equipment that was adorned with NASA stickers.", "content": "<ul><li>Joe Biden undergoing radiation therapy for prostate cancer treatment\r\n</li><li>Nor'easter develops as East Coast set for impact\r\n</li><li>Official shares new details on deadly explosion in Te… [+4466 chars]", "url": "https://abcnews.go.com/US/video/farmer-finds-nasa-equipment-neighbors-wheat-field-126431956", "source": "ABC News", "published_at": "2025-10-11T18:25:10Z", "relevance_score": 0.06}, {"title": "WATCH: Kilmar Abrego Garcia's attorneys return to court as deportation saga continues", "description": "Attorneys for Kilmar Abrego Garcia went to court in Maryland on Friday for an evidentiary hearing in which witnesses testified about the steps taken to remove him from the U.S.", "content": "<ul><li>Retired 4-star general on Israel-Hamas ceasefire\r\n</li><li>What happens next after a ceasefire between Israel and Hamas?\r\n</li><li>Trump threatens 'massive' increase of tariffs on China\r\n</li… [+4552 chars]", "url": "https://abcnews.go.com/US/video/kilmar-abrego-garcias-attorneys-return-court-deportation-saga-126418311", "source": "ABC News", "published_at": "2025-10-10T23:06:41Z", "relevance_score": 0.05}, {"title": "Former FBI Director James Comey to make 1st court appearance", "description": "Former FBI Director James Comey will appear in court on Wednesday for the first time since he was indicted last month on charges of lying to Congress.", "content": "Former FBI Director James Comey will appear in court on Wednesday for the first time since he was indicted last month on charges of lying to Congress.\r\nComey's arraignment is scheduled for 10 a.m. ET… [+1739 chars]", "url": "https://abcnews.go.com/Politics/former-fbi-director-james-comey-make-1st-court/story?id=126322951", "source": "ABC News", "published_at": "2025-10-08T13:40:52Z", "relevance_score": 0.045}, {"title": "Russia says prospects for Ukraine peace deal now faded as its war rages on", "description": "Senior official Sergey Ryabkov says 'momentum generated' from the Trump-Putin summit has 'largely been undermined'.", "content": "Russia appears resigned to the collapse of peace efforts for the war it instigated, and prosecutes to this day, in Ukraine following President Vladimir Putins summit with his United States counterpar… [+4095 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/russia-says-prospects-for-ukraine-peace-deal-now-faded-as-its-war-rages-on", "source": "Al Jazeera English", "published_at": "2025-10-08T14:35:19Z", "relevance_score": 0.045}, {"title": "First US flight with third-country deportees arrives in Guatemala", "description": "The flight brought three Hondurans and 56 Guatemalan nationals, according to Guatemala’s IGM migration agency.", "content": "Guatemala has received its first deportation flight from the United States carrying both Guatemalan and foreign immigrants, the countrys migration authority confirmed, as President Donald Trumps admi… [+2416 chars]", "url": "https://www.aljazeera.com/news/2025/10/11/first-us-flight-with-third-country-deportees-arrives-in-guatemala", "source": "Al Jazeera English", "published_at": "2025-10-11T09:19:11Z", "relevance_score": 0.045}, {"title": "Palestinians in Gaza celebrate news of ceasefire deal", "description": "Emotional scenes unfolded as Palestinians in Gaza celebrated the announcement of a Gaza ceasefire deal.", "content": "NewsFeed\r\nEmotional scenes unfolded as Palestinians in Gaza celebrated the announcement by US President Donald Trump that Israel and Hamas have reached an agreement on phase one of a Gaza ceasefire d… [+3 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/palestinians-in-gaza-celebrate-news-of-ceasefire-deal", "source": "Al Jazeera English", "published_at": "2025-10-09T07:25:54Z", "relevance_score": 0.025}, {"title": "John Durham undercut case against James Comey in interview with prosecutors: Sources", "description": "John Durham, who investigated the Russia probe, told prosecutors probing James Comey that had been unable to uncover evidence supporting charges against him, sources say.", "content": "John Durham, the former special counsel who spent nearly four years examining the origins of the FBI investigation into President Donald Trump's 2016 presidential campaign and its alleged ties to Rus… [+7421 chars]", "url": "https://abcnews.go.com/US/special-counsel-john-durham-undercut-case-james-comey/story?id=126164120", "source": "ABC News", "published_at": "2025-10-06T09:04:35Z", "relevance_score": 0.015000000000000003}, {"title": "5 things to know for Oct. 10: Government shutdown, Gaza ceasefire plan, Nobel Peace Prize, Letitia James, Philippines quake", "description": "CNN’s 5 Things AM brings you the news you need to know every morning.", "content": "Travelers waiting in airport security lines across the US will now be met with a new video blaming Democratic lawmakers for the government shutdown. Its a notable departure from standard practice, as… [+5601 chars]", "url": "https://www.cnn.com/2025/10/10/us/5-things-to-know-for-oct-10-government-shutdown-gaza-ceasefire-plan-nobel-peace-prize-letitia-james-philippines-quake", "source": "CNN", "published_at": "2025-10-10T10:35:04Z", "relevance_score": 0.010000000000000002}, {"title": "Consumer sentiment sours as government shutdown threatens economic damage", "description": "The fresh data marked three consecutive months of worsening shopper attitudes.", "content": "Consumer sentiment soured in October as a government shutdown threatens to weaken a wobbly economy beset by an uptick in inflation and a sharp slowdown of hiring, fresh data on Friday showed. The rea… [+334 chars]", "url": "https://abcnews.go.com/Business/consumer-sentiment-sours-government-shutdown-threatens-economic-damage/story?id=126398088", "source": "ABC News", "published_at": "2025-10-10T14:07:45Z", "relevance_score": 0.005000000000000001}, {"title": "Texas National Guard seen at training center in Chicago suburbs", "description": "Members of the Texas National Guard have been seen at an Army Reserve Training Center in the southwest suburbs of Chicago, ABC News has learned.", "content": "Members of the Texas National Guard have been seen at an Army Reserve Training Center in the southwest suburbs of Chicago, ABC News has learned.\r\nTexas Gov. Greg Abbott on Monday shared a photo on so… [+1364 chars]", "url": "https://abcnews.go.com/US/texas-national-guard-training-center-chicago-suburbs/story?id=126320753", "source": "ABC News", "published_at": "2025-10-08T11:15:48Z", "relevance_score": 0.0}]}