{"timestamp": 1760321857.5983071, "data": {"url": "https://abcnews.go.com/Politics/trump-touts-momentous-breakthrough-israel-hamas-ceasefire-deal/story?id=126360613", "title": "Trump touts 'momentous breakthrough' on Israel-Hamas ceasefire deal", "text": "But Trump didn't provide much detail about what comes after phase one.\n\nPresident Donald Trump speaks during a cabinet meeting at the White House, Oct. 9, 2025, in Washington.\n\nPresident Donald Trump speaks during a cabinet meeting at the White House, Oct. 9, 2025, in Washington.\n\nPresident Donald Trump speaks during a cabinet meeting at the White House, Oct. 9, 2025, in Washington.\n\nPresident Donald Trump speaks during a cabinet meeting at the White House, Oct. 9, 2025, in Washington.\n\nPresident Donald Trump, on the cusp of a major diplomatic achievement months in the making, took a victory lap Thursday on the agreement between Israel and Hamas to implement the first phase of his 20-point peace plan.\n\n\"Last night, we reached a momentous breakthrough in the Middle East, something that people said was never going to be done,\" Trump said as he convened his Cabinet for a meeting at the White House.\n\nAccording to the president, all the remaining Israeli hostages will be released Monday or Tuesday. Trump also said he plans to travel to the region soon for a signing ceremony and to potentially speak at the Knesset in Israel.\n\n\"I think it's going to be a lasting peace, hopefully an everlasting peace,\" he said.\n\nBut Trump didn't provide much detail about what happens next, including thornier issues such as what a postwar Gaza will look like for Palestinians or what guarantees are in place to ensure Hamas disarms and Israel does not pick back up its bombing campaign.\n\nTrump said his first priority was getting the hostages back.\n\n\"After that, we'll see,\" he told ABC News Chief White House Correspondent Mary Bruce while taking reporter questions at the Cabinet meeting. \"But they've agreed to things and I think it's going to move along pretty well.\"\n\nPresident Donald Trump speaks during a cabinet meeting at the White House, Oct. 9, 2025, in Washington. Evan Vucci/AP\n\nThe first phase of the ceasefire deal is expected to begin in the coming days with an exchange of Israeli hostages for Palestinian prisoners and the partial withdrawal of Israeli troops from parts of Gaza. The cessation of all fighting by the Israel Defense Forces and Hamas will go into effect after the Israeli government ratifies the deal, according to an Israeli official.\n\nSecretary of State Marco Rubio credited Trump for the agreement, saying it began with the president's trip to the Middle East in May followed by months of intense negotiations. Rubio said talks took a turn last month at the United Nations as Trump and his team met with Arab mediators and partners.\n\n\"One day, perhaps the entire story will be told about the events of yesterday. Suffice it to say, it's not an exaggeration that none of it would have been possible without the president of the United States being involved,\" Rubio said at the Cabinet meeting.\n\nTrump has drawn international praise for his role in brokering the agreement, which comes two years after the devastating war began.\n\nOver 67,000 Palestinians have been killed in the Israel-Hamas war, the Hamas-run Gaza Health Ministry said in a statement on Thursday. More than 1,200 people were killed in Israel on Oct. 7, 2023, when Hamas launched a surprise attack, and about 250 people were kidnapped, according to Israeli officials.\n\nTrump said people in Israel and in Arab countries are celebrating the news.\n\n\"Right now they're dancing in the streets. And so happy. Everybody's happy,\" Trump said on Thursday.\n\nThe optimism, though, comes as further details of Trump's proposed peace deal remain unclear.\n\nPresident Donald Trump speaks alongside Secretary of the Interior Doug Burgum and Secretary of State Marco Rubio during a cabinet meeting in the Cabinet Room of the White House in Washington, October 9, 2025. Jim Watson/AFP via Getty Images\n\nABC News' Bruce pressed Trump on what the second phase will entail and when it would begin.\n\n\"I'm not going to talk about that because you sort of know what phase two is. But we will -- there will be disarming. There will be pullbacks. There'll be a lot of things that are happening,\" Trump responded.\n\nTrump also would not commit when asked if Palestinians will be able to stay in Gaza.\n\n\"Well, they know exactly what we're doing,\" Trump said. \"We're going to create something where people can live. You can't live right now in Gaza. ... It's a horrible situation. Nobody's ever seen anything like it. So, yeah, we're going to create better conditions for people.\"\n\nOn security guarantees for Gaza, Trump said the U.S. would work with \"very wealthy countries\" in the region, but provided no other specifics.\n\n“I think you’re going to see some tremendous countries stepping up and putting up a lot of money,\" Trump said.", "authors": ["Abc News"], "published_date": null, "top_image": "https://i.abcnewsfe.com/a/7e57dbe6-88ac-4a8f-9b24-2bf84ca7b1bf/donald-trump-7-ap-gmh-251009_1760026774211_hpMain_16x9.jpg?w=1600", "summary": "President Donald Trump speaks during a cabinet meeting at the White House, Oct. 9, 2025, in Washington.\nPresident Donald Trump speaks during a cabinet meeting at the White House, Oct. 9, 2025, in Washington.\nPresident Donald Trump speaks during a cabinet meeting at the White House, Oct. 9, 2025, in Washington.\nPresident Donald Trump speaks during a cabinet meeting at the White House, Oct. 9, 2025, in Washington.\nPresident Donald Trump speaks during a cabinet meeting at the White House, Oct. 9, 2025, in Washington.", "keywords": ["meeting", "house", "white", "trump", "donald", "ceasefire", "breakthrough", "going", "deal", "cabinet", "israeli", "israelhamas", "speaks", "momentous", "oct", "touts"], "success": true, "error": null}}