{"timestamp": 1760318263.633722, "data": {"url": "https://www.cbsnews.com/news/bill-nye-protests-nasa-budget-cut-the-takeout/", "title": "Bill Nye warns U.S. could \"cede leadership to other countries\" if NASA budget is cut", "text": "Bill Nye and hundreds of others gathered at Capitol Hill on Monday to protest against the Trump administration's proposed budget cuts to NASA, arguing that Congress has an obligation to promote the progress of science.\n\n\"The United States would cede leadership to other countries, especially [the] China National Space Administration,\" if funding to NASA Science is cut, Nye said. In an interview on \"The Takeout\" following the protest, Nye argued NASA's budget is just \"a sliver of the pie\" of the nearly $1.7 trillion federal budget.\n\n\"It's barely the width of the pie cutter, it's less than 0.1% of the federal budget and the return is extraordinary,\" he told CBS News' Major Garrett.\n\nA White House budget proposal issued earlier this year would see NASA's funding cut by about 25% for fiscal year 2026, from about $24 billion to $18.8 billion.\n\nNye, the CEO of Planetary Society and former host of \"Bill Nye the Science Guy,\" and around 300 space advocates said Monday that dozens of missions would be at risk — including NASA's Perseverance Mars rover and the Artemis program, which aims to return humans to the moon for the first time in half a century — if the cuts are approved by Congress.\n\nDespite the proposed cuts, NASA's acting administrator, Sean Duffy, said last month as he introduced a new class of 10 NASA astronaut candidates that there's a possibility one of them could be among the first Americans to put their boots on Mars. However, flights are not yet on the drawing board, and most experts say no such NASA mission is likely to launch within the next decade, and probably longer.\n\nDuffy also said he was confident the U.S. would beat China and win the second space race back to the moon.\n\nReferring to the recent news of Mars rover Perseverance uncovering rocks that may hold potential signs of ancient microscopic life, Nye said a NASA budget cut would put the U.S. behind as China plans to launch its sample-return mission in 2028, possibly bringing back samples in 2033.\n\n\"Everybody, understand that if we were to find evidence of life on another world, it would change the course of human history,\" he added. \"So you say, 'Well, how much does that cost?' We're not sure. We've never done it.\"\n\nThe 69-year-old science advocate said investing in NASA is \"priceless,\" telling Garrett: \"NASA also, objectively, every dollar that goes into NASA Science comes back at least a factor of three times, so if you put $1 into NASA Science, you're going to get $3 back into the economy.\"\n\n\"Global positioning, situational awareness ... digital cameras, mobile phones — everything is a result of exploring the cosmos,\" Nye added.", "authors": ["Kiki", "News Editor", "Kiki Intarasuwan Is A News Editor For Cbs News", "Read Full Bio", "William"], "published_date": null, "top_image": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/06/63e2edd1-a8d7-415e-8b41-3d7d3d578ef0/thumbnail/1200x630/bbf52d29f9f2ff0a9411abc832fcb14a/screenshot-2025-10-06-at-6-08-23-pm.png", "summary": "Bill Nye and hundreds of others gathered at Capitol Hill on Monday to protest against the Trump administration's proposed budget cuts to NASA, arguing that Congress has an obligation to promote the progress of science.\n\"The United States would cede leadership to other countries, especially [the] China National Space Administration,\" if funding to NASA Science is cut, Nye said.\nIn an interview on \"The Takeout\" following the protest, Nye argued NASA's budget is just \"a sliver of the pie\" of the nearly $1.7 trillion federal budget.\nThe 69-year-old science advocate said investing in NASA is \"priceless,\" telling Garrett: \"NASA also, objectively, every dollar that goes into NASA Science comes back at least a factor of three times, so if you put $1 into NASA Science, you're going to get $3 back into the economy.\"\n\"Global positioning, situational awareness ... digital cameras, mobile phones — everything is a result of exploring the cosmos,\" Nye added.", "keywords": ["nasas", "china", "mars", "countries", "cuts", "cede", "cut", "science", "leadership", "nasa", "budget", "bill", "nye", "warns", "space"], "success": true, "error": null}}