{"timestamp": 1760321912.191523, "data": {"url": "https://www.aljazeera.com/news/2025/10/7/us-national-guard-troops-arrive-in-illinois-as-trump-escalates-crackdown", "title": "US National Guard troops arrive in Illinois as Trump escalates crackdown", "text": "Troops arrive despite active legal challenges from Chicago and the state of Illinois in the courts.\n\nNational Guard troops from Texas have arrived in the US state of Illinois, ahead of a planned deployment to Chicago that is strongly opposed by local officials.\n\nThe arrival of the troops on Tuesday is the latest escalation by the administration of United States President Donald Trump in its crackdown on the country’s third-largest city, and comes despite active legal challenges from Chicago and the state of Illinois making their way through the courts.\n\nThe Guard’s exact mission was not immediately clear, though the Trump administration has an aggressive immigration enforcement operation in Chicago, and protesters have frequently rallied at an immigration building outside the city in Broadview, Illinois.\n\nThe president repeatedly has described Chicago in hostile terms, calling it a “hellhole” of crime, although police statistics show significant drops in most crimes, including homicides.\n\n“If you look at Chicago, Chicago is a great city where there’s a lot of crime, and if the governor can’t do the job, we’ll do the job,” Trump said on Tuesday of his decision to send the National Guard to the city against the wishes of state leadership. “It’s all very simple.”\n\nThere were likely “50 murders in Chicago over the last 5, 6, 7 months”, the president has claimed – although, according to government data, Chicago saw a 33 percent reduction in homicides in the first six months of 2025 and a 38 percent reduction in shootings.\n\nTrump has also ordered Guard troops to Portland, Oregon, following earlier deployments to Los Angeles and Washington, DC. In each case, he has done so despite staunch opposition from mayors and governors from the Democratic Party, who say Trump’s claims of lawlessness and violence do not reflect reality.\n\nAdvertisement\n\nA federal judge in September said the Republican-led administration “willfully” broke federal law by putting Guard troops in Los Angeles over protests about immigration raids.\n\nChicago Mayor Brandon Johnson said the president’s strategy is “unconstitutional, it’s illegal and it’s dangerous”.\n\nIllinois and Chicago sued the Trump administration on Monday, seeking to block orders to federalise 300 Illinois Guard troops and send Texas Guard troops to Chicago. During a hearing, US Justice Department lawyers told a federal judge that Texas Guard troops were already in transit to Illinois.\n\nThe judge, April Perry, permitted the deployment to proceed for now, but ordered the US government to file a response by Wednesday.\n\nSeparately, a federal judge in Oregon on Sunday temporarily blocked the administration from sending any troops to police Portland, the state’s largest city.\n\nThe Trump administration has portrayed the cities as war-ravaged and lawless amid its escalation in immigration enforcement.\n\n“These Democrats are, like, insurrectionists, OK?” the president said Tuesday. “They’re so bad for our country. Their policy is so bad for our country.”\n\nOfficials in Illinois and Oregon, however, say military intervention isn’t needed and that federal involvement is inflaming the situation.\n\nIllinois Governor JB Pritzker, a Democrat, accused Trump of intentionally trying to foment violence, which the president could then use to justify further militarisation.\n\n“Donald Trump is using our service members as political props and as pawns in his illegal effort to militarise our nation’s cities,” Pritzker said on Monday.\n\n“There is no insurrection in Portland. No threat to national security,” Democratic Oregon Governor Tina Kotek has said.\n\nWhat is the Insurrection Act, and can Trump invoke it?\n\nWhen speaking to reporters in the Oval Office on Monday, Trump made it clear that he’s considering invoking the Insurrection Act to clear the way for him to send soldiers to US cities.\n\n“We have an Insurrection Act for a reason. If I had to enact it, I’d do that,” Trump said on Monday.\n\nThe federal law dates back to 1807 and gives the US president the power to deploy the military or federalise National Guard troops anywhere in the US to restore order during an insurrection.\n\nConstitutional lawyer Bruce Fein told Al Jazeera that presidential powers under the act apply only in cases of major rebellion, equivalent to the US Civil War, where normal law enforcement and courts can’t function. However, Fein added that it is unclear whether a president’s declaration of insurrection can be challenged in court.\n\nAdvertisement\n\n“Congress, however, could impeach and remove Trump for misuse of the act in Portland,” Fein said, adding that military law obligates personnel to disobey orders that are clearly unlawful.\n\nHe said Trump’s use of the act in Portland would be “clearly illegal” even if it cannot be challenged in court.\n\nThe Insurrection Act has been invoked in response to 30 incidents, according to the Brennan Center for Justice.\n\nThe last time it was invoked was in 1992, in response to riots in Los Angeles by Republican President George HW Bush.", "authors": [], "published_date": "2025-10-07T00:00:00", "top_image": "https://www.aljazeera.com/wp-content/uploads/2025/10/AP25280665815461-1759868765.jpg?resize=1920%2C1440", "summary": "National Guard troops from Texas have arrived in the US state of Illinois, ahead of a planned deployment to Chicago that is strongly opposed by local officials.\nTrump has also ordered Guard troops to Portland, Oregon, following earlier deployments to Los Angeles and Washington, DC.\nIllinois and Chicago sued the Trump administration on Monday, seeking to block orders to federalise 300 Illinois Guard troops and send Texas Guard troops to Chicago.\nDuring a hearing, US Justice Department lawyers told a federal judge that Texas Guard troops were already in transit to Illinois.\nThe Trump administration has portrayed the cities as war-ravaged and lawless amid its escalation in immigration enforcement.", "keywords": ["national", "chicago", "crackdown", "president", "illinois", "trump", "arrive", "troops", "act", "insurrection", "administration", "escalates", "federal", "guard", "portland"], "success": true, "error": null}}