{"timestamp": 1760120737.8073962, "data": [{"title": "Most venomous Indian snakes could become more dangerous due to climate change: Study", "description": "Climate change is pushing venomous snakes into new territories across India, a recent study reveals. This alarming trend threatens vulnerable rural communities, already grappling with high snakebite fatalities and limited healthcare access. Researchers warn t…", "content": "Navratri 2025: Shraddha Kapoor, Alia Bhatt, and other divas' inspired pink ethnic looks for day 9", "url": "https://timesofindia.indiatimes.com/etimes/trending/indias-most-venomous-snakes-are-to-become-more-dangerous-study-warns-how-climate-change-could-make-people-vulnerable/articleshow/124337053.cms", "source": "The Times of India", "published_at": "2025-10-06T12:20:32Z", "relevance_score": 0.3}, {"title": "Inhalers for asthma, COPD are climate change contributors, study finds", "description": "\"These emissions drive global warming, exacerbating the very respiratory conditions inhalers are meant to relieve,\" researchers wrote.", "content": "Inhalers that provide fast-acting treatment for people with certain respiratory conditions are contributing to greenhouse gas emissions, which can worsen both climate change and the conditions themse… [+2242 chars]", "url": "https://www.cbsnews.com/news/inhalers-produce-carbon-emissions-study/", "source": "CBS News", "published_at": "2025-10-07T20:58:55Z", "relevance_score": 0.25}, {"title": "The biggest pension fund puts impact investing on the agenda", "description": "Japan's largest pension fund is considering impact investing. This decision is influencing other Japanese money managers. The government supports this strategy to address national challenges. These include an aging society and gender inequality. Impact invest…", "content": "A decision by Japan's $1.8 trillion pension fund, the world's biggest, to consider a shift into impact investing has triggered a wider adjustment among the country's money managers.The Government Pen… [+1868 chars]", "url": "https://economictimes.indiatimes.com/markets/stocks/news/the-biggest-pension-fund-puts-impact-investing-on-the-agenda/articleshow/124328218.cms", "source": "The Times of India", "published_at": "2025-10-06T00:45:59Z", "relevance_score": 0.155}, {"title": "The impact of the war in Gaza on children", "description": "A child dies every hour in Gaza -- young lives cut short, and others forever changed by catastrophic injuries and loved ones dying. Debora Patta reports.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/the-impact-of-the-war-in-gaza-on-children/", "source": "CBS News", "published_at": "2025-10-08T23:38:00Z", "relevance_score": 0.15}, {"title": "How the government shutdown is impacting the economy and workers", "description": "As the government shutdown continues, federal workers are going without pay. CBS News business analyst Jill Schlesinger breaks down the shutdown's impact on the economy.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/how-the-government-shutdown-is-impacting-the-economy-and-workers/", "source": "CBS News", "published_at": "2025-10-09T13:29:00Z", "relevance_score": 0.15}, {"title": "Prince William opens up about family and future plans for monarchy: \"Change is on my agenda\"", "description": "Prince William opened up on comedian Eugene Levy's Apple travel show, \"The Reluctant Traveler,\" about his wife Kate, his mother, Princess Diana, and changes to the monarchy when he becomes king.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/prince-william-opens-up-about-family-and-future-plans-for-monarchy-change-is-on-my-agenda/", "source": "CBS News", "published_at": "2025-10-03T14:21:00Z", "relevance_score": 0.15}, {"title": "‘Will they change course?’: US Senate in stalemate over government shutdown", "description": "The third day of the US government shutdown has yielded no breakthrough as Democrats and Republicans split on spending.", "content": "Well, the shutdown melodrama continues.\r\nThats how, with the verbal equivalent of a sigh, Senator John Kennedy of Louisiana summed up the third day of the United States government shutdown.\r\nlist of … [+6770 chars]", "url": "https://www.aljazeera.com/news/2025/10/3/will-they-change-course-us-senate-in-stalemate-over-government-shutdown", "source": "Al Jazeera English", "published_at": "2025-10-03T23:44:27Z", "relevance_score": 0.12}, {"title": "Nepal’s leaderless Gen-Z revolution has changed the rules of power", "description": "Rising without a leader, Nepal’s youth broke a cycle of betrayal and showed where power truly lies.", "content": "In the 48 hours that Nepals Gen-Z revolution unfolded, one question echoed across the country: Where is their Lenin? But perhaps that question missed the point. For decades, every Nepali revolution h… [+7949 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/3/nepals-leaderless-gen-z-revolution-has-changed-the-rules-of-power", "source": "Al Jazeera English", "published_at": "2025-10-03T14:50:06Z", "relevance_score": 0.12}, {"title": "Death of a rainmaker: When drought means murder in South Sudan", "description": "For a group of people whose job means life, climate change can spell death.", "content": "Torit, South Sudan Solomon Oture was on the run.\r\nAs a rainmaker, his job was to summon rain the lifeblood of his small farming community through prayer and ritual.\r\nlist of 3 itemsend of list\r\nBut a… [+19086 chars]", "url": "https://www.aljazeera.com/features/2025/10/3/death-of-a-rainmaker-when-drought-means-murder-in-south-sudan", "source": "Al Jazeera English", "published_at": "2025-10-03T06:52:57Z", "relevance_score": 0.06}, {"title": "New Democrat think tank aims to make party take more centrist stances", "description": "Since the November 2024 election, some centrist Democrats have blamed the party's poor performance on progressive stances. A new think tank called the Searchlight Institute is advising Democrats to downplay causes like LGBTQ+ rights and climate change in favo…", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/new-democrat-think-tank-more-centrist-stances/", "source": "CBS News", "published_at": "2025-10-03T23:03:00Z", "relevance_score": 0.06}, {"title": "U.N. food agency to suspend food aid for 750,000 people in Somalia next month", "description": "The U.N. food agency has announced cuts to food assistance for hundreds of thousands in Somalia, where millions face the devastating effects of climate change and severe hunger", "content": "NAIROBI, Kenya -- NAIROBI, Kenya (AP) The U.N. food agency announced on Friday that it is cutting food assistance for hundreds of thousands of people in Somalia, where millions are facing devastating… [+1483 chars]", "url": "https://abcnews.go.com/International/wireStory/food-agency-suspend-food-aid-750000-people-somalia-126177548", "source": "ABC News", "published_at": "2025-10-03T11:58:34Z", "relevance_score": 0.06}, {"title": "Correct this ongoing Himalayan blunder", "description": "Monsoon 2025 has caused widespread destruction in West Bengal, Himachal Pradesh, Uttarakhand, and Assam. Landslides and floods have claimed lives and displaced thousands. Bhutan's Tala hydropower dam overflow adds to flood risks. Climate change and unchecked …", "content": "Monsoon 2025 has unleashed destruction across several states, with West Bengal bearing the latest brunt. In the past few days, devastating landslides and raging floods have struck Darjeeling, Kalimpo… [+1558 chars]", "url": "https://economictimes.indiatimes.com/opinion/et-editorial/correct-this-ongoing-himalayan-blunder/articleshow/124346164.cms", "source": "The Times of India", "published_at": "2025-10-06T17:50:31Z", "relevance_score": 0.06}, {"title": "Sean 'Diddy' Combs begs judge for mercy, apologizes for 'sick' actions ahead of sentencing", "description": "Sean “Diddy” Combs, the hip-hop mogul convicted on interstate prostitution charges, begged a federal judge for mercy during a dramatic sentencing hearing Friday, insisting he has “changed for the better.”“I can’t change the past, but I can change the future,”…", "content": "Sean Diddy Combs, the hip-hop mogul convicted on interstate prostitution charges, begged a federal judge for mercy during a dramatic sentencing hearing Friday, insisting he has changed for the better… [+3958 chars]", "url": "https://www.nbcnews.com/news/us-news/sean-diddy-combs-begs-judge-mercy-apologizes-sick-actions-ahead-senten-rcna235371", "source": "NBC News", "published_at": "2025-10-03T20:28:32Z", "relevance_score": 0.035}, {"title": "What are the cheapest ways to borrow home equity this October?", "description": "Want to leverage your home equity in the cooling rate climate of October 2025? Here are three cheap ways to do so.", "content": "Home equity borrowing doesn't need to break the bank this October now that interest rates are falling again.\r\nPHIL LEO/PM Images/Getty Images\r\nThe interest rate climate is changing again, and with it… [+5200 chars]", "url": "https://www.cbsnews.com/news/what-are-cheapest-ways-borrow-home-equity-october-2025/", "source": "CBS News", "published_at": "2025-10-03T15:52:34Z", "relevance_score": 0.035}, {"title": "RBI policy and GST boost fuel interest in consumption, financial services stocks", "description": "Consumption and financial services stocks are in focus due to recent GST boosts and RBI policy changes. Analysts highlight several stocks, including United Spirits, Aditya Birla Capital, and Axis Bank, which saw above-average rollovers to the October series. …", "content": "Shares in the consumption sector, as well as some financial services companies are expected to remain in focus in the coming weeks, due to the GST boost, as well as RBI’s policy changes announced in … [+4374 chars]", "url": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-policy-and-gst-boost-fuel-interest-in-consumption-financial-services-stocks/articleshow/124280600.cms", "source": "The Times of India", "published_at": "2025-10-03T00:17:53Z", "relevance_score": 0.035}, {"title": "Drier weather threatens India’s tea exports, global supply", "description": "Climate extremes shrink Assam tea harvests, increase costs, reduce exports, and reshape the global industry and prices.", "content": "Under blazing skies at a tea plantation in Indias northeastern state of Assam, worker Kamini Kurmi wears an umbrella fastened over her head to keep her hands free to pluck delicate leaves from the bu… [+3598 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/8/drier-weather-threatens-indias-tea-exports-global-supply", "source": "Al Jazeera English", "published_at": "2025-10-08T10:12:28Z", "relevance_score": 0.03}, {"title": "FLIGHT DELAYS ACROSS COUNTRY", "description": "The impact of the government shutdown hit travelers across the United States  Monday, as air traffic controllers called out sick, closing a control tower and leading to delays at major airports.", "content": "A pilot preparing to take off Monday from Hollywood Burbank Airport in California took the routine step of radioing the air traffic control tower.\r\nBut instead of the usual back-and-forth conversatio… [+7859 chars]", "url": "https://www.cnn.com/2025/10/07/us/government-shutdown-air-travel-hnk", "source": "CNN", "published_at": "2025-10-07T11:07:36Z", "relevance_score": 0.03}, {"title": "Wall Street Week Ahead-Wall Street eyes Washington standoff with stocks near records", "description": "The U.S. government shutdown will capture investor focus next week. Markets hold near record highs, preparing for the earnings season. Few expect the Washington situation to derail the current rally. A data drought could impact Federal Reserve policy decision…", "content": "The U.S. government shutdown tops investors' agenda next week as markets head into the seasonally strong fourth quarter, with equities near record highs bracing for an earnings-season test later this… [+3473 chars]", "url": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-week-ahead-wall-st-eyes-washington-standoff-with-stocks-near-records/articleshow/124302725.cms", "source": "The Times of India", "published_at": "2025-10-04T05:25:37Z", "relevance_score": 0.03}, {"title": "How much does a $15,000 home equity loan cost per month after the Fed cut interest rates?", "description": "A cooler interest rate climate may entice homeowners in need of $15,000 to consider their home equity loan options.", "content": "Recent interest rate cuts may be beneficial for owners considering borrowing home equity now.\r\nRichHobson/Getty Images\r\nIf you're a homeowner in need of extra financing worth around $15,000 or so, yo… [+3853 chars]", "url": "https://www.cbsnews.com/news/how-much-does-15000-home-equity-loan-cost-per-month-fed-cut-interest-rates-october-2025/", "source": "CBS News", "published_at": "2025-10-03T18:27:33Z", "relevance_score": 0.03}, {"title": "What's the mortgage interest rate forecast for October 2025?", "description": "Another Fed rate cut is largely expected for this month, but will it impact mortgage rates? Here's what to consider.", "content": "The mortgage rate forecast this October may be an encouraging one for some homebuyers.\r\nalexsl/Getty Images\r\nMortgage interest rates plunged to a three-year low last month, right before the Federal R… [+4950 chars]", "url": "https://www.cbsnews.com/news/mortgage-interest-rate-forecast-october-2025/", "source": "CBS News", "published_at": "2025-10-06T14:51:03Z", "relevance_score": 0.03}, {"title": "Thune and Johnson on if they take any responsibility for the government shutdown", "description": "House Speaker Mike Johnson and Senate Majority Leader John Thune are standing firm on their position as the government shutdown continues to impact the U.S. CBS News' Nikole Killion and Kelly O'Grady report.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/republican-leaders-remain-firm-on-government-shutdown-position/", "source": "CBS News", "published_at": "2025-10-03T17:54:00Z", "relevance_score": 0.03}, {"title": "Travelers face flight delays as government shutdown compounds air traffic control shortages", "description": "Travelers are feeling the impact of the government shutdown as the stalemate enters its seventh day. Shortages of air traffic controllers have led to delays and cancellations at airpots. CBS News correspondent Shanelle Kaul has more.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/travelers-face-flight-delays-government-shutdown-compounds-air-traffic-control-shortages/", "source": "CBS News", "published_at": "2025-10-07T20:57:00Z", "relevance_score": 0.03}, {"title": "Pudge the cat steals the show at Bowling Green football games", "description": "The football team at Bowling Green State University was down on its luck and in bad need of change, when along came a kitty catalyst. Steve Hartman goes \"On the Road\" for the story.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/pudge-the-cat-steals-the-show-at-bowling-green-football-games/", "source": "CBS News", "published_at": "2025-10-03T23:36:00Z", "relevance_score": 0.03}, {"title": "Senate voting on Democrat, Republican funding bills again as Americans feel government shutdown", "description": "The Senate is expected to vote again on the bills proposed by Republicans and Democrats to fund the government. This comes as the shutdown enters its eighth day and as Americans begin to feel the impact. CBS News' Caitlin Huey-Burns reports.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/senate-voting-on-democrat-republican-funding-bills-again-as-americans-feel-government-shutdown/", "source": "CBS News", "published_at": "2025-10-08T15:31:00Z", "relevance_score": 0.03}, {"title": "U.S. Navy eyes autonomous vessels to revamp fleet", "description": "After years of losing ground to China, American defense startups are now working to change how U.S. military ships are manufactured. Saronic Technologies aims to produce batches of autonomous maritime drones for the U.S. Navy by 2031. Rob Lehman, chief commer…", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/us-navy-eyes-autonomous-vessels-revamp-fleet/", "source": "CBS News", "published_at": "2025-10-06T22:31:00Z", "relevance_score": 0.03}, {"title": "WATCH: Ozzy Osbourne honored with mural made from hundreds of pumpkins", "description": "The late pioneering heavy metal singer Ozzy Osbourne has been honored by a U.K. farm that used hundreds of pumpkins to make a Halloween mural to the Black Sabbath frontman.", "content": "<ul><li>Sean 'Diddy' Combs sentencing hearing gets underway\r\n</li><li>Government shutdown's impact on airport workers, travel\r\n</li><li>Government shutdown delays monthly jobs report\r\n</li><li>Federa… [+4547 chars]", "url": "https://abcnews.go.com/Entertainment/video/ozzy-osbourne-honored-mural-made-hundreds-pumpkins-126187018", "source": "ABC News", "published_at": "2025-10-03T15:48:37Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: House Speaker Johnson says Trump is 'trolling the Democrats' during shutdown", "description": "Speaker Mike Johnson said that President Trump and other Republicans are \"using memes\" to \"point out the absurdity of the Democrats' position\" on social media during the government shutdown.", "content": "<ul><li>A look at government shutdown's potential impact on education, student loans\r\n</li><li>Time running out for Hamas to respond to Trumps Gaza peace plan deadline\r\n</li><li>Sean 'Diddy' Combs se… [+4582 chars]", "url": "https://abcnews.go.com/Politics/video/house-speaker-johnson-trump-trolling-democrats-shutdown-126190308", "source": "ABC News", "published_at": "2025-10-03T17:33:09Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Trump says Sean 'Diddy' Combs asked him for a pardonvv", "description": "President Donald Trump said that Sean \"Diddy\" Combs has reached out to ask him for a pardon following his conviction on two prostitution-related charges.", "content": "<ul><li>Nova music festival massacre survivor: 'I remember just running for my life'\r\n</li><li>Trump says Sean 'Diddy' Combs asked him for a pardon\r\n</li><li>Government shutdown's impact on air traff… [+4405 chars]", "url": "https://abcnews.go.com/US/video/trump-sean-diddy-combs-asked-pardon-126299891", "source": "ABC News", "published_at": "2025-10-07T16:52:50Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Former NFL QB Mark Sanchez facing felony charge after physical altercation", "description": "Former NFL QB Mark Sanchez, who was arrested following a physical altercation this weekend, is now facing a felony charge of battery involving serious bodily injury, prosecutors in Indianapolis said.", "content": "<ul><li>Government shutdown's impact on air traffic controllers\r\n</li><li>Parties no closer to deal to end government shutdown\r\n</li><li>Standoff over National Guard intensifies\r\n</li><li>Medical hel… [+4389 chars]", "url": "https://abcnews.go.com/US/video/former-nfl-qb-mark-sanchez-facing-felony-charge-126288356", "source": "ABC News", "published_at": "2025-10-07T13:12:06Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: US kills 4 alleged narco-terrorists in strike off coast of Venezuela, Hegseth says", "description": "Secretary Pete Hegseth announced Friday that the U.S. ordered a strike on another alleged drug boat that left Venezuela.", "content": "<ul><li>A look at government shutdown's potential impact on education, student loans\r\n</li><li>Protesters clash with federal agents in Chicago as ICE raids continue\r\n</li><li>Hegseth announces anothe… [+4632 chars]", "url": "https://abcnews.go.com/International/video/us-kills-4-alleged-narco-terrorists-strike-off-126198083", "source": "ABC News", "published_at": "2025-10-03T20:01:57Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Near-supermoon lights up American skies", "description": "Time-lapse imagery captured the nearly full moon, a forerunner to the harvest supermoon, rising and setting over U.S. cities.", "content": "<ul><li>Government shutdown's impact on air traffic controllers\r\n</li><li>Parties no closer to deal to end government shutdown\r\n</li><li>Standoff over National Guard intensifies\r\n</li><li>Medical hel… [+4389 chars]", "url": "https://abcnews.go.com/US/video/supermoon-lights-american-skies-126288444", "source": "ABC News", "published_at": "2025-10-07T13:17:22Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Sentencing day for Sean 'Diddy' Combs", "description": "Sean \"Diddy\" Combs returned to a Manhattan courtroom on Friday to be sentenced on two counts of transportation for the purposes of prostitution.", "content": "<ul><li>Sean 'Diddy' Combs sentencing hearing gets underway\r\n</li><li>Government shutdown's impact on airport workers, travel\r\n</li><li>Government shutdown delays monthly jobs report\r\n</li><li>Federa… [+4547 chars]", "url": "https://abcnews.go.com/US/video/sentencing-day-sean-diddy-combs-126186860", "source": "ABC News", "published_at": "2025-10-03T15:47:39Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: UK authorities search for motive in synagogue attack", "description": "Police on Friday identified the two men who were killed in an attack on a synagogue in Manchester, as Britain’s chief rabbi said an “unrelenting wave” of antisemitism lay behind the crime.", "content": "<ul><li>A look at government shutdown's potential impact on education, student loans\r\n</li><li>Time running out for Hamas to respond to Trumps Gaza peace plan deadline\r\n</li><li>Sean 'Diddy' Combs se… [+4582 chars]", "url": "https://abcnews.go.com/International/video/uk-authorities-search-motive-synagogue-attack-126189631", "source": "ABC News", "published_at": "2025-10-03T17:33:28Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Monarch butterfly gets wing transplant, continues migration", "description": "An injured monarch butterfly was able to continue its migration after undergoing a wing transplant at a nature preserve in New York.", "content": "<ul><li>Trump announces hostage, prisoner exchange between Israel and Hamas\r\n</li><li>How much of a role did Trump play in the latest Israel-Hamas peace deal?\r\n</li><li>National Guard troops set to d… [+4684 chars]", "url": "https://abcnews.go.com/US/video/monarch-butterfly-gets-wing-transplant-continues-migration-126352326", "source": "ABC News", "published_at": "2025-10-09T05:57:02Z", "relevance_score": 0.005000000000000001}, {"title": "Nestle quits global alliance on reducing dairy methane emissions", "description": "Food giant Nestle has withdrawn from the Dairy Methane Action Alliance, a global initiative aimed at reducing methane emissions from dairy farming. Despite leaving the alliance, Nestle stated it remains committed to its net-zero targets and will continue work…", "content": "Food group Nestle said on Wednesday it had withdrawn from a global alliance for cutting methane emissions that aims to reduce the impact of dairy farming on global warming.The Dairy Methane Action Al… [+2228 chars]", "url": "https://economictimes.indiatimes.com/news/international/world-news/nestle-quits-global-alliance-on-reducing-dairy-methane-emissions/articleshow/124410065.cms", "source": "The Times of India", "published_at": "2025-10-09T08:56:23Z", "relevance_score": 0.005000000000000001}, {"title": "Appeals court lifts order on Portland National Guard, deployment still blocked", "description": "The broader order stopping any state's National Guard deploying still in effect.", "content": "In a move that does not change the situation on the ground in Portland, the Ninth Circuit Court of Appeals has temporarily lifted a lower court's order blocking the deployment of Oregon National Guar… [+1476 chars]", "url": "https://abcnews.go.com/US/appeals-court-lifts-order-portland-national-guard-deployment/story?id=126345146", "source": "ABC News", "published_at": "2025-10-08T21:24:40Z", "relevance_score": 0.005000000000000001}, {"title": "Robust consumption bulwark against external shocks: FM Sitharaman", "description": "Finance Minister Nirmala Sitharaman affirmed India's economic growth is firmly anchored in robust domestic consumption, blunting external shocks. Addressing the Kautilya Economic Conclave, she emphasized India's strong resilience and evolving economic leverag…", "content": "New Delhi: Finance minister Nirmala Sitharaman Friday said Indias economic growth is firmly anchored in robust domestic consumption that blunts the impact of external shocks, and that its evident res… [+3717 chars]", "url": "https://economictimes.indiatimes.com/news/economy/finance/robust-consumption-bulwark-against-external-shocks-fm-sitharaman/articleshow/124300906.cms", "source": "The Times of India", "published_at": "2025-10-04T00:30:00Z", "relevance_score": 0.005000000000000001}, {"title": "How to find the lowest home equity borrowing rates this October, according to experts", "description": "There are several ways homeowners can secure low home equity borrowing rates, especially now that rates are being cut.", "content": "The home equity borrowing climate is an encouraging one for homebuyers this October.\r\nAndrii Yalanskyi/Getty Images\r\nSeptember brought good news for borrowers. The Federal Reserve conducted its first… [+6057 chars]", "url": "https://www.cbsnews.com/news/how-to-find-lowest-home-equity-borrowing-rates-october-2025-according-to-experts/", "source": "CBS News", "published_at": "2025-10-08T13:19:49Z", "relevance_score": 0.005000000000000001}, {"title": "IRS releases income tax brackets and standard deductions for 2026", "description": "The IRS on Thursday announced adjustments to the federal income tax brackets and standard deductions for 2026.", "content": "The IRS is adjusting the income limits for its federal income tax brackets to account for the impact of inflation, an annual reset that could provide relief for some Americans when they file their ta… [+2021 chars]", "url": "https://www.cbsnews.com/news/irs-new-tax-brackets-2026/", "source": "CBS News", "published_at": "2025-10-09T14:51:24Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Sean 'Diddy' Combs sentenced to 50 months in prison", "description": "Sean Combs sat expressionless in his seat when the judge sentenced him to just over four years in prison Friday for his conviction on two prostitution-related offenses.", "content": "<ul><li>Sean 'Diddy' Combs sentenced to more than 4 years in prison\r\n</li><li>Prince William opens about family, legacy and the future of the royals \r\n</li><li>Trump tells Israel to stop bombing afte… [+4736 chars]", "url": "https://abcnews.go.com/Entertainment/video/sean-diddy-combs-sentenced-50-months-prison-126211133", "source": "ABC News", "published_at": "2025-10-04T10:37:29Z", "relevance_score": 0.0}, {"title": "WATCH: Hamas responds to President Trump's proposal to end Gaza war", "description": "Hamas responded to President Trump's proposal for peace in Gaza, saying it will release all remaining hostages if Israel withdraws from Gaza and \"proper field conditions are met.\"", "content": "<ul><li>Sean 'Diddy' Combs sentenced to more than 4 years in prison\r\n</li><li>Prince William opens about family, legacy and the future of the royals \r\n</li><li>Trump tells Israel to stop bombing afte… [+4736 chars]", "url": "https://abcnews.go.com/International/video/hamas-responds-president-trumps-proposal-end-gaza-war-126211226", "source": "ABC News", "published_at": "2025-10-04T10:37:39Z", "relevance_score": 0.0}, {"title": "WATCH: College freshman lives out his dream of playing football at age 58", "description": "Tom Cillo, a 58-year-old college freshman at Lycoming College in Pennsylvania, is gunning to become the oldest college football player to see the field in more than a decade.", "content": "<ul><li>Shutdown showdown: White House threatens mass layoffs\r\n</li><li>More Americans blame Trump, GOP for shutdown than Democrats: Poll\r\n</li><li>Firefighters battle large fire at Chevron refinery … [+4785 chars]", "url": "https://abcnews.go.com/Sports/video/college-freshman-lives-dream-playing-football-age-58-126163287", "source": "ABC News", "published_at": "2025-10-03T01:50:02Z", "relevance_score": 0.0}, {"title": "WATCH: ICE to conduct immigration enforcement at Super Bowl, Lewandowski says", "description": "ICE agents will be present at Super Bowl LX, according to Corey Lewandowski, former Trump 2016 campaign manager and current special government employee at the Department of Homeland Security.", "content": "<ul><li>Shutdown showdown: White House threatens mass layoffs\r\n</li><li>More Americans blame Trump, GOP for shutdown than Democrats: Poll\r\n</li><li>Firefighters battle large fire at Chevron refinery … [+4785 chars]", "url": "https://abcnews.go.com/US/video/ice-conduct-immigration-enforcement-super-bowl-lewandowski-126175497", "source": "ABC News", "published_at": "2025-10-03T11:09:29Z", "relevance_score": 0.0}, {"title": "WATCH: National Guard now on duty in Chicago area despite local opposition", "description": "In two courthouses on opposite sides of the country, President Donald Trump’s attempt to send troops into Democratic-led Chicago and Portland, Oregon, will face a critical legal test on Thursday.", "content": "<ul><li>Trump says there will be 'everlasting peace' in the Middle East\r\n</li><li>Major challenges lie ahead for Gaza, Israel if ceasefire deal rolls out\r\n</li><li>Trump's use of the National Guard f… [+4658 chars]", "url": "https://abcnews.go.com/US/video/national-guard-now-duty-chicago-area-despite-local-126371677", "source": "ABC News", "published_at": "2025-10-09T16:51:57Z", "relevance_score": 0.0}, {"title": "WATCH: Authorities announce arrest in connection with Palisades fire", "description": "A 29-year-old man has been arrested in connection with the Palisades Fire, which killed a dozen people earlier this year and caused widespread destruction in Los Angeles County, the DOJ announced.", "content": "<ul><li>Man arrested, faces federal charge in connection with Palisades Fire: DOJ\r\n</li><li>James Comey pleads not guilty, trial date set for January\r\n</li><li>US delegation expected to join peace ta… [+4418 chars]", "url": "https://abcnews.go.com/US/video/authorities-announce-arrest-connection-palisades-firev-126335430", "source": "ABC News", "published_at": "2025-10-08T17:26:43Z", "relevance_score": 0.0}, {"title": "WATCH: Supreme Court denies Ghislaine Maxwell appeal", "description": "The Supreme Court has declined to take up the appeal of Maxwell, who was contesting her prosecution and conviction on grounds that the government had violated an agreement made with Jeffrey Epstein before his death.", "content": "<ul><li>Illinois files lawsuit to block deployment of National Guard\r\n</li><li>Trump administration pushes back on order to block National Guard deployment\r\n</li><li>South Carolina judge's house fire… [+4225 chars]", "url": "https://abcnews.go.com/US/video/supreme-court-denies-ghislaine-maxwell-appeal-126257745", "source": "ABC News", "published_at": "2025-10-06T16:04:10Z", "relevance_score": 0.0}, {"title": "WATCH: Hundreds of hikers trapped by blizzard on Mount Everest", "description": "An effort is underway to rescue hundreds of hikers who became trapped on Mount Everest due to an unexpected blizzard.", "content": "<ul><li>Illinois files lawsuit to block deployment of National Guard\r\n</li><li>Trump administration pushes back on order to block National Guard deployment\r\n</li><li>South Carolina judge's house fire… [+4225 chars]", "url": "https://abcnews.go.com/International/video/hundreds-hikers-trapped-blizzard-mount-everest-126258058", "source": "ABC News", "published_at": "2025-10-06T15:53:48Z", "relevance_score": 0.0}, {"title": "WATCH: Air traffic controller shortages amid shutdown lead to canceled flights, delays", "description": "Flight delays and cancellations are climbing as sick calls involving air traffic controllers leave a number of airport towers and control facilities without enough staff to handle all flights.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Man arrested, faces federal cha… [+4400 chars]", "url": "https://abcnews.go.com/US/video/air-traffic-controller-shortages-amid-shutdown-lead-canceled-126339446", "source": "ABC News", "published_at": "2025-10-08T19:08:39Z", "relevance_score": 0.0}, {"title": "WATCH: Ex-FBI Director James Comey pleads not guilty", "description": "Former FBI Director James Comey pleaded not guilty on Wednesday. He is charged with one count of false statements and one count of obstruction of a congressional proceeding.", "content": "<ul><li>James Comey pleads not guilty, trial date set for January\r\n</li><li>US delegation expected to join peace talks between Israel and Hamas\r\n</li><li>Inside Nasser Hospital's malnutrition ward am… [+4405 chars]", "url": "https://abcnews.go.com/US/video/fbi-director-james-comey-pleads-guilty-126330331", "source": "ABC News", "published_at": "2025-10-08T15:28:28Z", "relevance_score": 0.0}, {"title": "WATCH: Melania Trump greets sailors with 'hooyah' at Navy 250 event", "description": "First lady Melania Trump greeted sailors with a \"hooyah\" as she spoke at an event celebrating the U.S. Navy's 250th anniversary in Norfolk, Virginia.", "content": "<ul><li>Democrats and Republicans at a deadlock as shutdown continues\r\n</li><li>Tensions rise amid anti-ICE protests in Chicago\r\n</li><li>Just come to the table and do something to help Americans: Bo… [+4480 chars]", "url": "https://abcnews.go.com/US/video/melania-trump-greets-sailors-hooyah-navy-250-event-126237289", "source": "ABC News", "published_at": "2025-10-05T21:15:20Z", "relevance_score": 0.0}, {"title": "WATCH: Crypto scam almost costs woman her life savings", "description": "The FBI says scams perpetrated using bitcoin ATMs cost Americans nearly $250 million in 2024, more than double the sum from the previous year.", "content": "<ul><li>Major challenges lie ahead for Gaza, Israel if ceasefire deal rolls out\r\n</li><li>Trump's use of the National Guard faces critical legal tests\r\n</li><li>'My kids could die': Mom begs Johnson … [+4641 chars]", "url": "https://abcnews.go.com/US/video/crypto-scam-costs-woman-life-savings-126369926", "source": "ABC News", "published_at": "2025-10-09T15:58:02Z", "relevance_score": 0.0}, {"title": "WATCH: London police dismantle international phone theft gang", "description": "Police in London have made dozens of arrests linked to a criminal gang who are alleged to have smuggled 40,000 stolen mobile phones from the U.K. to China.", "content": "<ul><li>Air traffic control shortages worsen as shutdown drags on\r\n</li><li>James Comey to be arraigned Wednesday\r\n</li><li>Former surgeon generals warn US about RFK Jr.\r\n</li><li>Tropical Storm Jerr… [+4442 chars]", "url": "https://abcnews.go.com/International/video/london-police-dismantle-international-phone-theft-gang-126320757", "source": "ABC News", "published_at": "2025-10-08T11:02:28Z", "relevance_score": 0.0}, {"title": "WATCH: Illinois governor responds to Trump's call to jail Democratic leaders", "description": "Illinois Gov. JB Pritzker responded after President Donald Trump called for his jailing in a social media post claiming Pritzker and Chicago Mayor Brandon Johnson have failed to protect ICE officers.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Rabbi reflects on Oct. 7 annive… [+4426 chars]", "url": "https://abcnews.go.com/US/video/illinois-governor-responds-trumps-call-jail-democratic-leaders-126343677", "source": "ABC News", "published_at": "2025-10-08T20:21:02Z", "relevance_score": 0.0}, {"title": "WATCH: Bystanders help lift helicopter after crash in Sacramento", "description": "New video shows drivers racing to lift a medical helicopter that crashed Monday night on a busy Sacramento highway.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Rabbi reflects on Oct. 7 annive… [+4426 chars]", "url": "https://abcnews.go.com/US/video/bystanders-lift-helicopter-after-crash-sacramento-126343225", "source": "ABC News", "published_at": "2025-10-08T20:13:57Z", "relevance_score": 0.0}, {"title": "Joan Kennedy, first wife of Sen. Edward Kennedy, has died", "description": "The first wife of the late Sen. Edward Kennedy, Joan Kennedy, died Wednesday at the age of 89", "content": "BOSTON -- BOSTON (AP) Joan B. Kennedy, the former wife of Sen. Edward M. Kennedy who endured a long and troubled marriage marked by family tragedies, her husbands infidelities and her own struggles w… [+2087 chars]", "url": "https://abcnews.go.com/US/wireStory/joan-kennedy-wife-sen-edward-kennedy-died-126328284", "source": "ABC News", "published_at": "2025-10-08T14:26:12Z", "relevance_score": 0.0}, {"title": "Australia, Papua New Guinea sign mutual defence treaty", "description": "Pukpuk treaty commits the two neighbours to greater military cooperation, although the text is yet to be released.", "content": "Australias Prime Minister Anthony Albanese and the Prime Minister of Papua New Guinea (PNG) James Marape have signed a mutual defence treaty in Canberra, with the leaders saying the text of the agree… [+2805 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/australia-papua-new-guinea-sign-mutual-defence-treaty", "source": "Al Jazeera English", "published_at": "2025-10-06T03:24:55Z", "relevance_score": 0.0}, {"title": "How Ladakh protest leader Sonam Wangchuk went from Indian hero to ‘traitor’", "description": "Wangchuk, a celebrated innovator, inspired a Bollywood megahit. Now he's being accused of challenging the Indian state.", "content": "New Delhi, India On the night of August 5, 2019, hundreds of Kashmiris were arrested amid a crackdown by Indian security forces that followed the Indian governments decision to strip the region of it… [+15015 chars]", "url": "https://www.aljazeera.com/features/2025/10/7/how-ladakh-protest-leader-sonam-wangchuk-went-from-indian-hero-to-traitor", "source": "Al Jazeera English", "published_at": "2025-10-07T02:53:02Z", "relevance_score": 0.0}, {"title": "Nepal hit by deadly floods after days of heavy monsoon rains", "description": "Disaster officials report at least 47 people killed as landslides and floods wreak havoc.", "content": "Landslides and floods triggered by heavy downpours in Nepal have killed at least 47 people, according to disaster officials.\r\nTorrential downpours have lashed Nepal since Friday, leaving rivers in sp… [+1193 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/6/nepal-hit-by-deadly-floods-after-days-of-heavy-monsoon-rain", "source": "Al Jazeera English", "published_at": "2025-10-06T09:24:36Z", "relevance_score": 0.0}, {"title": "More than 350 trekkers escape blizzard-hit Everest, hundreds still stranded", "description": "Rescued trekkers reach China's Qudang township while 200 others still face treacherous Everest conditions awaiting help.", "content": "Rescuers have guided more than 350 people to safety after they were stranded by blizzard-like conditions on the Tibetan side of Mount Everest, Chinese state media reported on Sunday.\r\nIn total, more … [+2526 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/more-than-350-trekkers-escape-blizzard-hit-everest-hundreds-still-stranded", "source": "Al Jazeera English", "published_at": "2025-10-06T01:01:28Z", "relevance_score": 0.0}, {"title": "US and China provoke sharp fall in global outlook for renewable power", "description": "Lowered support means capacity now expected to grow to no more than 4,600GW by 2030, 900GW lower than 2024 estimate.", "content": "The International Energy Agency (IEA) has scaled back its forecast for renewable power growth to 2030, citing weaker outlooks in the United States and China.\r\nThe Paris-based agency now projects tota… [+2136 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/us-and-china-provoke-sharp-fall-in-global-outlook-for-renewable-power", "source": "Al Jazeera English", "published_at": "2025-10-07T08:37:03Z", "relevance_score": 0.0}, {"title": "Cassie Ventura's lawyer speaks out after Sean 'Diddy' Combs' sentencing", "description": "Cassie Ventura's lawyer shared a statement with ABC News following Sean \"Diddy\" Combs' sentencing.", "content": "Cassie Ventura's lawyer issued a statement on her behalf after Sean \"Diddy\" Combs was sentenced to 50 months in prison on Friday for his conviction on two prostitution-related offenses.\r\nVentura, an … [+2151 chars]", "url": "https://abcnews.go.com/GMA/Culture/cassie-ventura-speaks-after-sean-diddy-combs-sentencing/story?id=126201095", "source": "ABC News", "published_at": "2025-10-03T22:26:49Z", "relevance_score": 0.0}, {"title": "Hundreds of Everest hikers reach safety after snowstorm in Tibetan valley", "description": "Those rescued included guides, yak herders and trekkers, who were trapped in a heavy snowstorm that began on Friday.", "content": "Hundreds of hikers, local guides and yak herders have now reached safety after becoming stranded in freezing temperatures by a heavy snowstorm over the weekend on the east face of Mount Everest in Ti… [+3023 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/hundreds-of-everest-hikers-reach-safety-after-snowstorm-in-tibetan-valley", "source": "Al Jazeera English", "published_at": "2025-10-08T05:03:31Z", "relevance_score": 0.0}, {"title": "Landslide hits bus in northern India, killing 15, as rescue continues", "description": "The bus was travelling on a hilly stretch in Himachal Pradesh when a landslide struck after days of torrential rains.", "content": "At least 15 people have been killed after debris from a massive landslide hit a bus in Indias northern state of Himachal Pradesh, local authorities have said.\r\nThe bus was travelling on a hilly stret… [+2083 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/landslide-hits-bus-in-northern-india-killing-15-as-rescue-continues", "source": "Al Jazeera English", "published_at": "2025-10-08T06:10:21Z", "relevance_score": 0.0}, {"title": "Homeland Security Sec. Kristi Noem visits ICE facility at center of Portland protests", "description": "Noem met with local law enforcement officials at the ICE facility, according to the Portland Police Bureau.", "content": "Department of Homeland Security Secretary Kristi Noem made a high-profile visit to an Immigration and Customs Enforcement (ICE) facility in Portland on Tuesday amid a legal battle over sending federa… [+4386 chars]", "url": "https://abcnews.go.com/US/kristi-noem-portland-ice-facility/story?id=126312341", "source": "ABC News", "published_at": "2025-10-08T01:35:30Z", "relevance_score": 0.0}, {"title": "LeBron James’ surprise ‘decision’ announcement was an ad with Hennessy", "description": "LeBron James had another “decision” to announce. Turns out, it was an ad.\n\n\n\nThe Los Angeles Lakers star teased that he would have something to say Tuesday. The “decision” reference is a nod to how he announced in July 2010 that he was joining the Miami Heat.…", "content": "LeBron James had another decision to announce. Turns out, it was an ad.\r\nThe Los Angeles Lakers star teased that he would have something to say Tuesday. The decision reference is a nod to how he anno… [+2299 chars]", "url": "https://apnews.com/article/lebron-james-decision-nba-ecfcfad6c58717aa0cbd4f3cd6b38bb3", "source": "Associated Press", "published_at": "2025-10-07T17:00:00Z", "relevance_score": 0.0}, {"title": "Tropical Storm Jerry forms in central Atlantic: Where it's heading next", "description": "The storm is following a similar pattern to other tropical systems this season.", "content": "A new tropical storm has formed in the Atlantic Ocean, but it will likely follow the pattern of other storms that have stayed mostly out to sea, forecasts show.\r\nTropical Storm Jerry formed in the ce… [+1823 chars]", "url": "https://abcnews.go.com/US/tropical-storm-jerry-forms-central-atlantic-heading/story?id=126289770", "source": "ABC News", "published_at": "2025-10-07T20:27:00Z", "relevance_score": 0.0}, {"title": "What caused Nepal’s devastating flood damage and how was it contained?", "description": "Karki government has been praised for issuing early warnings and imposing road closures in response to flood forecasts.", "content": "Heavy rains have resulted in severe flooding and landslides in Nepal and Indias eastern Himalayan city of Darjeeling in the past few days.\r\nDozens of people have been killed in landslides in Nepals e… [+9498 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/what-caused-nepals-devastating-flood-damage-and-how-was-it-contained", "source": "Al Jazeera English", "published_at": "2025-10-07T12:08:16Z", "relevance_score": 0.0}, {"title": "UNESCO board backs Egypt’s Khaled el-Enany as its next chief", "description": "The Egyptologist and former minister of antiquities will be the first Arab to lead the UN's cultural organisation.", "content": "The board of the United Nations Educational, Scientific and Cultural Organization (UNESCO) has nominated Egypts Khaled el-Enany, an academic and former minister of tourism and antiquities, as its nex… [+3669 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/unesco-board-backs-egypts-khaled-el-enany-as-its-next-chief", "source": "Al Jazeera English", "published_at": "2025-10-07T06:07:05Z", "relevance_score": 0.0}, {"title": "‘Do you want a player to die on court?’ – Tennis stars wilt in China heat", "description": "Weather conditions have led to player complaints; mercury is likely to rise through to Sunday's Shanghai Masters final.", "content": "Novak Djokovic threw up, Alexander Zverev poured sweat out of his shoe, and Emma Raducanu quit her match with dizziness and the bad news for the worlds top tennis players is that more baking weather … [+4320 chars]", "url": "https://www.aljazeera.com/sports/2025/10/8/do-you-want-a-player-to-die-on-court-tennis-stars-wilt-in-china-heat", "source": "Al Jazeera English", "published_at": "2025-10-08T09:29:03Z", "relevance_score": 0.0}, {"title": "Government shutdown halts data, stokes risk as economy wobbles, experts say", "description": "Federal agencies said they would not release some key data during the shutdown.", "content": "The government shutdown halted the release of key economic data, choking off the flow of information as some experts warn the economy may be slipping toward a recession, some economists told ABC News… [+4310 chars]", "url": "https://abcnews.go.com/Business/government-shutdown-halts-data-stokes-risk-economy-wobbles/story?id=126259604", "source": "ABC News", "published_at": "2025-10-06T17:44:02Z", "relevance_score": 0.0}, {"title": "With Gaza in ruins, will US media name the crime?", "description": "With at least 66,000 Palestinians dead and mounting genocide declarations, will Western media hold Israel accountable?", "content": "The Take\r\nRead moreDespite a United Nations inquiry and multiple human rights organisations finding that Israel is committing genocide in Gaza, Western news outlets are still reluctant to use the ter… [+117 chars]", "url": "https://www.aljazeera.com/video/the-take-2/2025/10/6/aje-onl-glb_gazamediacoverage_av_v2-061025", "source": "Al Jazeera English", "published_at": "2025-10-06T16:58:54Z", "relevance_score": 0.0}, {"title": "Cycling team to drop Israel name after mass pro-Palestinian Vuelta protests", "description": "Israel-Premier Tech cycling team will drop Israeli ties after multiple protests at the Vuelta a Espana race.", "content": "The IsraelPremier Tech cycling team will drop its ties to Israel from the 2026 season, following repeated pro-Palestinian protests against it at the recent Vuelta a Espana bike race.\r\nThe move was an… [+2447 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/cycling-team-to-drop-israel-name-after-mass-pro-palestinian-vuelta-protests", "source": "Al Jazeera English", "published_at": "2025-10-06T22:28:37Z", "relevance_score": 0.0}, {"title": "Homeland Security requests National Guard to be sent to Chicago", "description": "Gov. Pritzker said Trump will send in 300 Guardsman as local tensions escalate.", "content": "Illinois Gov. JB Pritzker said Saturday that despite his repeated rejections for federal mobilization to Chicago, President Donald Trump will send in 300 National Guardsman as tensions between local … [+4289 chars]", "url": "https://abcnews.go.com/US/homeland-security-requests-national-guard-chicago-despite-protests/story?id=126218735", "source": "ABC News", "published_at": "2025-10-04T20:45:45Z", "relevance_score": 0.0}, {"title": "Lula asks Trump to lift 40 percent tariff from Brazilian goods", "description": "Trump had imposed a 40% tariff on Brazil in July on top of a 10% earlier even though US has a trade surplus with Brazil.", "content": "Brazilian President Luiz Inacio Lula da Silva has asked United States President Donald Trump to lift the 40 percent tariff imposed by the US government on Brazilian imports.\r\nThe leaders spoke for 30… [+1606 chars]", "url": "https://www.aljazeera.com/economy/2025/10/6/lula-asks-trump-to-lift-40-percent-tariff-from-brazilian-goods", "source": "Al Jazeera English", "published_at": "2025-10-06T17:41:00Z", "relevance_score": 0.0}, {"title": "Global green energy exceeds coal power for first time ever, study finds", "description": "Energy think tank Ember says a slight drop in global fossil fuel power marks \"a turning point,\" as the U.S. and Europe lag behind by China and India in investment.", "content": "Worldwide solar and wind power generation has outpaced electricity demand this year, and for the first time on record, renewable energies combined generated more power than coal, according to a new a… [+5546 chars]", "url": "https://www.cbsnews.com/news/renewable-energy-exceeds-coal-power-globally-first-time-ember-analysis/", "source": "CBS News", "published_at": "2025-10-08T16:03:00Z", "relevance_score": 0.0}, {"title": "Sean 'Diddy' Combs faces sentencing after conviction on prostitution-related charges", "description": "\"In my life, I have made many mistakes, but I am no longer running from them,\" Combs wrote on Thursday in a letter to the judge overseeing his case.", "content": "After a two-month trial and emotional testimony from dozens of witnesses that resulted in a split verdict, a federal judge is scheduled to sentence Sean \"Diddy\" Combs on Friday morning following his … [+6292 chars]", "url": "https://abcnews.go.com/US/sean-diddy-combs-faces-sentencing-after-conviction-prostitution/story?id=126166910", "source": "ABC News", "published_at": "2025-10-03T10:16:18Z", "relevance_score": 0.0}, {"title": "Football Daily", "description": "Mark Chapman is with Conor Coady, Chris Sutton and Rory Smith for more footballing debate", "content": "Available for 28 days\r\nMark Chapman is joined by Conor Coady, Chris Sutton and Rory Smith to reflect on more of the weekends football stories.\r\nThe panel discuss Liverpools third successive defeat; a… [+556 chars]", "url": "https://www.bbc.co.uk/sounds/play/p0m73pw3", "source": "BBC News", "published_at": "2025-10-07T12:00:00Z", "relevance_score": 0.0}, {"title": "Activists warn Trump’s Caribbean boat strikes risk regional war", "description": "Human rights groups urge Congress to block unauthorised force as fears of wider Caribbean conflict and chaos grow.", "content": "Washington, DC Dozens of United States-based human rights, faith and policy groups have criticised President Donald Trumps expansion of military operations in the Caribbean, warning that his administ… [+6426 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/activists-warn-trumps-caribbean-boat-strikes-risk-regional-war", "source": "Al Jazeera English", "published_at": "2025-10-08T18:39:23Z", "relevance_score": 0.0}, {"title": "Global protests erupt over Israeli interception of Gaza aid flotilla", "description": "Crowds in Europe, South America and beyond rally to support Gaza, which faces famine after two years of bombardment.", "content": "Worldwide protests have erupted following Israels interception of the Global Sumud Flotilla carrying humanitarian aid to Gaza, with demonstrators demanding stronger sanctions against Israel.\r\nAcross … [+2094 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/3/global-protests-erupt-over-israeli-interception-of-gaza-aid-flotilla", "source": "Al Jazeera English", "published_at": "2025-10-03T08:29:18Z", "relevance_score": 0.0}, {"title": "Everything you need to know about Syria’s first post-Assad elections", "description": "People's Assembly to be chosen by electoral subcommittees in first vote under interim President Ahmed al-Sharaa.", "content": "Syria will select the Peoples Assembly on Sunday in the countrys first elections since the fall of Bashar al-Assads regime in December.\r\nThe elections are a historic moment after more than 50 years o… [+5753 chars]", "url": "https://www.aljazeera.com/news/2025/10/5/everything-you-need-to-know-about-syrias-first-post-assad-elections", "source": "Al Jazeera English", "published_at": "2025-10-05T12:14:33Z", "relevance_score": 0.0}, {"title": "Bear injures 2 in Japanese grocery store, man killed in separate attack", "description": "As Japan faces rising human-bear encounters, an animal trapped in a grocery store injured two men, while a separate reported mauling proved fatal.", "content": "Tokyo — An agitated bear roamed the aisles of a grocery store in central Japan, injuring two men and frightening shoppers, officials said Wednesday, while Japanese media said a man was found dead aft… [+2747 chars]", "url": "https://www.cbsnews.com/news/japan-bear-attack-grocery-store-separate-death-suspected-mauling/", "source": "CBS News", "published_at": "2025-10-08T09:42:11Z", "relevance_score": 0.0}, {"title": "Examining the rise of the anti-science movement", "description": "Critics say Health Secretary Robert F. Kennedy Jr. and the Trump administration have been pushing an anti-science agenda. The new book, \"Science Under Siege,\" argues it's not just the federal government that's putting public health at risk. Co-author and clim…", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/examining-rise-anti-science-movement/", "source": "CBS News", "published_at": "2025-10-08T22:19:00Z", "relevance_score": 0.0}, {"title": "What's a good mortgage interest rate now that the Fed's cutting rates again?", "description": "Mortgage interest rates have been declining all year long. Here's what a \"good\" rate is considered to be right now.", "content": "Mortgage interest rates have declined significantly from where they were at the start of 2025.\r\nsakchai vongsasiripat/Getty Images\r\nIf you've been a prospective homebuyer in recent years, you might b… [+4190 chars]", "url": "https://www.cbsnews.com/news/whats-good-mortgage-interest-rate-october-2025-feds-cutting-rates/", "source": "CBS News", "published_at": "2025-10-09T17:49:40Z", "relevance_score": 0.0}, {"title": "Real Madrid beat Villarreal as Vinicius Jr scores two goals, Mbappe injured", "description": "A Vinicius Jr brace helped Madrid reclaim top spot in La Liga after Kylian Mbappe limped off with an ankle sprain.", "content": "Vinicius Jr scored twice as Real Madrid wrapped up a 3-1 home victory over 10-man Villarreal on Saturday, but lost Kylian Mbappe to injury after the star forward limped off minutes before full-time.\r… [+2142 chars]", "url": "https://www.aljazeera.com/sports/2025/10/5/real-madrid-beat-villarreal-as-vinicius-jr-scores-two-goals-mbappe-injured", "source": "Al Jazeera English", "published_at": "2025-10-05T02:39:54Z", "relevance_score": 0.0}, {"title": "Are internet rumours of a comet hurtling towards Earth true?", "description": "Space agencies say the comet, 3I/ATLAS, poses no danger, despite viral conspiracy claims.", "content": "Rumours across social media platforms that a huge comet is on a collision course with Earth have been circulating, with some users describing it as a major threat to humanity.\r\nOthers are debating ho… [+6433 chars]", "url": "https://www.aljazeera.com/features/2025/10/3/are-internet-rumours-of-a-comet-hurtling-towards-earth-true", "source": "Al Jazeera English", "published_at": "2025-10-03T09:51:51Z", "relevance_score": 0.0}, {"title": "Unplugged: Students speak out about school bans of cellphones", "description": "Most states now have, or are considering, bans of cellphones in public schools. For a generation that grew up with smartphones, being without is a whole new world. Are the bans having their intended effect? Tony Dokoupil talks with high school and college stu…", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/unplugged-students-speak-out-about-school-bans-of-cellphones/", "source": "CBS News", "published_at": "2025-10-05T13:13:00Z", "relevance_score": 0.0}, {"title": "AI chipmaker AMD strikes major deal with OpenAI", "description": "Microchip maker AMD got a huge boost in the race to supply the artificial intelligence revolution. OpenAI, the company behind major AI platform ChatGPT, announced a deal for AMD to provide the AI startup with its high-performance processing chips starting nex…", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/ai-chipmaker-amd-strikes-major-deal-with-openai/", "source": "CBS News", "published_at": "2025-10-07T00:12:00Z", "relevance_score": 0.0}, {"title": "Russia-Ukraine war: List of key events, day 1,323", "description": "Here are the key events from day 1,323 of Russia’s war on Ukraine.", "content": "Here is how things stand on Thursday, October 9, 2025:\r\nFighting\r\n<ul><li>Three people were killed and one injured by Ukrainian shelling in Russias Belgorod region, the local governor said.</li><li>T… [+2614 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/russia-ukraine-war-list-of-key-events-day-1323", "source": "Al Jazeera English", "published_at": "2025-10-09T01:37:03Z", "relevance_score": 0.0}, {"title": "How much will a $150,000 HELOC cost monthly now that the Fed's cutting interest rates?", "description": "With an interest rate cut just issued and others looming for this year, here's what a $150,000 HELOC costs now.", "content": "HELOC costs are set to decline further now that the Federal Reserve is cutting interest rates again.\r\nGetty Images/iStockphoto\r\nWithdrawing $150,000 out of your hard-earned home equity may not be a d… [+4157 chars]", "url": "https://www.cbsnews.com/news/how-much-150000-heloc-cost-monthly-october-2025-fed-cutting-interest-rates/", "source": "CBS News", "published_at": "2025-10-06T19:51:37Z", "relevance_score": 0.0}, {"title": "Russia-Ukraine war: List of key events, day 1,321", "description": "Here are the key events from day 1,321 of Russia’s war on Ukraine.", "content": "Here is how things stand on Tuesday, October 7, 2025:\r\nFighting\r\n<ul><li>The UNs International Atomic Energy Agency (IAEA) said that two rounds of shelling struck around 1.25 km [less than a mile] fr… [+3518 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/russia-ukraine-war-list-of-key-events-day-1321", "source": "Al Jazeera English", "published_at": "2025-10-07T00:54:54Z", "relevance_score": 0.0}, {"title": "Trump announces 25 percent tariffs on medium and heavy imported trucks", "description": "It is not clear if countries under trade agreements with the US would also be subjected to this new tariff.", "content": "United States President Donald Trump has said that all medium- and heavy-duty trucks imported into the country will face a 25 percent tariff rate starting November 1, a significant escalation of his … [+2684 chars]", "url": "https://www.aljazeera.com/economy/2025/10/6/trump-announces-25-percent-tariffs-on-medium-and-heavy-imported-trucks", "source": "Al Jazeera English", "published_at": "2025-10-06T20:26:46Z", "relevance_score": 0.0}, {"title": "Russia expresses full support of Venezuela after US strikes boat near coast", "description": "The US has launched four attacks on the Caribbean region in recent weeks as part of what it says is a war on drugs.", "content": "Russia has condemned a US strike on a boat allegedly carrying illegal drugs off the coast of Venezuela that killed four people on Friday and warned of potential escalation in the entire Caribbean reg… [+3157 chars]", "url": "https://www.aljazeera.com/news/2025/10/5/russia-expresses-full-support-of-venezuela-after-us-strikes-boat-near-coast", "source": "Al Jazeera English", "published_at": "2025-10-05T18:37:08Z", "relevance_score": 0.0}, {"title": "US sanctions Serbia’s main oil supplier controlled by Russia", "description": "Sanctions imposed on NIS in January as part of its crackdown on the Russian energy sector go into force.", "content": "US sanctions on Serbias majority-Russian-owned Petroleum Industry of Serbia (NIS) oil company, which operates the countrys sole refinery, have taken effect after months of delay.\r\nAfter the sanctions… [+3136 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/us-sanctions-serbias-main-oil-supplier-controlled-by-russia", "source": "Al Jazeera English", "published_at": "2025-10-09T12:18:30Z", "relevance_score": 0.0}, {"title": "White House memo says federal workers may not get automatic backpay: Report", "description": "The memo is seen as a pressure tactic on Democrats as the US government shutdown heads into its eighth day.", "content": "The White House is attempting to challenge a legal precedent that grants automatic back pay to hundreds of thousands of furloughed federal workers at the end of a government shutdown, according to me… [+3491 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/white-house-memo-says-federal-workers-may-not-get-automatic-backpay-report", "source": "Al Jazeera English", "published_at": "2025-10-08T04:54:31Z", "relevance_score": 0.0}, {"title": "More Gaza flotilla activists allege mistreatment in Israeli detention", "description": "Activists deported from Israel following their arrest in the aid flotilla to Gaza say they were treated 'like monkeys'.", "content": "International activists deported from Israel after joining an intercepted Gaza aid flotilla have given further accounts of mistreatment by guards during their detention.\r\nThe latest claims made by pa… [+4526 chars]", "url": "https://www.aljazeera.com/news/2025/10/5/more-gaza-flotilla-activists-allege-mistreatment-in-israeli-detention", "source": "Al Jazeera English", "published_at": "2025-10-05T16:26:31Z", "relevance_score": 0.0}, {"title": "US activist from Gaza flotilla alleges ‘psychological torture’ by Israel", "description": "David Adler says Sumud Flotilla activists were 'kidnapped, stripped, zip-tied, blindfolded' and sent to prison camp.", "content": "A United States citizen who was detained by Israel on the Global Sumud Flotilla, which tried to deliver aid to Gaza, says he and other activists endured abuse and psychological torture in Israeli cus… [+4405 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/us-activist-from-gaza-flotilla-alleges-psychological-torture-by-israel", "source": "Al Jazeera English", "published_at": "2025-10-07T18:41:25Z", "relevance_score": 0.0}, {"title": "How tensions with Bangladesh are roiling India’s sari business", "description": "Bangladesh's political turmoil has been mixed bag for the Indian sari industry, hurting some traders and helping others.", "content": "Varanasi, India Mohammed Ahmad Ansari has spent his entire life in the narrow and congested lanes of Varanasi, a city often described as the spiritual capital of India, and the constituency of Indian… [+7110 chars]", "url": "https://www.aljazeera.com/economy/2025/10/4/how-tensions-with-bangladesh-are-roiling-indias-sari-business", "source": "Al Jazeera English", "published_at": "2025-10-04T04:48:34Z", "relevance_score": 0.0}, {"title": "Ray Lewis speaks out on Baltimore Ravens defense, celebrates his nonprofit", "description": "Former Baltimore Ravens linebacker Ray Lewis is celebrating 10 years of his nonprofit and speaking out about the team's defense after a disappointing loss.", "content": "Former Baltimore Ravens linebacker Ray Lewis is celebrating 10 years of his nonprofit, Power52 Foundation. \r\nWhen asked how the milestone of 10 years ranks for the two-time Super Bowl champion, defen… [+2777 chars]", "url": "https://www.cbsnews.com/baltimore/news/ravens-ray-lewis-defense-nonprofit-power52-foundation-video/", "source": "CBS News", "published_at": "2025-10-07T15:53:20Z", "relevance_score": 0.0}, {"title": "Czechs vote in elections that could usher in populist billionaire", "description": "Self-described 'Trumpist' Andrej Babis has campaigned on pledges of welfare and halting military aid to Ukraine.", "content": "Czechs are casting their ballots in a two-day general election, in which the party of populist billionaire Andrej Babis is expected to garner the most votes but not secure a majority, raising concern… [+3544 chars]", "url": "https://www.aljazeera.com/news/2025/10/3/czechs-vote-in-elections-that-could-usher-in-populist-billionaire", "source": "Al Jazeera English", "published_at": "2025-10-03T13:16:00Z", "relevance_score": 0.0}, {"title": "Syria shares results of first parliamentary poll amid inclusivity concerns", "description": "Election marks landmark moment in country’s post-war transition, but vote goes largely to Sunni male representatives.", "content": "Syria has published the results of its first parliamentary election since the government of former President Bashar al-Assad was toppled, revealing that most new members of the revamped Peoples Assem… [+3265 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/syria-declares-results-of-1st-parliamentary-poll-amid-inclusivity-concerns", "source": "Al Jazeera English", "published_at": "2025-10-06T18:48:10Z", "relevance_score": 0.0}]}