{"timestamp": 1760321850.7566679, "data": [{"title": "Israel announces timeline for implementing first phase of peace plan", "description": "A government spokesperson has laid out how Israel will implement the first phase of the peace plan for Gaza.", "content": "NewsFeed\r\nA government spokesperson has laid out how Israel will implement the first phase of US President Donald Trumps peace plan in Gaza, saying it will start after todays Israeli government cabin… [+10 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/israel-announces-timeline-for-implementing-first-phase-of-peace-plan", "source": "Al Jazeera English", "published_at": "2025-10-09T16:15:30Z", "relevance_score": 0.31}, {"title": "What impact has the genocide in Gaza had on US-Israeli relations?", "description": "US President Donald Trump pressed Israel&#039;s prime minister to agree to a ceasefire deal.", "content": "US President Donald Trump pressed Israels prime minister to agree to a ceasefire deal.A ceasefire agreement for Gaza and cautious hope among Palestinians for an end to two years of genocide.\r\nUS Pres… [+383 chars]", "url": "https://www.aljazeera.com/video/inside-story/2025/10/9/what-impact-has-the-genocide-in-gaza-had-on-us-israeli-relations", "source": "Al Jazeera English", "published_at": "2025-10-09T22:00:17Z", "relevance_score": 0.275}, {"title": "LIVE: Israel, Hamas agree on ‘first phase’ of Gaza ceasefire deal", "description": "Gaza ceasefire breakthrough announced on third day of talks in Egypt’s Sharm el-Sheikh.", "content": "blinking-dot\r\nLive updatesLive updates, \r\nGaza ceasefire breakthrough announced on third day of talks in Egypts Sharm el-Sheikh on US President Donald Trumps 20-point peace proposal.", "url": "https://www.aljazeera.com/news/liveblog/2025/10/9/live-israel-hamas-agree-on-first-phase-of-gaza-ceasefire-deal", "source": "Al Jazeera English", "published_at": "2025-10-09T00:00:00Z", "relevance_score": 0.24}, {"title": "Trump touts 'momentous breakthrough' on Israel-Hamas ceasefire deal", "description": "President Trump took a victory lap on Israel and Hamas agreeing to implement the first phase of his 20-point peace plan, but questions remain about what happens after.", "content": "President Donald Trump, on the cusp of a major diplomatic achievement months in the making, took a victory lap Thursday on the agreement between Israel and Hamas to implement the first phase of his 2… [+3647 chars]", "url": "https://abcnews.go.com/Politics/trump-touts-momentous-breakthrough-israel-hamas-ceasefire-deal/story?id=126360613", "source": "ABC News", "published_at": "2025-10-09T21:04:50Z", "relevance_score": 0.19}, {"title": "Israel deports Greta Thunberg and other Gaza flotilla activists", "description": "Among the 161 arriving in Athens, MEP Rima Hassan reports that she was 'beaten' by Israeli police officers.", "content": "Swedish activist Greta Thunberg has arrived in Greece along with 160 other campaigners from the Global Sumud Flotilla, having been deported by Israel.\r\nIsraels Foreign Ministry announced on X on Mond… [+2223 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/greta-thunberg-and-other-activists-deported-from-israel-arrive-in-greece", "source": "Al Jazeera English", "published_at": "2025-10-06T20:03:10Z", "relevance_score": 0.19}, {"title": "Video: Israel strikes Gaza after agreeing Trump ceasefire plan", "description": "Smoke from Israeli attacks were seen rising over Gaza hours after Israel and Hamas agreed to the first phase ceasefire", "content": "NewsFeed\r\nPlumes of smoke from Israeli attacks were seen rising over Gaza hours after Israel and Hamas agreed to the first phase of a ceasefire plan, brokered by Donald Trump.", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/video-israel-strikes-gaza-after-agreeing-trump-ceasefire-plan", "source": "Al Jazeera English", "published_at": "2025-10-09T10:07:03Z", "relevance_score": 0.19}, {"title": "Two years of Israel’s genocide in Gaza: By the numbers", "description": "Israel has killed or injured more than 10 percent of Gaza's population over the past 24 months.", "content": "It has been two years since Israel launched its genocide against Palestinians in Gaza.\r\nIsraels assault on Gaza began on October 7, 2023, in response to attacks on southern Israel by fighters from th… [+9376 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/two-years-of-israels-genocide-in-gaza-by-the-numbers", "source": "Al Jazeera English", "published_at": "2025-10-07T07:31:10Z", "relevance_score": 0.19}, {"title": "Israeli PM Netanyahu thanks Trump and US team for ceasefire role", "description": "Israel’s government has approved “phase one” of the agreement, which will see captives exchanged and Israel withdraw.", "content": "NewsFeed\r\nIsraels government has approved phase one of the agreement, which will see captives exchanged and Israel withdraw from parts of Gaza. Israeli Prime Minister Benjamin Netanyahu thanked Presi… [+91 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/10/israeli-pm-netanyahu-thanks-trump-and-us-team-for-ceasefire-role", "source": "Al Jazeera English", "published_at": "2025-10-10T06:30:18Z", "relevance_score": 0.19}, {"title": "Map of Gaza shows how Israeli forces will withdraw under ceasefire deal", "description": "In the first phase of the ceasefire plan, Israel will remain in control of nearly 60 percent of the Gaza Strip.", "content": "In the early hours of Wednesday morning in Gaza, United States President Donald Trump announced that Hamas and Israel had agreed on the first phase of his ceasefire and captive-exchange plan.\r\nIn a p… [+3937 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/map-of-gaza-shows-how-israeli-forces-will-withdraw-under-ceasefire-deal", "source": "Al Jazeera English", "published_at": "2025-10-09T14:03:02Z", "relevance_score": 0.19}, {"title": "Two years after October 7: Israel’s reckoning", "description": "The Gaza war has lasted two years – are Israel and the US ready to end it now?", "content": "The Take\r\nRead moreTwo years after October 7, talks in Egypt could bring an end to the war in Gaza. Inside Israel, divisions are widening, isolation is deepening, and the cost of war is harder to ign… [+77 chars]", "url": "https://www.aljazeera.com/video/the-take-2/2025/10/7/two-years-after-october-7-israels-reckoning", "source": "Al Jazeera English", "published_at": "2025-10-07T17:19:13Z", "relevance_score": 0.185}, {"title": "Reports: Israel couldn’t wage wars on Gaza, Lebanon Iran without US support", "description": "Twin reports from the Costs of War Project find the US has backed Israel with more than $21bn since October 2023.", "content": "Israel would not have been able to sustain its wars across the Middle East without the United Statess significant financial backing of more than $21bn since October 2023, according to a pair of new r… [+5692 chars]", "url": "https://www.aljazeera.com/features/2025/10/7/reports-israel-couldnt-wage-wars-on-gaza-lebanon-iran-without-us-support", "source": "Al Jazeera English", "published_at": "2025-10-07T05:09:21Z", "relevance_score": 0.185}, {"title": "US army sergeant fired over pro-Palestine posts", "description": "US army sergeant fired over pro-Palestine posts", "content": "UNMUTE\r\nRead moreFormer US Sergeant Jonathan Estridge opens up about losing his job over his posts on Palestine and Israel, and what the experience meant for him.", "url": "https://www.aljazeera.com/video/unmute/2025/10/8/us-army-sergeant-fired-over-pro-palestine-posts", "source": "Al Jazeera English", "published_at": "2025-10-08T09:46:37Z", "relevance_score": 0.16}, {"title": "Trump draws international praise as broker of Israel-Hamas deal", "description": "Israeli President Isaac Herzog thanked Trump \"for his incredible leadership.\"", "content": "LONDON -- World leaders on Thursday issued a wave of statements commending Israel and Hamas for agreeing to the first phase of a ceasefire deal, with many also praising U.S. President Donald Trump fo… [+5096 chars]", "url": "https://abcnews.go.com/International/trump-draws-international-praise-broker-israel-hamas-deal/story?id=126356500", "source": "ABC News", "published_at": "2025-10-09T12:59:40Z", "relevance_score": 0.16}, {"title": "How Israel weaponises paid ads", "description": "Al Jazeera&#039;s Linh Nguyen looks at how Israel uses tech platforms to help manage its image on the world stage.", "content": "Digital Dilemma\r\nRead moreSince its war on Gaza, Israel has spent millions on paid ads to shape public opinion. Al Jazeeras Linh Nguyen looks at how it uses tech platforms like Google and X to help m… [+34 chars]", "url": "https://www.aljazeera.com/video/digital-dilemma/2025/10/9/how-israel-weaponises-paid-ads", "source": "Al Jazeera English", "published_at": "2025-10-09T13:45:10Z", "relevance_score": 0.16}, {"title": "As Israel systematically destroys Gaza City, those fleeing have few options", "description": "Once more Israel, Israel is emptying Gaza City while telling residents to flee to &quot;safe zones&quot; that are anything but", "content": "Toggle Play\r\nIsrael has displaced most of Gaza City again -- but the available options have little to offer", "url": "https://www.aljazeera.com/video/birds-eye-view/2025/10/7/as-israel-systematically-destroys-gaza-city-those-fleeing-have-few-options", "source": "Al Jazeera English", "published_at": "2025-10-07T04:38:25Z", "relevance_score": 0.16}, {"title": "Spain’s parliament formally approves Israel arms embargo", "description": "The vote, which passes 178 votes to 169, enshrines into law an embargo that has been in effect since the war began.", "content": "Spains parliament has approved the enshrinement in law of a total arms embargo on Israel, permanently banning the sale of weapons, dual-use technology and military equipment in response to the genoci… [+2518 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/spains-parliament-formally-approves-israel-arms-embargo", "source": "Al Jazeera English", "published_at": "2025-10-08T20:10:59Z", "relevance_score": 0.16}, {"title": "Relief and disbelief greet ceasefire announcement in Israel", "description": "After two years of war on Gaza, Israelis struggle to believe that the conflict may have finally ended.", "content": "Across Israeli society, the reaction to the news of a Gaza ceasefire deal has been almost uniform: Joy.\r\nIn Tel Aviv, the families of those taken captive during the Hamas-led attack on Israel in Octo… [+7057 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/relief-and-disbelief-greet-ceasefire-announcement-in-israel", "source": "Al Jazeera English", "published_at": "2025-10-09T16:27:19Z", "relevance_score": 0.16}, {"title": "Attacks on Gaza continue after Israel agrees ceasefire", "description": "Explosions and smoke were seen in Gaza on Friday, with attacks taking place after Israel’s gov&#039;t approved the ceasefire.", "content": "NewsFeed\r\nExplosions and smoke were seen in Gaza on Friday, with attacks taking place after Israels government ratified the first phase of the ceasefire deal. Palestinians are waiting for Israeli for… [+83 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/10/attacks-on-gaza-continue-after-israel-agrees-ceasefire", "source": "Al Jazeera English", "published_at": "2025-10-10T07:39:36Z", "relevance_score": 0.16}, {"title": "Gaza residents flood streets in hope that Israel’s war is ending", "description": "Jubilation spreads in Khan Younis after US endorsement of Israel-Hamas ceasefire prompts optimism for ending the war.", "content": "Palestinians have flooded the streets of Khan Younis, Gaza, celebrating after United States President Donald Trump announced the initial phase of a ceasefire plan between Israel and Hamas would proce… [+1466 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/9/gaza-residents-flood-streets-in-hope-that-israels-war-is-ending", "source": "Al Jazeera English", "published_at": "2025-10-09T12:13:42Z", "relevance_score": 0.16}, {"title": "Israel-Gaza: Why Is Hamas Recalling Fighters?", "description": "And Israelis and Palestinians wait for the release of hostages and prisoners.", "content": "Available for over a year\r\nToday, we look at the progress of the Trump peace plan for Israel and Gaza as Hamas recalls 7,000 fighters to reassert control over Gaza amid fears of renewed internal viol… [+1309 chars]", "url": "https://www.bbc.co.uk/sounds/play/p0m83h8w", "source": "BBC News", "published_at": "2025-10-11T18:17:00Z", "relevance_score": 0.155}, {"title": "Has another Nakba been averted?", "description": "Palestinians are returning to their homes after refusing to leave Gaza during Israel&#039;s war.", "content": "Palestinians are returning to their homes after refusing to leave Gaza during Israels war.Tens of thousands of Palestinians are streaming back to their land in northern Gaza a right of return include… [+722 chars]", "url": "https://www.aljazeera.com/video/inside-story/2025/10/11/has-another-nakba-been-averted", "source": "Al Jazeera English", "published_at": "2025-10-11T23:04:55Z", "relevance_score": 0.155}, {"title": "The Israel-Hamas war's devastating human toll after 2 years, by the numbers", "description": "Tuesday marks two years since the Israel-Hamas war began, bringing devastation across the region.", "content": "Tuesday marks two years since the Israel-Hamas war began, bringing devastation across the region.\r\nThe war -- which started after Hamas launched a surprise terrorist attack in Israel on Oct. 7, 2023,… [+5771 chars]", "url": "https://abcnews.go.com/International/israel-hamas-wars-devastating-human-toll-after-2/story?id=126252242", "source": "ABC News", "published_at": "2025-10-07T10:30:34Z", "relevance_score": 0.155}, {"title": "October 7 prompted some Jews to leave Israel. For others, the country offers shelter from rising global antisemitism", "description": "Thousands of Jewish people have left Israel in the two years since the attacks of October 7, 2023. A smaller number, seeking refuge from antisemitism, have...", "content": "On November 22, 2023, Chantal and Nicky Young closed their front door in London for the final time and boarded a flight to Israel.\r\nFamily members were waiting at arrivals in Tel Aviv with a sign say… [+10076 chars]", "url": "https://www.cnn.com/2025/10/07/middleeast/october-7-israel-population-impact-intl-scli", "source": "CNN", "published_at": "2025-10-07T05:46:29Z", "relevance_score": 0.155}, {"title": "Major challenges remain for Gaza and Israel if ceasefire deal rolls out", "description": "There are many questions surrounding the Israel-Hamas ceasefire deal and what it means for the region.", "content": "As U.S. officials and leaders in the Middle East are celebrating the proposed Gaza ceasefire deal between the Israeli government and Hamas but there are still many questions over the timeline and cha… [+2540 chars]", "url": "https://abcnews.go.com/Politics/major-challenges-remain-gaza-israel-ceasefire-deal-rolls/story?id=126360503", "source": "ABC News", "published_at": "2025-10-09T19:01:30Z", "relevance_score": 0.155}, {"title": "Two years into its war on Gaza, Israel is fractured, isolated: Analysts", "description": "The trauma of the Hamas-led attacks on Israel continues to define and justify its bombing of Gaza, analysts say.", "content": "Two years into its war on Gaza, having killed more than 67,000 people, forced a famine upon countless others and attacked its neighbours repeatedly, Israel stands isolated on the world stage and divi… [+7425 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/two-years-into-its-war-on-gaza-israel-is-fractured-isolated-analysts", "source": "Al Jazeera English", "published_at": "2025-10-07T14:10:52Z", "relevance_score": 0.155}, {"title": "Videos show Berlin police beating pro-Palestine protesters", "description": "Videos show German police officers beating pro-Palestine protesters in Berlin after authorities banned a planned demonst", "content": "NewsFeed\r\nVideos show German police officers beating pro-Palestine protesters in Berlin after authorities banned a planned demonstration. Around 500 people gathered near Berlins City Hall chanting sl… [+65 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/8/videos-show-berlin-police-beating-pro-palestine-protesters", "source": "Al Jazeera English", "published_at": "2025-10-08T07:46:50Z", "relevance_score": 0.155}, {"title": "LIVE: Deadly attacks continue across Gaza; Egypt hosts Israel, Hamas teams", "description": "Delegations from Hamas, Israel and the US are due to convene in Egypt for talks.", "content": "blinking-dot\r\nLive updatesLive updates, \r\nDelegations from Hamas, Israel and the US due to convene in Egypt for talks.", "url": "https://www.aljazeera.com/news/liveblog/2025/10/6/live-trump-urges-negotiators-to-move-fast-on-israel-gaza-peace-deal", "source": "Al Jazeera English", "published_at": "2025-10-06T05:29:44Z", "relevance_score": 0.155}, {"title": "LIVE: Israel keeps bombing Gaza as peace talks in Egypt enter third day", "description": "Israel attacks and intercepts another convoy of Gaza-bound boats, according to the Freedom Flotilla Coalition.", "content": "blinking-dot\r\nLive updatesLive updates, \r\nIsrael attacks and intercepts a convoy of Gaza-bound boats, according to the Freedom Flotilla Coalition.", "url": "https://www.aljazeera.com/news/liveblog/2025/10/8/live-israel-keeps-bombing-gaza-as-peace-talks-in-egypt-enter-third-day", "source": "Al Jazeera English", "published_at": "2025-10-08T06:30:00Z", "relevance_score": 0.155}, {"title": "Israelis mark two years since October 7 with tributes to loved ones", "description": "Israelis held vigils to mark two since the Hamas-led October 7 attack on Israel.", "content": "NewsFeed\r\nIsraelis marked two since the Hamas-led October 7 attack on Israel, holding vigils to remember those killed and pray for those still held captive in Gaza.", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/7/israelis-mark-two-years-since-october-7-with-tributes-to-loved-ones", "source": "Al Jazeera English", "published_at": "2025-10-07T20:11:46Z", "relevance_score": 0.155}, {"title": "Greta Thunberg “humiliated” by Israeli forces", "description": "Italian journalist Lorenzo D’Agostino says Israel subjected him and Global Flotilla members to “barbaric” treatment", "content": "Toggle Play\r\nGreta Thunberg humiliated by Israeli forces", "url": "https://www.aljazeera.com/video/quotable/2025/10/6/greta-thunberg-humiliated-by-israeli-forces", "source": "Al Jazeera English", "published_at": "2025-10-06T05:39:22Z", "relevance_score": 0.155}, {"title": "Accountability for Israel likely to “start in the Global South”", "description": "Antony Loewenstein on Israeli impunity and the push for accountability now likely to emerge from the Global South.", "content": "Quotable\r\nAntony Loewenstein on Israeli impunity and the push for accountability now likely to emerge from the Global South.\r\nRead moreJournalist and author Antony Loewenstein examines Israeli impuni… [+112 chars]", "url": "https://www.aljazeera.com/video/quotable/2025/10/9/accountability-for-israel-likely-to-start-in-the-global", "source": "Al Jazeera English", "published_at": "2025-10-09T11:47:27Z", "relevance_score": 0.155}, {"title": "Spain approves arms embargo on Israel due to Gaza genocide", "description": "Spanish lawmakers have passed a law ending all trade of arms, defence equipment, or technologies to Israel.", "content": "NewsFeed\r\nSpanish lawmakers have passed a law ending all trade of arms, defence equipment, or technologies to Israel, due to the genocide in Gaza.", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/8/spain-approves-arms-embargo-on-israel-due-to-gaza-genocide", "source": "Al Jazeera English", "published_at": "2025-10-08T20:10:05Z", "relevance_score": 0.155}, {"title": "Potential hurdles litter road as Israel and Hamas head to Gaza peace talks", "description": "Indirect negotiations between Israel and Hamas over Trump's 20-point plan are set to begin in Sharm el-Sheikh.", "content": "Delegations from Hamas, Israel and the United States are due to convene in Egypt for talks on US President Donald Trumps proposal to end the war in Gaza.\r\nIndirect negotiations between Israel and Ham… [+5341 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/potential-hurdles-litter-road-as-israel-and-hamas-head-to-gaza-peace-talks", "source": "Al Jazeera English", "published_at": "2025-10-06T12:44:15Z", "relevance_score": 0.155}, {"title": "Cycling team to drop Israel name after mass pro-Palestinian Vuelta protests", "description": "Israel-Premier Tech cycling team will drop Israeli ties after multiple protests at the Vuelta a Espana race.", "content": "The IsraelPremier Tech cycling team will drop its ties to Israel from the 2026 season, following repeated pro-Palestinian protests against it at the recent Vuelta a Espana bike race.\r\nThe move was an… [+2447 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/cycling-team-to-drop-israel-name-after-mass-pro-palestinian-vuelta-protests", "source": "Al Jazeera English", "published_at": "2025-10-06T22:28:37Z", "relevance_score": 0.155}, {"title": "Lebanon says it foiled Israeli network plotting bomb attacks", "description": "Lebanese intelligence agency says it arrested people working for Israel who planned 'terrorist attacks' in the country.", "content": "The Lebanese government says it foiled an Israeli plot to carry out assassinations and bombing attacks in the country, as Israel continues to violate the ceasefire agreement with Hezbollah.\r\nThe Leba… [+2676 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/lebanon-says-it-foiled-israeli-network-plotting-bomb-attacks", "source": "Al Jazeera English", "published_at": "2025-10-10T17:33:10Z", "relevance_score": 0.155}, {"title": "Norway FA president welcomes Israel peace deal before vital World Cup tie", "description": "Norway's FA had said profits from ticket sales from the Israel game would be sent to Doctors Without Borders in Gaza.", "content": "Norwegian Football Federation President Lise Klaveness is looking forward to meeting her Israeli counterpart before a World Cup qualifier between the two on Saturday, following the announcement of a … [+2223 chars]", "url": "https://www.aljazeera.com/sports/2025/10/10/norway-fa-president-welcomes-israel-peace-deal-ahead-of-vital-world-cup-tie", "source": "Al Jazeera English", "published_at": "2025-10-10T11:41:07Z", "relevance_score": 0.155}, {"title": "A 10-point plan for Israel", "description": "Here is what needs to happen to put Palestinians and Israelis on the path to peace.", "content": "On Friday, Hamas sent its response to the 20-point Gaza peace plan put forward by United States President Donald Trump. Importantly, the Palestinian group agreed to hand over the administration of Ga… [+5134 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/6/a-10-point-plan-for-israel", "source": "Al Jazeera English", "published_at": "2025-10-06T14:34:43Z", "relevance_score": 0.15}, {"title": "Palestinians in Gaza worry and wait for Israel to implement ceasefire", "description": "Hope battles with distrust as Palestinians in Gaza wait for Israel to implement the ceasefire. Here's what they said.", "content": "Deir el-Balah, Gaza A cautious relief seems to hover over central Gazas Deir el-Balah as people stand outside their tents, talking to each other about the ceasefire that is set to come into force aft… [+5637 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/palestinians-in-gaza-worry-and-wait-for-israel-to-implement-ceasefire", "source": "Al Jazeera English", "published_at": "2025-10-09T15:19:25Z", "relevance_score": 0.15}, {"title": "Bari Weiss and the Israel narrative in the US", "description": "A relentless push to control how Israel is seen in US media - led by the billionaire Ellison family.", "content": "For the past couple of months, the billionaire father-son duo of Larry and David Ellison have been making deals involving major media brands. Having acquired Paramount, the parent company of CBS News… [+1354 chars]", "url": "https://www.aljazeera.com/video/the-listening-post/2025/10/11/bari-weiss-and-the-israel-narrative-in-the-us", "source": "Al Jazeera English", "published_at": "2025-10-11T12:14:00Z", "relevance_score": 0.15}, {"title": "Relief, scepticism over Gaza ceasefire at pro-Palestine rally in London", "description": "Tens of thousands gather in British capital with protest leader saying there is 'relief' and 'trepidation' over truce.", "content": "Tens of thousands of pro-Palestinian protesters have marched in London, expressing scepticism and cautious hope as a ceasefire between Israel and Hamas in Gaza has entered its second day.\r\nWere shari… [+4013 chars]", "url": "https://www.aljazeera.com/news/2025/10/11/relief-scepticism-over-gaza-ceasefire-at-pro-palestine-rally-in-london", "source": "Al Jazeera English", "published_at": "2025-10-11T17:43:24Z", "relevance_score": 0.13}, {"title": "WATCH: Speaker Johnson has emotional exchange with a military mom about shutdown", "description": "A military mom confronted House Speaker Johnson on C-SPAN over the lack of a standalone bill to pay troops if the government shutdown extends beyond Oct. 15.", "content": "<ul><li>Israel's security cabinet approves 1st phase of Israel-Hamas ceasefire agreement\r\n</li><li>Inside Gaza as the 1st step toward a ceasefire unfolds\r\n</li><li>Trump says there will be 'everlasti… [+4642 chars]", "url": "https://abcnews.go.com/US/video/speaker-johnson-emotional-exchange-military-mom-shutdown-126379234", "source": "ABC News", "published_at": "2025-10-09T20:22:20Z", "relevance_score": 0.13}, {"title": "'They're survivors': Brother of 2 Israeli hostages fights for their return", "description": "Liran Berman, whose twin brothers Gali and Ziv Berman are hostages who may still be alive, spoke to ABC News Live on Tuesday.", "content": "It's been two years since twins Gali and Ziv Berman were taken hostage by Hamas during the Oct. 7, 2023, terrorist attack on Israel. Their brother, Liran Berman, has been fighting every day to get th… [+1938 chars]", "url": "https://abcnews.go.com/International/brother-2-israeli-hostages-fights-return-theyre-survivors/story?id=126305281", "source": "ABC News", "published_at": "2025-10-07T20:53:38Z", "relevance_score": 0.13}, {"title": "What to know about the proposed Israel-Hamas Gaza ceasefire", "description": "U.S. President Donald Trump's last month proposed a 20-point plan for for a ceasefire in the Gaza Strip ahead of this week's negotiations in Egypt.", "content": "LONDON -- LONDON and TEL AVIV -- Israeli Prime Minister Benjamin Netanyahu will convene his cabinet to discuss the proposed Gaza Strip ceasefire deal on Thursday, with the cabinet and the wider gover… [+3133 chars]", "url": "https://abcnews.go.com/International/israel-hamas-ceasefire-gaza-proposed-deal/story?id=126318216", "source": "ABC News", "published_at": "2025-10-09T11:53:22Z", "relevance_score": 0.125}, {"title": "Israel-Hamas war: Glimpses of possible peace after 2 years of systematic, brutal war", "description": "The sinews of the conflict have stretched wider in the last year.", "content": "LONDON -- As Israel's military prepared last month to launch its ground offensive into Gaza City, the Israel Defense Forces published a warning about al-Kawthar Tower, a residential high-rise in the … [+10585 chars]", "url": "https://abcnews.go.com/International/after-2-years-israel-hamas-war-systematic-brutal/story?id=126244465", "source": "ABC News", "published_at": "2025-10-07T09:17:04Z", "relevance_score": 0.125}, {"title": "Which artists are speaking up about Palestine?", "description": "From letters to pins to concerts to boycotts, artists risk roles and deals to back a Gaza ceasefire.", "content": "Toggle Play\r\nWhich artists are speaking up about Palestine?", "url": "https://www.aljazeera.com/video/by-the-numbers-3/2025/10/11/which-artists-are-speaking-up-about-palestine", "source": "Al Jazeera English", "published_at": "2025-10-11T04:11:56Z", "relevance_score": 0.125}, {"title": "Trump pressure key for Gaza deal to be more than ‘another one-phase’ truce", "description": "Analysts stress Trump pressure essential to prevent Netanyahu from disrupting the Gaza ceasefire for political survival.", "content": "Washington, DC, United States  In announcing the Gaza ceasefire deal, Hamas praised United States President Donald Trump in one sentence and called on him to compel Israel to live up to its obligatio… [+6428 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/trump-pressure-key-for-gaza-deal-to-be-more-than-another-one-phase-truce", "source": "Al Jazeera English", "published_at": "2025-10-09T21:28:12Z", "relevance_score": 0.125}, {"title": "The young children killed by Israeli fire this year in occupied West Bank", "description": "The stories of boys and girls killed walking in their neighbourhoods, playing outside or staying home.", "content": "At least 41 children have been killed this year by Israeli fire in the occupied West Bank, including occupied East Jerusalem, according to the United Nations childrens agency (UNICEF).\r\nSome of the b… [+2014 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/7/the-young-children-killed-by-israeli-fire-this-year-in-occupied-west-bank", "source": "Al Jazeera English", "published_at": "2025-10-07T09:48:31Z", "relevance_score": 0.125}, {"title": "US activist from Gaza flotilla alleges ‘psychological torture’ by Israel", "description": "David Adler says Sumud Flotilla activists were 'kidnapped, stripped, zip-tied, blindfolded' and sent to prison camp.", "content": "A United States citizen who was detained by Israel on the Global Sumud Flotilla, which tried to deliver aid to Gaza, says he and other activists endured abuse and psychological torture in Israeli cus… [+4405 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/us-activist-from-gaza-flotilla-alleges-psychological-torture-by-israel", "source": "Al Jazeera English", "published_at": "2025-10-07T18:41:25Z", "relevance_score": 0.125}, {"title": "Israel-Gaza live updates: Egypt to host ceasefire talks with Hamas and Israel", "description": "Hamas responded positively to President Donald Trump's proposal for peace in Gaza, though said more negotiations will be needed before a full agreement can be signed.", "content": "Leaving the White House for the Navys 250th celebration on Sunday, President Donald Trump continued to celebrate his Gaza peace proposal while admitting that negotiations are still ongoing.\r\nThey're … [+1028 chars]", "url": "https://abcnews.go.com/International/live-updates/israel-gaza-live-updates-egypt-host-ceasefire-talks/?id=126242055", "source": "ABC News", "published_at": "2025-10-06T07:35:39Z", "relevance_score": 0.12}, {"title": "How Israel denies the right to play for Palestinian children", "description": "We look at Palestinian children&#039;s right to play in war-ravaged Gaza and in the occupied West Bank.", "content": "We look at Palestinian childrens right to play in war-ravaged Gaza and in the occupied West Bank.All children wherever they are in the world deserve to be children: to explore, laugh and play, especi… [+399 chars]", "url": "https://www.aljazeera.com/video/the-stream/2025/10/10/how-israel-denies-the-right-to-play-for-palestinian-children", "source": "Al Jazeera English", "published_at": "2025-10-10T13:00:00Z", "relevance_score": 0.12}, {"title": "WATCH: Jared Kushner, Ivanka Trump speak in Israel after ceasefire announcement", "description": "Jared Kushner and Ivanka Trump addressed a crowd gathered in Tel Aviv following the announcement of the ceasefire agreement in Gaza.", "content": "<ul><li>Joe Biden undergoing radiation therapy for prostate cancer treatment\r\n</li><li>Nor'easter develops as East Coast set for impact\r\n</li><li>Official shares new details on deadly explosion in Te… [+4466 chars]", "url": "https://abcnews.go.com/International/video/jared-kushner-ivanka-trump-speak-israel-after-ceasefire-126434451", "source": "ABC News", "published_at": "2025-10-11T19:30:30Z", "relevance_score": 0.12}, {"title": "Palestine factions refuse foreign guardianship on Gaza as truce takes hold", "description": "Tens of thousands of displaced Palestinians head back to 'unrecognisable' Gaza City on first day of ceasefire.", "content": "Hamas and allied Palestinian factions have reiterated that any decision on the future governance of Gaza is an internal Palestinian matter as the ceasefire in the territory takes effect.\r\nIn a joint … [+3977 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/palestine-factions-refuse-foreign-guardianship-on-gaza-as-truce-takes-hold", "source": "Al Jazeera English", "published_at": "2025-10-10T22:43:04Z", "relevance_score": 0.12}, {"title": "Orphaned by Israel, two child amputees find each other in Lebanon", "description": "Pulled from the rubble in Gaza and southern Lebanon, two boys are rebuilding their lives together.", "content": "Beirut, Lebanon They wait, smiling mischievously, their eyes bright at the sight of two wrapped Spider-Man notebooks.\r\nAli, the bolder of the two despite being only three years old, tears his open at… [+10996 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/injure-orphaned-by-israel-two-child-amputees-found-each-other-in-lebanon", "source": "Al Jazeera English", "published_at": "2025-10-08T12:49:36Z", "relevance_score": 0.12}, {"title": "Can Trump turn a Gaza ceasefire into a lasting peace deal?", "description": "Israel and Hamas have agreed to the first phase of a peace deal", "content": "Available for over a year\r\nThere was an extraordinary moment at White House on Wednesday when, in front of reporters, secretary of state Marco Rubio handed Donald Trump a note that read the words ver… [+2036 chars]", "url": "https://www.bbc.co.uk/sounds/play/p0m7qcbp", "source": "BBC News", "published_at": "2025-10-09T16:32:00Z", "relevance_score": 0.06}, {"title": "Will Hamas agree to hand over its weapons as part of a Gaza ceasefire deal?", "description": "Negotiations over Hamas's disarmament may emerge as a key obstacle to securing a permanent end to Israel's war on Gaza.", "content": "Israel and Hamas may have agreed to the first phase of a United States-backed ceasefire deal, but contentious differences between the two sides still remain, particularly when it comes to the fate of… [+5355 chars]", "url": "https://www.aljazeera.com/features/2025/10/9/will-hamas-agree-to-hand-over-its-weapons-as-part-of-a-gaza-ceasefire-deal", "source": "Al Jazeera English", "published_at": "2025-10-09T19:39:56Z", "relevance_score": 0.04}, {"title": "Key moments that led to Trump’s Gaza ceasefire deal announcement", "description": "The Gaza ceasefire deal, based on Trump's 20-point plan, aims to free prisoners and captives in the first phase.", "content": "US President Donald Trump has announced that Israel and Hamas have agreed to the first phase of a peace plan that aims to achieve a ceasefire in Gaza.\r\nThis plan seeks to end Israels war that has dra… [+7373 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/key-moments-that-led-to-trumps-gaza-ceasefire-deal-announcement", "source": "Al Jazeera English", "published_at": "2025-10-09T11:02:52Z", "relevance_score": 0.04}, {"title": "Italy’s Meloni says ICC complaint accuses her of Gaza genocide complicity", "description": "A complaint lodged with the ICC points to the Italian government's role supplying lethal weapons to Israel amid Gaza war", "content": "Italian Prime Minister Giorgia Meloni says she has been accused of complicity in genocide in a complaint lodged with the International Criminal Court (ICC) over Romes support for Israel as it bombard… [+5351 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/italys-meloni-says-icc-complaint-accuses-her-of-gaza-genocide-complicity", "source": "Al Jazeera English", "published_at": "2025-10-08T02:34:58Z", "relevance_score": 0.04}, {"title": "Tens of thousands return to shattered Gaza homes after ceasefire", "description": "A tide of humanity heads back to Gaza City, carrying belongings through damaged highways and ruins left by Israel.", "content": "Tens of thousands of forcibly displaced Palestinians are making their way back to devastated areas in northern Gaza as Israeli forces stop operations as agreed under phase one of the ceasefire plan w… [+2011 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/11/tens-of-thousands-return-to-shattered-gaza-homes-after-ceasefire", "source": "Al Jazeera English", "published_at": "2025-10-11T08:25:15Z", "relevance_score": 0.04}, {"title": "WATCH: Dog goes viral for loving mom's music", "description": "A dog has gone viral on social media for loving his professional pianist mom's jazz music.", "content": "<ul><li>Retired 4-star general on Israel-Hamas ceasefire\r\n</li><li>What happens next after a ceasefire between Israel and Hamas?\r\n</li><li>Trump threatens 'massive' increase of tariffs on China\r\n</li… [+4552 chars]", "url": "https://abcnews.go.com/Lifestyle/video/dog-viral-loving-moms-music-126418202", "source": "ABC News", "published_at": "2025-10-10T23:06:55Z", "relevance_score": 0.035}, {"title": "With Gaza in ruins, will US media name the crime?", "description": "With at least 66,000 Palestinians dead and mounting genocide declarations, will Western media hold Israel accountable?", "content": "The Take\r\nRead moreDespite a United Nations inquiry and multiple human rights organisations finding that Israel is committing genocide in Gaza, Western news outlets are still reluctant to use the ter… [+117 chars]", "url": "https://www.aljazeera.com/video/the-take-2/2025/10/6/aje-onl-glb_gazamediacoverage_av_v2-061025", "source": "Al Jazeera English", "published_at": "2025-10-06T16:58:54Z", "relevance_score": 0.035}, {"title": "There’s a Gaza ceasefire deal – but what happens next?", "description": "There are celebrations in the occupied Palestinian territories and in Israel after a ceasefire deal.", "content": "NewsFeed\r\nThere are celebrations in the occupied Palestinian territories and in Israel after agreement on the first stage of a ceasefire deal to end the war on Gaza. But analysts point out there are … [+42 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/theres-a-gaza-ceasefire-deal-but-what-happens", "source": "Al Jazeera English", "published_at": "2025-10-09T13:02:05Z", "relevance_score": 0.035}, {"title": "Trump predicts Gaza ceasefire talks will go ‘very quickly’", "description": "US President Donald Trump said he believes negotiations involving Israel and Hamas will go “very quickly”.", "content": "NewsFeed\r\nUS President Donald Trump said he believes negotiations involving Israel and Hamas will go very quickly as mediators arrive in Egypt to discuss the details of his 20-point plan to end the G… [+7 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/6/trump-predicts-gaza-ceasefire-talks-will-go-very", "source": "Al Jazeera English", "published_at": "2025-10-06T06:56:36Z", "relevance_score": 0.035}, {"title": "The second year of genocide was different", "description": "In the second year of the genocide, the Israelis got creative with new methods of mass murder and torture.", "content": "When Israel started its attack on October 7, 2023, nearly all of us in Gaza had the sense that this was going to be brutal.\r\nYet, no one thought it would continue for two long years. No one thought t… [+6840 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/7/the-second-year-of-genocide-was-different", "source": "Al Jazeera English", "published_at": "2025-10-07T10:49:15Z", "relevance_score": 0.035}, {"title": "Conservative writer Bari Weiss named editor-in-chief of CBS News", "description": "Appointment of media figure known for pro-Israel, anti-'woke' stances comes as US media firms feel Trump pressure.", "content": "The United States media conglomerate Paramount has announced a deal securing the acquisition of the commentary website Free Press and naming its founder, conservative media figure Bari Weiss, as the … [+2445 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/conservative-writer-bari-weiss-named-editor-in-chief-of-cbs-news", "source": "Al Jazeera English", "published_at": "2025-10-06T15:34:00Z", "relevance_score": 0.035}, {"title": "Turkiye’s ceasefire task force will ‘help Gaza get back on its feet’", "description": "Turkiye’s President Erdogan says Ankara will join a task force to monitor the Gaza ceasefire between Israel and Hamas.", "content": "NewsFeed\r\nTurkiyes President Erdogan says Ankara will join a ground task force to monitor the Gaza ceasefire between Israel and Hamas, as part of a US-brokered deal under President Trump. He added Tu… [+53 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/turkiyes-ceasefire-task-force-will-help-gaza-get-back-on-its", "source": "Al Jazeera English", "published_at": "2025-10-09T14:37:18Z", "relevance_score": 0.035}, {"title": "Video: Palestinians in Gaza speak of cautious optimism on ceasefire deal", "description": "Palestinians in Gaza voiced their hopes and fears after a ceasefire agreement between Israel and Hamas was annouced.", "content": "NewsFeed\r\nDisplaced Palestinians in Gaza voiced their hopes and fears after a ceasefire agreement between Israel and Hamas was announced. The agreement raised hopes of an end to the two-year war but … [+60 chars]", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/9/video-palestinians-in-gaza-speak-of-cautious-optimism-on-ceasefire-deal", "source": "Al Jazeera English", "published_at": "2025-10-09T10:32:36Z", "relevance_score": 0.035}, {"title": "Day one of Gaza peace talks ends on ‘positive’ note in Egypt", "description": "Sources familiar with the talks with Israel and Hamas say that progress was made on Monday, negotiations to continue.", "content": "The first day of resumed indirect talks between Israel and Hamas in Egypt ended on a positive note, amid hopes of a potential deal to implement US President Donald Trumps 20-point plan to end the war… [+3483 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/day-one-of-gaza-peace-talks-ends-on-positive-note-in-egypt", "source": "Al Jazeera English", "published_at": "2025-10-07T01:51:19Z", "relevance_score": 0.035}, {"title": "‘Horrific trauma patients’: WHO details harrowing scenes from Gaza", "description": "Just 14 of Gaza’s 36 hospitals are partially functioning, WHO says, as Israel continues to bomb amid ceasefire talks.", "content": "The World Health Organization (WHO) representative for the occupied Palestinian territory, who is currently in Gaza, has described harrowing scenes of what he has witnessed amid efforts to supply hos… [+2505 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/horrific-trauma-patients-who-details-harrowing-scenes-from-gaza", "source": "Al Jazeera English", "published_at": "2025-10-08T11:05:22Z", "relevance_score": 0.035}, {"title": "Trump says he may travel to Middle East as Gaza deal ‘very close’", "description": "Despite growing optimism of an agreement, Israel continues to strike Gaza, killing eight people in 24 hours.", "content": "United States President Donald Trump says indirect talks between Hamas and Israel over a potential ceasefire in the war on Gaza and an exchange of captives were going very well and that he may travel… [+5104 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/trump-says-he-may-travel-to-middle-east-as-gaza-deal-very-close", "source": "Al Jazeera English", "published_at": "2025-10-08T22:52:30Z", "relevance_score": 0.035}, {"title": "Families walk back to Gaza City minutes after ceasefire goes into effect", "description": "Families eager to return to what&#039;s left of their homes are walking back to Gaza City as Israel begins its withdrawal.", "content": "NewsFeed\r\nFamilies eager to return to whats left of their homes are walking back to Gaza City as Israel begins its withdrawal under the new ceasefire agreement.", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/10/families-walk-back-to-gaza-city-minutes-after-ceasefire-goes-into-effect", "source": "Al Jazeera English", "published_at": "2025-10-10T21:05:09Z", "relevance_score": 0.035}, {"title": "WATCH: Authorities announce arrest in connection with Palisades fire", "description": "A 29-year-old man has been arrested in connection with the Palisades Fire, which killed a dozen people earlier this year and caused widespread destruction in Los Angeles County, the DOJ announced.", "content": "<ul><li>Man arrested, faces federal charge in connection with Palisades Fire: DOJ\r\n</li><li>James Comey pleads not guilty, trial date set for January\r\n</li><li>US delegation expected to join peace ta… [+4418 chars]", "url": "https://abcnews.go.com/US/video/authorities-announce-arrest-connection-palisades-firev-126335430", "source": "ABC News", "published_at": "2025-10-08T17:26:43Z", "relevance_score": 0.03}, {"title": "Van Jones and the moral vacancy of American commentary on Gaza", "description": "US pundit’s 'dead Gaza baby' joke exposes the moral vacancy that defines US media on Palestine.", "content": "Last Friday, during an appearance on Real Time with Bill Maher on HBO, CNN commentator and former Obama adviser Van Jones claimed that Iran and Qatar are running a disinformation campaign to manipula… [+6340 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/8/van-jones-and-the-moral-vacancy-of-american-commentary-on-gaza", "source": "Al Jazeera English", "published_at": "2025-10-08T13:38:05Z", "relevance_score": 0.03}, {"title": "WATCH: Beloved March Madness icon Sister Jean dies at 106", "description": "Sister Jean Dolores Schmidt, the team chaplain for the Loyola University Chicago basketball team who became a national celebrity during the school's 2018 underdog March Madness run, has died at 106.", "content": "<ul><li>Trump threatens 'massive' increase of tariffs on China\r\n</li><li>Multiple dead in 'devastating blast' at explosives manufacturer: Sheriff\r\n</li><li>Kilmar Abrego Garcia's attorneys return to … [+4560 chars]", "url": "https://abcnews.go.com/US/video/beloved-march-madness-icon-sister-jean-dies-106-126411786", "source": "ABC News", "published_at": "2025-10-10T17:56:52Z", "relevance_score": 0.03}, {"title": "Netanyahu will face “criticism” from two sides", "description": "Former Israeli minister Yossi Beilin says Netanyahu faces backlash in Israel from both right and left over Gaza.", "content": "Toggle Play\r\nNetanyahu will face criticism from two sides", "url": "https://www.aljazeera.com/video/quotable/2025/10/10/netanyahu-will-face-criticism-from-two-sides", "source": "Al Jazeera English", "published_at": "2025-10-10T12:37:48Z", "relevance_score": 0.03}, {"title": "WATCH: Trump says Sean 'Diddy' Combs asked him for a pardonvv", "description": "President Donald Trump said that Sean \"Diddy\" Combs has reached out to ask him for a pardon following his conviction on two prostitution-related charges.", "content": "<ul><li>Nova music festival massacre survivor: 'I remember just running for my life'\r\n</li><li>Trump says Sean 'Diddy' Combs asked him for a pardon\r\n</li><li>Government shutdown's impact on air traff… [+4405 chars]", "url": "https://abcnews.go.com/US/video/trump-sean-diddy-combs-asked-pardon-126299891", "source": "ABC News", "published_at": "2025-10-07T16:52:50Z", "relevance_score": 0.03}, {"title": "WATCH: The story behind the viral surprise father-daughter wedding dance video", "description": "Marissa Nielsen surprised her dad Greg Wickles by inviting her three older sisters to join in on a father-daughter dance at her wedding.", "content": "<ul><li>Israel's security cabinet approves 1st phase of Israel-Hamas ceasefire agreement\r\n</li><li>Inside Gaza as the 1st step toward a ceasefire unfolds\r\n</li><li>Trump says there will be 'everlasti… [+4642 chars]", "url": "https://abcnews.go.com/GMA/Family/video/story-viral-surprise-father-daughter-wedding-dance-video-126377848", "source": "ABC News", "published_at": "2025-10-09T19:33:49Z", "relevance_score": 0.010000000000000002}, {"title": "WATCH: President Trump signs proclamation protecting Columbus Day name", "description": "President Trump signed a proclamation protecting the name Columbus Day before hosting a Cabinet meeting on Thursday.", "content": "<ul><li>Israel's security cabinet approves 1st phase of Israel-Hamas ceasefire agreement\r\n</li><li>Inside Gaza as the 1st step toward a ceasefire unfolds\r\n</li><li>Trump says there will be 'everlasti… [+4642 chars]", "url": "https://abcnews.go.com/US/video/president-trump-signs-proclamation-protecting-columbus-day-126379332", "source": "ABC News", "published_at": "2025-10-09T20:22:15Z", "relevance_score": 0.010000000000000002}, {"title": "‘Not a punchline’: 15 dehumanising quotes on Gaza atrocities by US figures", "description": "Van Jones apologises for joke about dead Palestinian babies, but not alone when it comes to insensitive remarks on Gaza.", "content": "Washington, DC CNN commentator Van Jones has been facing backlash for making a crass joke about Palestinian children killed by Israel.\r\nDuring an appearance on Real Time With Bill Maher on HBO on Fri… [+3880 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/not-a-punchline-15-dehumanising-quotes-on-gaza-atrocities-by-us-figures", "source": "Al Jazeera English", "published_at": "2025-10-07T22:42:28Z", "relevance_score": 0.010000000000000002}, {"title": "Will Trump’s Gaza Peace Plan Work?", "description": "Trump urges mediators to “move fast” as key Gaza talks begin.", "content": "Available for over a year\r\nToday, negotiators from Israel and Hamas head to Sharm El-Sheikh in Egypt to start indirect talks over an end to the Israel-Gaza war. \r\nIt appears this is the closest both … [+1659 chars]", "url": "https://www.bbc.co.uk/sounds/play/p0m72zf5", "source": "BBC News", "published_at": "2025-10-06T18:03:00Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Ex-FBI Director James Comey pleads not guilty", "description": "Former FBI Director James Comey pleaded not guilty on Wednesday. He is charged with one count of false statements and one count of obstruction of a congressional proceeding.", "content": "<ul><li>James Comey pleads not guilty, trial date set for January\r\n</li><li>US delegation expected to join peace talks between Israel and Hamas\r\n</li><li>Inside Nasser Hospital's malnutrition ward am… [+4405 chars]", "url": "https://abcnews.go.com/US/video/fbi-director-james-comey-pleads-guilty-126330331", "source": "ABC News", "published_at": "2025-10-08T15:28:28Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Kilmar Abrego Garcia's attorneys return to court as deportation saga continues", "description": "Attorneys for Kilmar Abrego Garcia went to court in Maryland on Friday for an evidentiary hearing in which witnesses testified about the steps taken to remove him from the U.S.", "content": "<ul><li>Retired 4-star general on Israel-Hamas ceasefire\r\n</li><li>What happens next after a ceasefire between Israel and Hamas?\r\n</li><li>Trump threatens 'massive' increase of tariffs on China\r\n</li… [+4552 chars]", "url": "https://abcnews.go.com/US/video/kilmar-abrego-garcias-attorneys-return-court-deportation-saga-126418311", "source": "ABC News", "published_at": "2025-10-10T23:06:41Z", "relevance_score": 0.005000000000000001}, {"title": "UNESCO board backs Egypt’s Khaled el-Enany as its next chief", "description": "The Egyptologist and former minister of antiquities will be the first Arab to lead the UN's cultural organisation.", "content": "The board of the United Nations Educational, Scientific and Cultural Organization (UNESCO) has nominated Egypts Khaled el-Enany, an academic and former minister of tourism and antiquities, as its nex… [+3669 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/unesco-board-backs-egypts-khaled-el-enany-as-its-next-chief", "source": "Al Jazeera English", "published_at": "2025-10-07T06:07:05Z", "relevance_score": 0.005000000000000001}, {"title": "‘Another Nakba’: UN expert says Gaza recovery will take generations", "description": "UN special rapporteur on right to housing says Palestinians returning to destroyed northern Gaza face 'profound trauma'.", "content": "Israel must allow tents and caravans to immediately be delivered to the Gaza Strip, a United Nations expert says, as displaced Palestinians returning to the north of the bombarded territory have foun… [+2132 chars]", "url": "https://www.aljazeera.com/news/2025/10/11/another-nakba-un-expert-says-gaza-recovery-will-take-generations", "source": "Al Jazeera English", "published_at": "2025-10-11T17:57:22Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Crypto scam almost costs woman her life savings", "description": "The FBI says scams perpetrated using bitcoin ATMs cost Americans nearly $250 million in 2024, more than double the sum from the previous year.", "content": "<ul><li>Major challenges lie ahead for Gaza, Israel if ceasefire deal rolls out\r\n</li><li>Trump's use of the National Guard faces critical legal tests\r\n</li><li>'My kids could die': Mom begs Johnson … [+4641 chars]", "url": "https://abcnews.go.com/US/video/crypto-scam-costs-woman-life-savings-126369926", "source": "ABC News", "published_at": "2025-10-09T15:58:02Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: National Guard now on duty in Chicago area despite local opposition", "description": "In two courthouses on opposite sides of the country, President Donald Trump’s attempt to send troops into Democratic-led Chicago and Portland, Oregon, will face a critical legal test on Thursday.", "content": "<ul><li>Trump says there will be 'everlasting peace' in the Middle East\r\n</li><li>Major challenges lie ahead for Gaza, Israel if ceasefire deal rolls out\r\n</li><li>Trump's use of the National Guard f… [+4658 chars]", "url": "https://abcnews.go.com/US/video/national-guard-now-duty-chicago-area-despite-local-126371677", "source": "ABC News", "published_at": "2025-10-09T16:51:57Z", "relevance_score": 0.005000000000000001}, {"title": "Indians hard hit as US student visas decline by a fifth from last year", "description": "Indian nationals see decrease of 45 percent compared to same period last year as US clamps down on foreign students.", "content": "The number of student visas issued by the United States has dropped by about one-fifth compared to the same one-month period last year, with India seeing a dramatic decline amid restrictive policies … [+2049 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/indians-hard-hit-as-us-student-visas-decline-by-a-fifth-from-last-year", "source": "Al Jazeera English", "published_at": "2025-10-06T21:04:28Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Monarch butterfly gets wing transplant, continues migration", "description": "An injured monarch butterfly was able to continue its migration after undergoing a wing transplant at a nature preserve in New York.", "content": "<ul><li>Trump announces hostage, prisoner exchange between Israel and Hamas\r\n</li><li>How much of a role did Trump play in the latest Israel-Hamas peace deal?\r\n</li><li>National Guard troops set to d… [+4684 chars]", "url": "https://abcnews.go.com/US/video/monarch-butterfly-gets-wing-transplant-continues-migration-126352326", "source": "ABC News", "published_at": "2025-10-09T05:57:02Z", "relevance_score": 0.005000000000000001}, {"title": "El-Sisi and Trump to chair Gaza summit in Egypt on Monday", "description": "Leaders from more than 20 countries to attend meeting in Egypt's Sharm el-Sheikh, Egyptian presidency says.", "content": "Donald Trump and Egyptian President Abdel Fattah el-Sisi will chair an international summit to discuss the US presidents proposal to end Israels war on Gaza in Sharm el-Sheikh on Monday.\r\nThe meeting… [+6516 chars]", "url": "https://www.aljazeera.com/news/2025/10/11/el-sisi-and-trump-to-chair-gaza-summit-in-egypt-on-monday", "source": "Al Jazeera English", "published_at": "2025-10-11T22:53:44Z", "relevance_score": 0.005000000000000001}, {"title": "WATCH: Illinois governor responds to Trump's call to jail Democratic leaders", "description": "Illinois Gov. JB Pritzker responded after President Donald Trump called for his jailing in a social media post claiming Pritzker and Chicago Mayor Brandon Johnson have failed to protect ICE officers.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Rabbi reflects on Oct. 7 annive… [+4426 chars]", "url": "https://abcnews.go.com/US/video/illinois-governor-responds-trumps-call-jail-democratic-leaders-126343677", "source": "ABC News", "published_at": "2025-10-08T20:21:02Z", "relevance_score": 0.0}, {"title": "WATCH: Bystanders help lift helicopter after crash in Sacramento", "description": "New video shows drivers racing to lift a medical helicopter that crashed Monday night on a busy Sacramento highway.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Rabbi reflects on Oct. 7 annive… [+4426 chars]", "url": "https://abcnews.go.com/US/video/bystanders-lift-helicopter-after-crash-sacramento-126343225", "source": "ABC News", "published_at": "2025-10-08T20:13:57Z", "relevance_score": 0.0}, {"title": "WATCH: Air traffic controller shortages amid shutdown lead to canceled flights, delays", "description": "Flight delays and cancellations are climbing as sick calls involving air traffic controllers leave a number of airport towers and control facilities without enough staff to handle all flights.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Man arrested, faces federal cha… [+4400 chars]", "url": "https://abcnews.go.com/US/video/air-traffic-controller-shortages-amid-shutdown-lead-canceled-126339446", "source": "ABC News", "published_at": "2025-10-08T19:08:39Z", "relevance_score": 0.0}, {"title": "5 things to know for Oct. 10: Government shutdown, Gaza ceasefire plan, Nobel Peace Prize, Letitia James, Philippines quake", "description": "CNN’s 5 Things AM brings you the news you need to know every morning.", "content": "Travelers waiting in airport security lines across the US will now be met with a new video blaming Democratic lawmakers for the government shutdown. Its a notable departure from standard practice, as… [+5601 chars]", "url": "https://www.cnn.com/2025/10/10/us/5-things-to-know-for-oct-10-government-shutdown-gaza-ceasefire-plan-nobel-peace-prize-letitia-james-philippines-quake", "source": "CNN", "published_at": "2025-10-10T10:35:04Z", "relevance_score": 0.0}, {"title": "A decolonised alternative to Trump’s Gaza peace plan", "description": "Only a decolonised plan centred on Palestinian sovereignty can bring lasting peace to Gaza.", "content": "United States President Donald Trumps 20-point Gaza peace plan offers some constructive proposals on hostages, humanitarian aid, and reconstruction. Yet it is marred by an unmistakable colonial frame… [+8883 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/8/a-decolonised-alternative-to-trumps-gaza-peace-plan", "source": "Al Jazeera English", "published_at": "2025-10-08T13:13:17Z", "relevance_score": 0.0}, {"title": "WATCH: Farmer finds NASA equipment in neighbor’s wheat field", "description": "A woman in rural West Texas says she was caught by surprise when she spotted a car-sized piece of scientific equipment that was adorned with NASA stickers.", "content": "<ul><li>Joe Biden undergoing radiation therapy for prostate cancer treatment\r\n</li><li>Nor'easter develops as East Coast set for impact\r\n</li><li>Official shares new details on deadly explosion in Te… [+4466 chars]", "url": "https://abcnews.go.com/US/video/farmer-finds-nasa-equipment-neighbors-wheat-field-126431956", "source": "ABC News", "published_at": "2025-10-11T18:25:10Z", "relevance_score": 0.0}, {"title": "Snubbed by Nobel, Trump to head to Middle East to celebrate Gaza ‘peace’", "description": "White House decries Nobel Committee's decision not to hand Peace Prize to Donald Trump after Gaza ceasefire deal.", "content": "United States President Donald Trump is heading to the Middle East on Sunday as he looks to assert his perceived role as a peacemaker in the region after the Gaza ceasefire deal.\r\nThe visit would com… [+3589 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/snubbed-by-nobel-trump-to-head-to-middle-east-to-celebrate-gaza-peace", "source": "Al Jazeera English", "published_at": "2025-10-10T15:32:15Z", "relevance_score": 0.0}, {"title": "WATCH: Near-supermoon lights up American skies", "description": "Time-lapse imagery captured the nearly full moon, a forerunner to the harvest supermoon, rising and setting over U.S. cities.", "content": "<ul><li>Government shutdown's impact on air traffic controllers\r\n</li><li>Parties no closer to deal to end government shutdown\r\n</li><li>Standoff over National Guard intensifies\r\n</li><li>Medical hel… [+4389 chars]", "url": "https://abcnews.go.com/US/video/supermoon-lights-american-skies-126288444", "source": "ABC News", "published_at": "2025-10-07T13:17:22Z", "relevance_score": 0.0}, {"title": "WATCH: London police dismantle international phone theft gang", "description": "Police in London have made dozens of arrests linked to a criminal gang who are alleged to have smuggled 40,000 stolen mobile phones from the U.K. to China.", "content": "<ul><li>Air traffic control shortages worsen as shutdown drags on\r\n</li><li>James Comey to be arraigned Wednesday\r\n</li><li>Former surgeon generals warn US about RFK Jr.\r\n</li><li>Tropical Storm Jerr… [+4442 chars]", "url": "https://abcnews.go.com/International/video/london-police-dismantle-international-phone-theft-gang-126320757", "source": "ABC News", "published_at": "2025-10-08T11:02:28Z", "relevance_score": 0.0}, {"title": "WATCH: Former NFL QB Mark Sanchez facing felony charge after physical altercation", "description": "Former NFL QB Mark Sanchez, who was arrested following a physical altercation this weekend, is now facing a felony charge of battery involving serious bodily injury, prosecutors in Indianapolis said.", "content": "<ul><li>Government shutdown's impact on air traffic controllers\r\n</li><li>Parties no closer to deal to end government shutdown\r\n</li><li>Standoff over National Guard intensifies\r\n</li><li>Medical hel… [+4389 chars]", "url": "https://abcnews.go.com/US/video/former-nfl-qb-mark-sanchez-facing-felony-charge-126288356", "source": "ABC News", "published_at": "2025-10-07T13:12:06Z", "relevance_score": 0.0}, {"title": "Celebrate the ceasefire, but don’t forget: Gaza survived on its own", "description": "Western leaders now claim credit for 'peace', but Gaza’s survival belongs to its people alone.", "content": "On November 7, 2023, children stood before cameras at al-Shifa Hospital and spoke in English, not their mother tongue, but in the language of those they thought might save them. We want to live, we w… [+7437 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/9/celebrate-the-ceasefire-but-dont-forget-gaza-survived-on-its-own", "source": "Al Jazeera English", "published_at": "2025-10-09T19:27:56Z", "relevance_score": 0.0}, {"title": "Farah and Myriam: Childhood Under Siege in Gaza", "description": "Two years on, Gaza’s children still bear the scars of war — Farah fears the night, Myriam survived the rubble.", "content": "Meet Farah and Myriam two young girls from Gaza.\r\nFor Farah, night means fear a reminder of loved ones killed in the darkness.\r\nFor Myriam, her home was destroyed, taking her mother and sister. Her a… [+557 chars]", "url": "https://www.aljazeera.com/video/digidocs/2025/10/7/aje-onl-farahandmyriam_digidocs-071025", "source": "Al Jazeera English", "published_at": "2025-10-07T10:49:44Z", "relevance_score": 0.0}]}