{"timestamp": 1760322354.9994931, "data": {"url": "https://timesofindia.indiatimes.com/world/pakistan/kabul-accuses-islamabad-of-strikes-pakistan-warns-of-action-against-militants/articleshow/124466403.cms", "title": "Kabul accuses Islamabad of strikes, Pakistan warns of action against militants", "text": "Kabul accuses Islamabad of strikes\n\nPakistan Panics After Taliban Issues Warning, Accuses India of Using Afghanistan Soil for Terror\n\n\n\n\n\nISLAMABAD/KABUL: Afghanistan's Taliban government accused Pakistan on Friday of carrying out airstrikes on its territory and warned of \"consequences\" as Islamabad said it was taking action against militants. A blast struck before 10 pm local time on Thursday in the Abdul Haq Square area of Kabul, close to several ministries and the national intelligence agency. Security forces sealed off the site.Eleven more Pakistani soldiers were killed on Friday in a clash with Islamist militants in the Tirah area close to Afghan border, according to Pakistan officials. Islamabad says militants of the Tehreek-e-Taliban Pakistan group operate from Afghanistan, a charge denied by Kabul.Eleven military personnel were killed in clashes with TTP militants in Khyber Pakhtunkhwa's Orakzai district earlier this week. On Friday, Pakistan army claimed to have killed 30 Taliban terrorists involved in this attack.The Taliban government blamed Pakistan for airstrikes in Kabul, the capital, late on Thursday and in the eastern province of Paktika around midnight. \"This is an unprecedented, violent act in the history of Afghanistan and Pakistan,\" Afghan defence ministry said.\"If the situation escalates, the consequences will be the responsibility of the Pakistani military.\"According to the Taliban, there were no casualties from the airstrikes. A Pakistani security official said a vehicle used by the leader of the TTP, Noor Wali Mehsud, was targeted. It was unclear if he survived. The Afghan defence ministry declined to answer questions about Mehsud, pointing to its statement, which did not mention him.Islamabad has said its patience with Kabul is running out. Lieutenant General Ahmed Sharif Chaudhry, the Pakistani military spokesman, \"noted\" the reports of strikes. \"To protect the lives of the people of Pakistan, we are doing, and will continue to do, whatever is necessary,\" he said at a presser. \"Our demand to Kabul: Your land must not be used for terrorism against Pakistan.\"", "authors": ["Agencies"], "published_date": null, "top_image": "https://static.toiimg.com/thumb/msid-124466405,width-1070,height-580,imgsize-824710,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "summary": "Kabul accuses Islamabad of strikesPakistan Panics After Taliban Issues Warning, Accuses India of Using Afghanistan Soil for TerrorISLAMABAD/KABUL: Afghanistan's Taliban government accused Pakistan on Friday of carrying out airstrikes on its territory and warned of \"consequences\" as Islamabad said it was taking action against militants.\nIslamabad says militants of the Tehreek-e-Taliban Pakistan group operate from Afghanistan, a charge denied by Kabul.Eleven military personnel were killed in clashes with TTP militants in Khyber Pakhtunkhwa's Orakzai district earlier this week.\nOn Friday, Pakistan army claimed to have killed 30 Taliban terrorists involved in this attack.The Taliban government blamed Pakistan for airstrikes in Kabul, the capital, late on Thursday and in the eastern province of Paktika around midnight.\n\"This is an unprecedented, violent act in the history of Afghanistan and Pakistan,\" Afghan defence ministry said.\n\"Our demand to Kabul: Your land must not be used for terrorism against Pakistan.\"", "keywords": ["warns", "islamabad", "militants", "afghan", "accuses", "pakistan", "airstrikes", "taliban", "pakistani", "killed", "action", "strikes", "kabul", "afghanistan"], "success": true, "error": null}}