{"timestamp": 1760322350.601429, "data": [{"title": "Chances of war with India are real, says Pakistan's Defence Minister; vows to 'achieve better result than before'", "description": "Pakistan's Defence Minister Khawaja Asif has once again resorted to aggressive rhetoric against India, saying that the \"chances of war with India are real\" and claiming he was \"not denying that possibility.\"", "content": "Islamabad [Pakistan], Pakistan's Defence Minister Khawaja Asif has once again resorted to aggressive rhetoric against India, saying that the \"chances of war with India are real\" and claiming he was \"… [+3263 chars]", "url": "https://economictimes.indiatimes.com/news/defence/chances-of-war-with-india-are-real-says-pakistans-defence-minister-vows-to-achieve-better-result-than-before/articleshow/124382414.cms", "source": "The Times of India", "published_at": "2025-10-08T09:14:22Z", "relevance_score": 0.81}, {"title": "'Ask the Soviets and NATO': Afghan FM warns Pakistan from Indian soil after cross-border attacks", "description": "Pakistan's recent aggression against Afghanistan, occurring while the Afghan foreign minister visited India, has strained Kabul-Islamabad ties. Afghan officials condemned the attacks, emphasizing their nation's independence and desire for peace, pushing Kabul…", "content": "Pakistan has overplayed its hand by attacking Afghanistan when Afghan foreign minister Amir Khan Muttaqi was in India on an official visit. Islamabad's missteps are pushing Kabul closer to New Delhi.… [+1720 chars]", "url": "https://economictimes.indiatimes.com/news/defence/ask-the-soviets-and-nato-afghan-fm-warns-pakistan-from-indian-soil-after-cross-border-attacks/articleshow/124485027.cms", "source": "The Times of India", "published_at": "2025-10-11T17:06:03Z", "relevance_score": 0.78}, {"title": "Man arrested from Alwar for allegedly spying for Pakistan", "description": "A man from Rajasthan's Alwar district, Mangat Singh, has been arrested for allegedly spying for Pakistan's ISI. He reportedly shared sensitive Indian military information, including troop movements, with a Pakistani handler via social media and received over …", "content": "Police have arrested a man from Alwar district of Rajasthan on charges of spying for Pakistan's intelligence agency ISI.The accused, Mangat Singh, was produced before a special court in Jaipur on Sat… [+1664 chars]", "url": "https://economictimes.indiatimes.com/news/india/man-arrested-from-alwar-for-allegedly-spying-for-pakistan/articleshow/124474848.cms", "source": "The Times of India", "published_at": "2025-10-11T09:47:48Z", "relevance_score": 0.6799999999999999}, {"title": "Kabul accuses Islamabad of strikes, Pakistan warns of action against militants", "description": "Pakistan News: ISLAMABAD/KABUL: Afghanistan's Taliban government accused Pakistan on Friday of carrying out airstrikes on its territory and warned of \\\"consequences\\\" .", "content": "Follow Us On Social Media\r\nSC questions HC order for SIT probe into Karur stampedeIsraeli military says ceasefire is in effect in GazaNo women journo at minister's presserRepatriate pregnant woman: B… [+1338 chars]", "url": "https://timesofindia.indiatimes.com/world/pakistan/kabul-accuses-islamabad-of-strikes-pakistan-warns-of-action-against-militants/articleshow/124466403.cms", "source": "The Times of India", "published_at": "2025-10-10T21:52:44Z", "relevance_score": 0.6699999999999999}, {"title": "Pakistan conveys concerns to Kabul envoy over India-Afghanistan joint statement", "description": "Pakistan has lodged a protest with Afghanistan's Ambassador over the India-Afghanistan joint statement's reference to Jammu and Kashmir. Islamabad also rejected Afghan Foreign Minister Muttaqi's remarks on terrorism, asserting that Afghan soil is used against…", "content": "Pakistan has conveyed its reservations to Afghanistan's Ambassador in Islamabad over \"elements of the India-Afghanistan joint statement.\" Islamabad expressed objections to the mention of Jammu and Ka… [+3553 chars]", "url": "https://economictimes.indiatimes.com/news/india/pakistan-conveys-concerns-to-kabul-envoy-over-india-afghanistan-joint-statement/articleshow/124492432.cms", "source": "The Times of India", "published_at": "2025-10-12T01:07:55Z", "relevance_score": 0.655}, {"title": "Pakistan and India: What’s the global cost of natural disasters?", "description": "Floods in Pakistan and India re-ignite the debate on the mounting cost of global disasters.", "content": "Floods in Pakistan and India re-ignite the debate on the mounting cost of global disasters.Global natural disasters are striking harder and more often, with climate emergencies now breaking records y… [+447 chars]", "url": "https://www.aljazeera.com/video/counting-the-cost/2025/10/10/pakistan-and-india-whats-the-global-cost-of-natural-disasters", "source": "Al Jazeera English", "published_at": "2025-10-10T16:15:00Z", "relevance_score": 0.625}, {"title": "US-Pakistan bromance: A Trump phase or a new reality for India and the region?", "description": "Donald Trump's focus on Pakistan is reshaping US foreign policy. This shift impacts India's standing and regional stability. Pakistan's army chief is actively seeking to please Trump.", "content": "Donald Trump's tilt towards Pakistan is undeniable. The US president finds the country's leadership useful for his plans in West Asia, amenable to his extractive tendencies, and ready to rush in wher… [+4652 chars]", "url": "https://economictimes.indiatimes.com/opinion/et-commentary/us-pakistan-bromance-a-trump-phase-or-a-new-reality-for-india-and-the-region/articleshow/124369863.cms", "source": "The Times of India", "published_at": "2025-10-07T18:01:01Z", "relevance_score": 0.625}, {"title": "Pakistan Army warns terrorists and their facilitators, rejects dialogue with them", "description": "Pakistan Army spokesman Lt Gen Ahmad Sharif Chaudhry rejected talks with terrorists, attributing the rise in militancy in Khyber Pakhtunkhwa to a deliberate plan and governance failures. He highlighted the provincial government's shortcomings in implementing …", "content": "The Pakistan Army on Friday issued a stern warning to terrorists and their facilitators, rejecting the idea of engaging in talks with them to resolve the issue of militancy in the country.Addressing … [+3614 chars]", "url": "https://economictimes.indiatimes.com/news/defence/pakistan-army-warns-terrorists-and-their-facilitators-rejects-dialogue-with-them/articleshow/124455423.cms", "source": "The Times of India", "published_at": "2025-10-10T13:21:19Z", "relevance_score": 0.625}, {"title": "Trump claims his tariff power helped avert India-Pakistan war, says “seven planes were shot down”", "description": "US President Donald J. Trump asserted his tariff authority averted seven wars. He specifically mentioned preventing a major India-Pakistan conflict during Operation Sindoor. India has consistently rejected foreign intervention claims. New Delhi maintains its …", "content": "US President Donald J. Trump on Monday (local time) said that his power to impose tariffs prevented seven 'raging wars', including a major conflict between India and Pakistan during the recent Operat… [+2187 chars]", "url": "https://economictimes.indiatimes.com/news/india/trump-claims-his-tariff-power-helped-avert-india-pakistan-war-says-seven-planes-were-shot-down/articleshow/124350880.cms", "source": "The Times of India", "published_at": "2025-10-07T00:49:41Z", "relevance_score": 0.625}, {"title": "UN rights body orders probe into human rights in Afghanistan, with a focus on women and girls", "description": "The U.N.’s top human rights body has agreed to set up an ongoing probe of human rights violations in Afghanistan under the Taliban, including against women and girls, in a measure pushed for by the European Union", "content": "GENEVA -- GENEVA (AP) The U.N.'s top human rights body agreed Monday to set up an ongoing probe of human rights violations in Afghanistan under the Taliban, including against women and girls, in a me… [+1643 chars]", "url": "https://abcnews.go.com/International/wireStory/rights-body-orders-probe-human-rights-afghanistan-focus-126243886", "source": "ABC News", "published_at": "2025-10-06T10:45:24Z", "relevance_score": 0.62}, {"title": "‘I felt silenced’: Meesha Shafi and Pakistan’s backlash against #MeToo", "description": "When the singer became the face of the movement in Pakistan, the public reaction was instant and ferocious.", "content": "When I spoke to singer and actor Meesha Shafi in July this year, it had been six years since our first meeting. Then, Meesha had been in Karachi for a taping of Pepsis Battle of the Bands, where she … [+17673 chars]", "url": "https://www.aljazeera.com/features/2025/10/11/i-felt-silenced-meesha-shafi-and-pakistans-backlash-against-metoo", "source": "Al Jazeera English", "published_at": "2025-10-11T07:53:04Z", "relevance_score": 0.615}, {"title": "Nobel Peace Prize 2025: What are Trump’s credentials, and can he win?", "description": "With the Gaza ceasefire deal, Trump claims to have helped broker peace in eight wars. Do his assertions hold up?", "content": "As the Norwegian Nobel Committee prepares to announce this years winner of the Nobel Peace Prize, one name, one persona hovers over its decision the United States president, Donald Trump.\r\nSince step… [+11807 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/nobel-peace-prize-2025-what-are-trumps-credentials-and-can-he-win", "source": "Al Jazeera English", "published_at": "2025-10-09T10:39:50Z", "relevance_score": 0.585}, {"title": "Future of India-Afghanistan relations is very bright: Afghan Foreign Minister Amir Khan Muttaqi", "description": "Afghanistan's Foreign Minister Amir Khan Muttaqi received a warm welcome at Darul Uloom Deoband, expressing optimism for \"very bright\" India-Afghanistan relations. The visit aims to bolster economic, security, and cultural cooperation, building on India's dev…", "content": "Afghanistan's Foreign Minister Amir Khan Muttaqi on Saturday received a warm welcome during his visit to Darul Uloom Deoband in Saharanpur, Uttar Pradesh. Speaking exclusively with ANI, he highlighte… [+3764 chars]", "url": "https://economictimes.indiatimes.com/news/india/future-of-india-afghanistan-relations-is-very-bright-afghan-foreign-minister-amir-khan-muttaqi/articleshow/124473463.cms", "source": "The Times of India", "published_at": "2025-10-11T08:38:55Z", "relevance_score": 0.535}, {"title": "Afghan foreign minister visits Darul Uloom Deoband Islamic seminary, says hopeful of stronger ties with India", "description": "Afghan Foreign Minister Amir Khan Muttaqi expressed optimism for stronger India-Afghanistan ties during his visit to Darul Uloom Deoband. He thanked the people for their warm reception and announced plans to send new diplomats to India, hoping for frequent fu…", "content": "Saharanpur (UP): Afghan Foreign Minister Amir Khan Muttaqi on Saturday voiced confidence that the India-Afghanistan ties will grow stronger in future as he thanked the people for the welcome he recei… [+2212 chars]", "url": "https://economictimes.indiatimes.com/news/india/afghan-foreign-minister-visits-darul-uloom-deoband-islamic-seminary-says-hopeful-of-stronger-ties-with-india/articleshow/124475895.cms", "source": "The Times of India", "published_at": "2025-10-11T10:34:09Z", "relevance_score": 0.525}, {"title": "Donald Trump's flip-flops on Pakistan: Take the cake or the rare earth", "description": "Donald Trump's relationship with Pakistan has been a perplexing flip-flop, marked by initial hostility and later overtures. Despite promises to free Dr. Shakil Afridi, he remains imprisoned. Recent Pakistani overtures, including rare earth elements and praise…", "content": "Shakha Pola designs for Bengali women", "url": "https://timesofindia.indiatimes.com/world/us/donald-trumps-flip-flops-on-pakistan-take-the-cake-or-the-rare-earth/articleshow/124375484.cms", "source": "The Times of India", "published_at": "2025-10-08T03:07:28Z", "relevance_score": 0.515}, {"title": "Militant attack on Pakistani police station kills at least 7 officers and wounds 13", "description": "Pakistani police say at least seven officers and six militants were killed after gunmen attacked a police training center in the country's northwest", "content": "PESHAWAR, Pakistan -- PESHAWAR, Pakistan (AP) At least seven police officers and six militants were killed after gunmen attacked a police training center in northwestern Pakistan, triggering a fierce… [+2525 chars]", "url": "https://abcnews.go.com/International/wireStory/militant-attack-pakistani-police-station-kills-7-officers-126424094", "source": "ABC News", "published_at": "2025-10-11T06:43:45Z", "relevance_score": 0.505}, {"title": "'Heavy clashes' at Afghanistan-Pakistan border: Taliban forces", "description": "Taliban forces launched armed reprisals against Pakistani soldiers along the shared border, accusing Islamabad of carrying out air strikes on Afghan soil. The Afghan military stated that in retaliation for Pakistani air strikes, Taliban forces engaged in heav…", "content": "Afghanistan's Taliban forces launched armed reprisals against Pakistani soldiers along the shared border on Saturday, accusing Islamabad of carrying out air strikes on its soil, senior officials from… [+2993 chars]", "url": "https://economictimes.indiatimes.com/news/defence/heavy-clashes-at-afghanistan-pakistan-border-taliban-forces/articleshow/124492461.cms", "source": "The Times of India", "published_at": "2025-10-12T01:12:26Z", "relevance_score": 0.505}, {"title": "Trump's pursuing a multi-purpose project in Pakistan hoping for RoI, but...", "description": "Donald Trump's focus on Pakistan differs from past US policy.  This strategy faces hurdles in mining projects and its deepening ties with China.  Pakistan's role as an Islamic world ally and an irritant to India presents further complexities.  The article que…", "content": "Donald Trump is the first US president after Richard Nixon to bet so big on Pakistan. The latter had his reasons, as embedded in the Cold War-era Kissinger doctrine to build a secret bridge with Chin… [+5462 chars]", "url": "https://economictimes.indiatimes.com/opinion/et-commentary/trumps-pursuing-a-multi-purpose-project-in-pakistan-hoping-for-roi-but-/articleshow/124345595.cms", "source": "The Times of India", "published_at": "2025-10-06T17:23:32Z", "relevance_score": 0.5}, {"title": "How to find and defeat Mother of Thorns in Fortnite", "description": "Fortnitemares brings Doja Cat as the formidable Mother of Thorns boss. Players can find her at Freaky Fields, Gourdy Gate, or Supernova Academy, marked by a skull icon. Defeating her yields the Mythic Thorn Ripper and makes her a temporary ally. This mini-bos…", "content": "<ul><li>News</li>\r\n<li>How to find and defeat Mother of Thorns in Fortnite</li></ul>\r\nFortnitemares brings Doja Cat as the formidable Mother of Thorns boss. Players can find her at Freaky Fields, Gou… [+3453 chars]", "url": "https://timesofindia.indiatimes.com/sports/esports/fortnite/how-to-find-and-defeat-mother-of-thorns-in-fortnite/articleshow/124449311.cms", "source": "The Times of India", "published_at": "2025-10-10T09:27:09Z", "relevance_score": 0.5}, {"title": "Violence erupts in eastern Pakistan as Islamists try to march on capital for pro-Palestinian rally", "description": "Officials say violent clashes have erupted between police and Islamists in Pakistan’s eastern city of Lahore after security forces tried to stop thousands of demonstrators from leaving for the national capital, Islamabad where they planned to stage a p...", "content": "LAHORE, Pakistan -- LAHORE, Pakistan (AP) Violent clashes erupted Friday between police and Islamists in Pakistan's eastern city of Lahore after security forces tried to stop thousands of demonstrato… [+3009 chars]", "url": "https://abcnews.go.com/International/wireStory/violence-erupts-eastern-pakistan-islamists-march-capital-pro-126392967", "source": "ABC News", "published_at": "2025-10-10T10:37:39Z", "relevance_score": 0.5}, {"title": "Afghanistan vs Bangladesh 1st ODI UAE 2025 predictions, playing 11, live streaming, pitch report", "description": "Afghanistan and Bangladesh commence their three-match ODI series in Abu Dhabi on October 8, following Bangladesh's T20I whitewash. Afghanistan seeks redemption in the ODI format, aiming to leverage past successes against Bangladesh. Confident Bangladesh aims …", "content": "Afghanistan and Bangladesh will begin their three-match One Day International (ODI) series on Wednesday, October 8, at the Sheikh Zayed Cricket Stadium in Abu Dhabi. The series follows Bangladeshs 3-… [+4235 chars]", "url": "https://economictimes.indiatimes.com/news/sports/afghanistan-vs-bangladesh-1st-odi-uae-2025-predictions-playing-11-live-streaming-pitch-report/articleshow/124383364.cms", "source": "The Times of India", "published_at": "2025-10-08T10:12:44Z", "relevance_score": 0.5}, {"title": "CMPDI, GSI to explore rare earth metals in coal mines", "description": "The Central Mine Planning and Design Institute (CMPDI), in partnership with the Geological Survey of India (GSI), has developed a standard operating procedure for exploring rare earth elements in non-coal mine strata. CMPDI will soon inaugurate a laboratory t…", "content": "The Central Mine Planning and Design Institute (CMPDI), in partnership with the Geological Survey of India (GSI), has developed a standard operating procedure for exploring rare earth elements in non… [+1808 chars]", "url": "https://timesofindia.indiatimes.com/city/ranchi/cmpdi-gsi-to-explore-rare-earth-metals-in-coal-mines/articleshow/124461076.cms", "source": "The Times of India", "published_at": "2025-10-10T17:20:56Z", "relevance_score": 0.5}, {"title": "Trump reiterates claim of settling India, Pakistan conflict; says unsure about getting Nobel Peace Prize", "description": "US President Donald Trump reiterated his claim of ending the conflict between India and Pakistan through trade and tariffs, while expressing uncertainty about winning the Nobel Peace Prize. Speaking during a meeting with Finnish President Alexander Stubb, Tru…", "content": "US President Donald Trump has repeated his claim of \"stopping\" the conflict between India and Pakistan through trade and tariffs, but said he \"doesn't know\" if he'll get the Nobel Peace Prize for set… [+2393 chars]", "url": "https://economictimes.indiatimes.com/news/international/global-trends/trump-reiterates-claim-of-settling-india-pakistan-conflict-says-unsure-about-getting-nobel-peace-prize/articleshow/124448968.cms", "source": "The Times of India", "published_at": "2025-10-10T08:42:05Z", "relevance_score": 0.5}, {"title": "Afghan Foreign Minister Amir Khan Muttaqi to visit Deoband on Saturday, Taj Mahal on Sunday", "description": "Afghanistan's Foreign Minister Amir Khan Muttaqi is visiting India. He will tour Darul Uloom Deoband in Uttar Pradesh on Saturday. On Sunday, he travels to Agra to visit the Taj Mahal. This marks the first visit by a senior Taliban minister since they took po…", "content": "Afghanistan's Foreign Minister Amir Khan Muttaqi will visit Deoband in Uttar Pradesh's Saharanpur district on Saturday and Agra on Sunday as part of his six-day India trip, officials said.According t… [+2239 chars]", "url": "https://economictimes.indiatimes.com/news/india/afghan-foreign-minister-amir-khan-muttaqi-to-visit-deoband-on-saturday-taj-mahal-on-sunday/articleshow/124470213.cms", "source": "The Times of India", "published_at": "2025-10-11T05:03:24Z", "relevance_score": 0.5}, {"title": "Pakistan carries out strikes in Kabul; former US envoy calls it ‘huge escalation’", "description": "Former US envoy Zalmay Khalilzad called Pakistan’s recent strikes in Kabul a “huge escalation” that poses serious risks and urged dialogue between Islamabad and Kabul instead of military action. He highlighted the role of both countries in supporting opposing…", "content": "Former US envoy Zalmay Khalilzad expressed concern over the strikes carried out by Pakistan in Kabul terming it as a \"huge escalation\" which poses dangerous risks. In a post on X on Friday, Khalilzad… [+2241 chars]", "url": "https://economictimes.indiatimes.com/news/defence/pakistan-carries-out-strikes-in-kabul-former-us-envoy-calls-it-huge-escalation/articleshow/124445976.cms", "source": "The Times of India", "published_at": "2025-10-10T06:13:34Z", "relevance_score": 0.49500000000000005}, {"title": "2025 Mahindra Thar facelift vs Maruti Suzuki Jimny: Price, features, specifications compared", "description": "The Mahindra Thar is more affordable at the entry level and more expensive at the top end compared to the Maruti Suzuki Jimny. At the higher end, the Thar LXT 4WD AT with the 2.2-litre diesel engine costs Rs 16.99 lakh, while the top-spec Jimny Alpha AT 4x4 i…", "content": "<ul><li>News</li>\r\n<li>Auto News</li>\r\n<li>Cars News</li>\r\n<li>2025 Mahindra Thar facelift vs Maruti Suzuki Jimny: Price, features, specifications compared</li></ul>\r\nThe Mahindra Thar is more afford… [+1905 chars]", "url": "https://timesofindia.indiatimes.com/auto/cars/2025-mahindra-thar-facelift-vs-maruti-suzuki-jimny-price-features-specifications-compared/articleshow/124444859.cms", "source": "The Times of India", "published_at": "2025-10-10T10:43:24Z", "relevance_score": 0.49500000000000005}, {"title": "Search Operations launched after Pakistan drones sighted along border in J-K’s Samba", "description": "India News: JAMMU: Security forces Saturday launched a search operation after two Pakistani drones were seen hovering over the forward border villages along the I.", "content": "<ul><li>News</li>\r\n<li>India News</li>\r\n<li>Search Operations launched after Pakistan drones sighted along border in J-Ks Samba</li></ul>\r\nFollow Us On Social Media\r\nCourt: File FIR against Santa Cru… [+1481 chars]", "url": "https://timesofindia.indiatimes.com/india/search-operations-launched-after-pakistan-drones-sighted-along-border-in-j-ks-samba/articleshow/124488948.cms", "source": "The Times of India", "published_at": "2025-10-11T18:54:48Z", "relevance_score": 0.49500000000000005}, {"title": "Afghanistan looks at India as a 'close friend', says country's foreign minister Muttaqi", "description": "During a bilateral meeting with India’s External Affairs Minister S. Jaishankar on Friday, Afghanistan’s Foreign Minister Amir Khan Muttaqi described India as a “close friend.” He highlighted India’s quick response to the recent earthquake and expressed a des…", "content": "Afghanistan's Foreign Minister Amir Khan Muttaqi, in a bilateral meeting with External Affairs Minister S Jaishankar on Friday, said that the country looks at India as a \"close friend.\" In the recent… [+2687 chars]", "url": "https://economictimes.indiatimes.com/news/india/afghanistan-looks-at-india-as-a-close-friend-says-countrys-foreign-minister-muttaqi/articleshow/124447181.cms", "source": "The Times of India", "published_at": "2025-10-10T07:13:12Z", "relevance_score": 0.49500000000000005}, {"title": "India backs economic ties with Afghanistan at Moscow talks", "description": "India, alongside other nations at Moscow Format Consultations, emphasized boosting economic and trade ties with Afghanistan. They also jointly condemned any military infrastructure deployment in Afghanistan or neighboring states, deeming it detrimental to reg…", "content": "Shakha Pola designs for Bengali women", "url": "https://timesofindia.indiatimes.com/business/india-business/india-backs-economic-ties-with-afghanistan-at-moscow-talks/articleshow/124374570.cms", "source": "The Times of India", "published_at": "2025-10-08T01:44:13Z", "relevance_score": 0.48500000000000004}, {"title": "Regional powers signal objection to US reclaiming Afghanistan’s Bagram base", "description": "A forum of regional countries, including India, voiced opposition to any foreign military infrastructure in Afghanistan.", "content": "Afghanistans regional neighbours, including India, have voiced a rare unified front by opposing foreign attempts to deploy military infrastructure in the country, as United States President Donald Tr… [+3314 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/regional-powers-signal-objection-to-us-reclaiming-afghanistans-bagram-base", "source": "Al Jazeera English", "published_at": "2025-10-08T12:22:27Z", "relevance_score": 0.4700000000000001}, {"title": "2025 Nobel Peace Prize awarded to Venezuela's Maria Corina Machado", "description": "Venezuelan opposition leader Maria Corina Machado was awarded the 2025 Nobel Peace Prize for fighting for democracy in her country.", "content": "The 2025 Nobel Peace Prize was awarded on Friday to Venezuelan political opposition leader Maria Corina Machado, \"for her tireless work promoting democratic rights for the people of Venezuela and for… [+3235 chars]", "url": "https://www.cbsnews.com/news/nobel-peace-prize-maria-corina-machado-venezuela-opposition-leader-2025/", "source": "CBS News", "published_at": "2025-10-10T09:11:11Z", "relevance_score": 0.4700000000000001}, {"title": "Main boxing karu aur khada woh ho saamne: Pakistan's Abrar Ahmed reveals Indian player he wants to punch", "description": "Pakistan spinner Abrar Ahmed revealed he would like to face India's Shikhar Dhawan in a boxing match, sparking mixed reactions online. The comment surfaced after the recent Asia Cup final, where India defeated Pakistan. This adds another layer to the intense …", "content": "Amid growing tensions between the India and Pakistan mens cricket teams, Pakistan spinner Abrar Ahmed has drawn attention once again, this time for remarks made off the field. In a recent appearance … [+1845 chars]", "url": "https://economictimes.indiatimes.com/news/new-updates/main-boxing-karu-aur-khada-woh-ho-saamne-pakistans-abrar-ahmed-reveals-indian-player-he-wants-to-punch/articleshow/124368706.cms", "source": "The Times of India", "published_at": "2025-10-07T17:15:46Z", "relevance_score": 0.4700000000000001}, {"title": "Landslide hits bus in northern India, killing 15, as rescue continues", "description": "The bus was travelling on a hilly stretch in Himachal Pradesh when a landslide struck after days of torrential rains.", "content": "At least 15 people have been killed after debris from a massive landslide hit a bus in Indias northern state of Himachal Pradesh, local authorities have said.\r\nThe bus was travelling on a hilly stret… [+2083 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/landslide-hits-bus-in-northern-india-killing-15-as-rescue-continues", "source": "Al Jazeera English", "published_at": "2025-10-08T06:10:21Z", "relevance_score": 0.4650000000000001}, {"title": "Afghanistan's Taliban foreign minister meeting with Indian counterpart", "description": "The foreign minister of Taliban-ruled Afghanistan is meeting with his Indian counterpart in a first high-level diplomatic engagement with New Delhi since the group seized power in 2021 after two decades of U.S. military presence", "content": "SRINAGAR, India -- SRINAGAR, India (AP) The foreign minister of Taliban -ruled Afghanistan is set to meet with his Indian counterpart Friday, in a first high-level diplomatic engagement with New Delh… [+4512 chars]", "url": "https://abcnews.go.com/International/wireStory/afghanistans-taliban-foreign-minister-meeting-indian-counterpart-time-126385675", "source": "ABC News", "published_at": "2025-10-10T03:18:55Z", "relevance_score": 0.4650000000000001}, {"title": "Landslide in northern India hits a bus, killing at least 15 people", "description": "At least 15 people have died after debris from a massive landslide hit a bus in India’s northern state of Himachal Pradesh", "content": "NEW DELHI -- NEW DELHI (AP) At least 15 people were killed late Tuesday after debris from a massive landslide hit a bus in Indias northern state of Himachal Pradesh, local authorities said.\r\nThe bus … [+1748 chars]", "url": "https://abcnews.go.com/International/wireStory/landslide-northern-india-hits-bus-killing-15-people-126316548", "source": "ABC News", "published_at": "2025-10-08T04:56:43Z", "relevance_score": 0.4650000000000001}, {"title": "Who was Sister Jean? Beloved Loyola University Chicago Chaplain dies at 104 after legendary career", "description": "Sister Jean, the beloved chaplain for Loyola University Chicago's men's basketball team, has passed away at 106. Renowned for her unwavering faith and inspiring presence, she became a national icon during the team's 2018 Final Four run. Her legacy extends bey…", "content": "<ul><li>News</li>\r\n<li>Sports News</li>\r\n<li>NBA News</li>\r\n<li>Who was Sister Jean? Beloved Loyola University Chicago Chaplain dies at 104 after legendary career</li></ul>\r\nSister Jean, the beloved … [+1901 chars]", "url": "https://timesofindia.indiatimes.com/sports/nba/top-stories/who-was-sister-jean-beloved-loyola-university-chicago-chaplain-dies-at-104-after-legendary-career/articleshow/124450870.cms", "source": "The Times of India", "published_at": "2025-10-10T10:10:10Z", "relevance_score": 0.4650000000000001}, {"title": "John Cena lands in Perth alongside Shay Shariatzadeh as WWE Crown Jewel run against AJ Styles takes center stage", "description": "WWE's Crown Jewel event in Perth, Australia, features a highly anticipated clash between John Cena and AJ Styles. This marks Cena's final international match before his retirement, adding significant excitement. The show boasts five matches, including champio…", "content": "<ul><li>News</li>\r\n<li>Sports News</li>\r\n<li>John Cena lands in Perth alongside Shay Shariatzadeh as WWE Crown Jewel run against AJ Styles takes center stage</li></ul>\r\nWWE's Crown Jewel event in Per… [+1899 chars]", "url": "https://timesofindia.indiatimes.com/sports/wwe/top-stories/john-cena-lands-in-perth-alongside-shay-shariatzadeh-as-wwe-crown-jewel-run-against-aj-styles-takes-center-stage/articleshow/124449569.cms", "source": "The Times of India", "published_at": "2025-10-10T09:17:34Z", "relevance_score": 0.4650000000000001}, {"title": "WWE Crown Jewel 2025: Start timings for US, UK, India, Saudi Arabia, Australia, Date, Venue, Streaming Options, and More", "description": "WWE Crown Jewel 2025 is set to be a major event in Perth, Australia, on October 11th. The show features top stars like John Cena, AJ Styles, Roman Reigns, and Seth Rollins in several high-profile matches. Fans worldwide can tune in through various streaming o…", "content": "<ul><li>News</li>\r\n<li>Sports News</li>\r\n<li>WWE Crown Jewel 2025: Start timings for US, UK, India, Saudi Arabia, Australia, Date, Venue, Streaming Options, and More</li></ul>\r\nWWE Crown Jewel 2025 i… [+1872 chars]", "url": "https://timesofindia.indiatimes.com/sports/wwe/top-stories/wwe-crown-jewel-2025-start-timings-for-us-uk-india-saudi-arabia-australia-date-venue-streaming-options-and-more/articleshow/124410591.cms", "source": "The Times of India", "published_at": "2025-10-09T09:41:13Z", "relevance_score": 0.4650000000000001}, {"title": "Rescuers in India search for missing after landslides kill 24 in Darjeeling region", "description": "Rescuers are scouring India's tea-growing hill district of Darjeeling in the search for several missing people", "content": "NEW DELHI -- NEW DELHI (AP) Rescuers were scouring India's northeastern tea-growing hill district of Darjeeling on Monday for those reported missing a day after landslides triggered by heavy downpour… [+2338 chars]", "url": "https://abcnews.go.com/International/wireStory/rescuers-india-search-missing-after-landslides-kill-24-126241963", "source": "ABC News", "published_at": "2025-10-06T10:21:23Z", "relevance_score": 0.4650000000000001}, {"title": "Gunmen attack house of worship of minority sect in Pakistan, wounding 6 worshippers", "description": "At least three gunmen have attacked a main house of worship of the Ahmadi sect in eastern Pakistan, wounding six worshippers", "content": "LAHORE, Pakistan -- LAHORE, Pakistan (AP) At least three gunmen attacked a house of worship of the Ahmadi sect in eastern Pakistan on Friday, wounding six worshippers before guards killed one of the … [+1381 chars]", "url": "https://abcnews.go.com/International/wireStory/gunmen-attack-house-worship-minority-sect-pakistan-wounding-126399420", "source": "ABC News", "published_at": "2025-10-10T13:31:33Z", "relevance_score": 0.4650000000000001}, {"title": "“Man of the people” - Anthony Edwards earns heartwarming praise from NBA fans he tries to help a supporter from off the court", "description": "Minnesota Timberwolves star Anthony Edwards' playful advice to a fan struggling with dunk attempts during a game against the New York Knicks went viral, sparking humorous online reactions. While Edwards' encouragement didn't help the fan, the incident highlig…", "content": "<ul><li>News</li>\r\n<li>Sports News</li>\r\n<li>NBA News</li>\r\n<li>Man of the people - Anthony Edwards earns heartwarming praise from NBA fans he tries to help a supporter from off the court</li></ul>\r\n… [+3606 chars]", "url": "https://timesofindia.indiatimes.com/sports/nba/top-stories/man-of-the-people-anthony-edwards-earns-heartwarming-praise-from-nba-fans-he-tries-to-help-a-supporter-from-off-the-court/articleshow/124444324.cms", "source": "The Times of India", "published_at": "2025-10-10T04:42:51Z", "relevance_score": 0.4650000000000001}, {"title": "Elevate product innovation and user experience with ISB Online's AI-Focused Product Management Programme", "description": "Spotlight News: Artificial Intelligence powers voice assistants, facial recognition, and smarter decision-making, fueling innovation and seamless user experiences. Fo.", "content": "<ul><li>News</li>\r\n<li>Elevate product innovation and user experience with ISB Online's AI-Focused Product Management Programme</li></ul>\r\nFollow Us On Social Media\r\nIndia Restores Full Diplomatic Ti… [+3119 chars]", "url": "https://timesofindia.indiatimes.com/spotlight/elevating-product-innovation-and-user-experience-with-isb-executive-educations-ai-focused-product-management-programme/articleshow/118571875.cms", "source": "The Times of India", "published_at": "2025-10-10T09:46:49Z", "relevance_score": 0.4650000000000001}, {"title": "The Taliban are investigating an explosion in Kabul", "description": "The Taliban say an investigation is underway after an explosion in the Afghan capital, Kabul", "content": "KABUL, Afghanistan -- KABUL, Afghanistan (AP) Taliban authorities are investigating an explosion in the Afghan capital, Kabul, the government's chief spokesman said late Thursday.\r\nThe blast struck b… [+633 chars]", "url": "https://abcnews.go.com/International/wireStory/taliban-investigating-explosion-kabul-126380643", "source": "ABC News", "published_at": "2025-10-09T21:09:37Z", "relevance_score": 0.44000000000000006}, {"title": "Afghanistan to send diplomats to India: Muttaqi", "description": "Afghan Foreign Minister Amir Khan Muttaqi announced that Kabul will send diplomats to India to improve bilateral relations. He assured New Delhi that Afghan soil will not be used for activities detrimental to India's interests. This comes after extensive talk…", "content": "Afghan Foreign Minister Amir Khan Muttaqi on Friday said Kabul will send diplomats to India as part of step-by-step efforts to improve bilateral relations.Muttaqi made the significant announcement at… [+618 chars]", "url": "https://economictimes.indiatimes.com/news/economy/foreign-trade/kabul-afghanistan-to-send-diplomats-to-india-amir-khan-muttaqi/articleshow/124453581.cms", "source": "The Times of India", "published_at": "2025-10-10T11:56:14Z", "relevance_score": 0.43000000000000005}, {"title": "Taliban, Pakistani forces trade heavy fire along Afghanistan border", "description": "Clashes come as tensions escalate over an air strike on Kabul that the Taliban blames on Islamabad.", "content": "Taliban and Pakistani forces have exchanged fire across the Afghanistan-Pakistan border, prompting calls for restraint from Iran, Qatar and Saudi Arabia, as tensions escalate following an air strike … [+2921 chars]", "url": "https://www.aljazeera.com/news/2025/10/12/taliban-pakistani-forces-trade-heavy-fire-along-afghanistan-border", "source": "Al Jazeera English", "published_at": "2025-10-12T01:38:15Z", "relevance_score": 0.41500000000000004}, {"title": "Saudi Arabia calls for 'self-restraint' as clashes erupt along Pak-Afghan border", "description": "Tensions flare along the Pakistan-Afghanistan border. Clashes erupted after Afghan forces allegedly fired on Pakistani posts. Pakistan retaliated, targeting Afghan positions. Afghanistan claims Pakistani air strikes preceded the fighting. Saudi Arabia urges b…", "content": "The Saudi Arabian Ministry of Foreign Affairs (MOFA) has issued a statement in the backdrop of violent clashes along the border of Pakistan and Afghanistan, calling for \"self-restraint\" to avoid furt… [+4228 chars]", "url": "https://economictimes.indiatimes.com/news/defence/saudi-arabia-calls-for-self-restraint-as-clashes-erupt-along-pak-afghan-border/articleshow/124492297.cms", "source": "The Times of India", "published_at": "2025-10-12T00:49:47Z", "relevance_score": 0.41500000000000004}, {"title": "The Taliban government blames Pakistan for a strike on Kabul", "description": "The Taliban government accuses Pakistan of bombing Kabul and a market in eastern Afghanistan", "content": "ISLAMABAD -- ISLAMABAD (AP) The Taliban government on Friday blamed Pakistan for striking the Afghan capital and bombing a market in the country's east, accusing its neighbor of violating national ai… [+2774 chars]", "url": "https://abcnews.go.com/International/wireStory/taliban-government-blames-pakistan-strike-kabul-126395027", "source": "ABC News", "published_at": "2025-10-10T15:01:48Z", "relevance_score": 0.41000000000000003}, {"title": "Amit Shah holds review of law & order in J&K with top officials, asks them to be on alert", "description": "Home Minister Amit Shah has urged security forces to maintain 100% alert as winter approaches, warning of potential infiltration attempts by Pakistan and PoK-based terrorists exploiting snowfall. Reviewing the J&K security situation, Shah reiterated the gover…", "content": "<ul><li>News</li>\r\n<li>India News</li>\r\n<li>Amit Shah holds review of law &amp; order in J&amp;K with top officials, asks them to be on alert</li></ul>\r\nHome Minister Amit Shah has urged security for… [+3533 chars]", "url": "https://timesofindia.indiatimes.com/india/amit-shah-holds-review-of-law-order-in-jk-with-top-officials-asks-them-to-be-on-alert/articleshow/124441312.cms", "source": "The Times of India", "published_at": "2025-10-09T22:47:33Z", "relevance_score": 0.4}, {"title": "Afghan FM's historic visit to India underlines deep historical bonds & contemporary partnership", "description": "Afghanistan is looking to strengthen its bond with India. This comes as relations with Pakistan face significant strain. Mass deportations of Afghan refugees have fueled anti-Pakistan sentiment. Afghanistan has also expressed concerns over Pakistan's internal…", "content": "The historical neighbourly bonding between India and Afghanistan exists in the present day vibrant cultural ties between the people of the two countries. It has stood the test of time; India has been… [+3334 chars]", "url": "https://economictimes.indiatimes.com/news/india/afghan-fms-historic-visit-to-india-underlines-deep-historical-bonds-contemporary-partnership/articleshow/124378072.cms", "source": "The Times of India", "published_at": "2025-10-08T05:44:30Z", "relevance_score": 0.38}, {"title": "Top Army commanders review national security challenges at 2-day conclave", "description": "Indian Army commanders reviewed national security challenges along Pakistan and China borders, focusing on Operation Sindoor and the implications of suspending the Indus Water Treaty. The conclave also addressed boosting combat capabilities through AI, big da…", "content": "Top commanders of the Indian Army carried out a comprehensive review of national security challenges along the borders with Pakistan and China at a two-day conclave that concluded on Tuesday.Sources … [+1889 chars]", "url": "https://economictimes.indiatimes.com/news/defence/top-army-commanders-review-national-security-challenges-at-2-day-conclave/articleshow/124367928.cms", "source": "The Times of India", "published_at": "2025-10-07T16:18:30Z", "relevance_score": 0.38}, {"title": "Moscow format meeting calls for strengthening terror cooperation", "description": "The Moscow Format Consultations, with the Taliban present for the first time, called for enhanced counter-terrorism cooperation and urged Afghanistan's support in eradicating terrorism. Participants also opposed foreign military infrastructure in the region, …", "content": "The Moscow format meeting in the Russian capital on Tuesday in the presence of Taliban foreign minister for the first time called for strengthening counter-terrorism cooperation at both bilateral and… [+2556 chars]", "url": "https://economictimes.indiatimes.com/news/international/world-news/moscow-format-meeting-calls-for-strengthening-terror-cooperation/articleshow/124363729.cms", "source": "The Times of India", "published_at": "2025-10-07T13:27:39Z", "relevance_score": 0.375}, {"title": "Eight Indians, 10 firms face US sanctions over Iran oil link", "description": "America has sanctioned eight Indian individuals and ten companies. These actions are due to their involvement in trading Iranian oil. The US State Department and Treasury targeted numerous entities globally. Several Indian firms are accused of importing Irani…", "content": "<ul><li>News</li>\r\n<li>India News</li>\r\n<li>Eight Indians, 10 firms face US sanctions over Iran oil link</li></ul>\r\nAmerica has sanctioned eight Indian individuals and ten companies. These actions ar… [+2202 chars]", "url": "https://timesofindia.indiatimes.com/india/eight-indians-10-firms-face-us-sanctions-over-iran-oil-link/articleshow/124466169.cms", "source": "The Times of India", "published_at": "2025-10-10T20:57:23Z", "relevance_score": 0.375}, {"title": "Pakistan's hidden occupation: PoGB left voiceless under Islamabad's control", "description": "A political activist from Pakistan-occupied Gilgit Baltistan (PoGB) has accused Pakistan of exploiting the region's disputed status. Sherbaz Khan stated that Pakistan is denying the people constitutional rights, representation, and control over their land and…", "content": "On the sidelines of the 60th session of the United Nations Human Rights Council (UNHRC), in an exclusive interview with ANI, political activist from Pakistan-occupied Gilgit Baltistan (PoGB), Sherbaz… [+1961 chars]", "url": "https://economictimes.indiatimes.com/news/international/world-news/pakistans-hidden-occupation-pogb-left-voiceless-under-islamabads-control/articleshow/124410501.cms", "source": "The Times of India", "published_at": "2025-10-09T09:16:35Z", "relevance_score": 0.375}, {"title": "What is AIM-120 AMRAAM, the US advanced air-to-air missiles which may be received by Pakistan soon? Here's its capability, complete list of new buyers", "description": "What is AIM-120 AMRAAM, the US advanced air-to-air missiles? Pakistan may receive AIM-120 AMRAAM missiles under a $2.5 billion contract. These missiles are compatible with F-16 jets and are used by over 35 countries. Their deployment may enhance Pakistan's ai…", "content": "What is AIM-120 AMRAAM, the US advanced air-to-air missiles which may be received by Pakistan soon? Pakistan is set to acquire AIM-120 AMRAAM missiles, enhancing its F-16 fleet. This update details A… [+4611 chars]", "url": "https://economictimes.indiatimes.com/news/international/us/what-is-aim-120-amraam-the-us-advanced-air-to-air-missiles-which-may-be-received-by-pakistan-soon-here-its-capability-and-complete-list-of-buyers-2-5-billion-contract-compatible-with-f-16-jets-35-countries-pakistan-air-defense-missile-capabilities/articleshow/124371629.cms", "source": "The Times of India", "published_at": "2025-10-07T20:31:16Z", "relevance_score": 0.375}, {"title": "Ahead of Delhi meet, Taliban seek India’s recognition for Islamic Emirate", "description": "India News: The Taliban are seeking an upgrade of their relationship with India in the form of diplomatic recognition, as the Afghanistan foreign minister Amir Kh.", "content": "<ul><li>News</li>\r\n<li>India News</li>\r\n<li>Ahead of Delhi meet, Taliban seek Indias recognition for Islamic Emirate</li></ul>\r\nFollow Us On Social Media\r\nAmerica 360: Trump Calls For Democrat Govern… [+1538 chars]", "url": "https://timesofindia.indiatimes.com/india/ahead-of-delhi-meet-taliban-seek-indias-recognition-for-islamic-emirate/articleshow/124434189.cms", "source": "The Times of India", "published_at": "2025-10-09T18:33:45Z", "relevance_score": 0.37}, {"title": "Bigg Boss Telugu 9 preview: Nominations twist rises heat; Who wins the immunity this week?", "description": "Bigg Boss Telugu 9's latest promos reveal a unique nomination twist where all contestants, except the captain, are nominated and must compete for immunity. The \"BB bed\" task sees intense physical challenges and strategic alliances, leading to eliminations and…", "content": "<ul><li>News</li>\r\n<li>Bigg Boss Telugu 9 preview: Nominations twist rises heat; Who wins the immunity this week?</li></ul>\r\nBigg Boss Telugu 9's latest promos reveal a unique nomination twist where … [+1804 chars]", "url": "https://timesofindia.indiatimes.com/tv/news/telugu/bigg-boss-telugu-9-preview-nominations-twist-rises-heat-who-wins-the-immunity-this-week/articleshow/124450615.cms", "source": "The Times of India", "published_at": "2025-10-10T09:58:02Z", "relevance_score": 0.37}, {"title": "“I’d really love to play those guys” — Michael Jordan admits being envious of younger NBA stars who inspired his comeback", "description": "Michael Jordan's 2001 NBA comeback was fueled by more than just passion; he admitted envy towards rising stars like Kobe Bryant and Vince Carter. Jordan felt compelled to reclaim his spotlight and prove he could still compete with the league's new generation …", "content": "<ul><li>News</li>\r\n<li>Sports News</li>\r\n<li>NBA News</li>\r\n<li>Id really love to play those guys Michael Jordan admits being envious of younger NBA stars who inspired his comeback</li></ul>\r\nMichael… [+2063 chars]", "url": "https://timesofindia.indiatimes.com/sports/nba/top-stories/id-really-love-to-play-those-guys-michael-jordan-admits-being-envious-of-younger-nba-stars-who-inspired-his-comeback/articleshow/124461138.cms", "source": "The Times of India", "published_at": "2025-10-10T17:24:24Z", "relevance_score": 0.37}, {"title": "Afghanistan restricts access to social media on smartphones", "description": "Afghanistan is experiencing widespread restrictions on major social media platforms including Instagram, Facebook, and Snapchat, according to NetBlocks. Users report difficulties accessing these sites, with some experiencing complete outages or significantly …", "content": "Karwa Chauth 2025: Bollywood divas approved lehenga looks for the festival", "url": "https://timesofindia.indiatimes.com/world/south-asia/afghanistan-restricts-access-to-social-media-on-smartphones/articleshow/124408196.cms", "source": "The Times of India", "published_at": "2025-10-09T07:24:08Z", "relevance_score": 0.365}, {"title": "Explosions hit Kabul as Taliban make diplomatic push to India", "description": "Attacks come amid rising tensions with Islamabad, which accuses the Taliban of sheltering anti-Pakistan armed groups.", "content": "Islamabad, Pakistan A series of explosions and bursts of gunfire rattled Afghanistans capital late Thursday evening, according to local media. The cause of the blasts and the extent of casualties rem… [+7418 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/explosions-hit-kabul-as-taliban-make-diplomatic-push-to-india", "source": "Al Jazeera English", "published_at": "2025-10-10T09:35:55Z", "relevance_score": 0.35500000000000004}, {"title": "No to Trump: Why Afghanistan’s neighbours have opposed US Bagram plan", "description": "Regional powers gather in Moscow to discuss Afghanistan’s future, signalling a new phase of post-US diplomacy.", "content": "Islamabad, Pakistan  Seated next to British Prime Minister Keir Starmer during a visit to the United Kingdom in September, United States President Donald Trump made clear he was eyeing a plot of land… [+12861 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/no-to-trump-why-afghanistans-neighbours-have-opposed-us-bagram-plan", "source": "Al Jazeera English", "published_at": "2025-10-09T05:23:43Z", "relevance_score": 0.35000000000000003}, {"title": "Pakistani forces kill 30 militants after deadly ambush that killed soldiers", "description": "Pakistan's military says its security forces have killed 30 militants in multiple raids on Pakistani Taliban hideouts in the country's northwestern region where insurgents this week ambushed a security convoy, killing 11 soldiers", "content": "PESHAWAR, Pakistan -- PESHAWAR, Pakistan (AP) Pakistani security forces acting on intelligence killed 30 militants in multiple raids on Pakistani Taliban hideouts in the country's northwestern region… [+1954 chars]", "url": "https://abcnews.go.com/International/wireStory/pakistani-forces-kill-30-militants-after-deadly-ambush-126390427", "source": "ABC News", "published_at": "2025-10-10T07:27:33Z", "relevance_score": 0.35000000000000003}, {"title": "Foreign Minister Amir Khan Muttaqi's India visit set to open new chapter in Indo-Afghan ties", "description": "Agenda Talks with counterpart Jaishankar, business meetings and Deoband visit India secures Chabahar sanctions waiver till Oct 28", "content": "Acting Afghanistan foreign minister Amir Khan Muttaqi's first visit to India is expected to feature a broad mix of political, economic and cultural engagements during his nearly weeklong trip startin… [+2643 chars]", "url": "https://economictimes.indiatimes.com/news/india/amir-khan-muttaqis-india-visit-set-to-open-new-chapter-in-indo-afghan-ties/articleshow/124396366.cms", "source": "The Times of India", "published_at": "2025-10-08T18:28:56Z", "relevance_score": 0.35000000000000003}, {"title": "Dozens killed as Pakistani army, fighters clash near Afghan border", "description": "Pakistan Taliban claim responsibility for attack on military convoy, leading to a deadly gunfight.", "content": "Eleven military personnel have been killed in a gunfight with armed fighters in the countrys northwest, according to the Pakistani army.\r\nThe gun battle erupted early on Wednesday during an intellige… [+1144 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/dozens-killed-as-pakistani-army-fighters-clash-near-afghan-border", "source": "Al Jazeera English", "published_at": "2025-10-08T08:59:53Z", "relevance_score": 0.34500000000000003}, {"title": "Raipur: Man kills girlfriend over suspected infidelity; stages scene as suicide, arrested", "description": "Raipur police have arrested Durgesh Verma, 21, for allegedly murdering his 23-year-old girlfriend, Priyanka Das, at her rented room. Verma, suspecting infidelity after an argument, stabbed Das and attempted to stage the scene as a suicide. Police apprehended …", "content": "Raipur police have arrested Durgesh Verma, 21, for allegedly murdering his 23-year-old girlfriend, Priyanka Das, at her rented room. Verma, suspecting infidelity after an argument, stabbed Das and at… [+3370 chars]", "url": "https://timesofindia.indiatimes.com/city/raipur/raipur-man-kills-girlfriend-over-suspected-infidelity-stages-scene-as-suicide-arrested/articleshow/124451478.cms", "source": "The Times of India", "published_at": "2025-10-10T10:35:54Z", "relevance_score": 0.34500000000000003}, {"title": "María Machado’s academic journey: An engineer with a Nobel-winning democratic vision", "description": "María Corina Machado, a Venezuelan industrial engineer and opposition leader, has won the 2025 Nobel Peace Prize for her relentless fight for democracy against authoritarian rule. Her journey from academia to activism reflects a fusion of technical precision …", "content": "María Corina Machado, a Venezuelan industrial engineer and opposition leader, has won the 2025 Nobel Peace Prize for her relentless fight for democracy against authoritarian rule. Her journey from ac… [+1910 chars]", "url": "https://timesofindia.indiatimes.com/education/news/mara-machados-academic-journey-an-engineer-with-a-nobel-winning-democratic-vision/articleshow/124451436.cms", "source": "The Times of India", "published_at": "2025-10-10T10:32:58Z", "relevance_score": 0.34500000000000003}, {"title": "Army used AI in a 'big way' during Operation Sindoor", "description": "India News: NEW DELHI: The Army used artificial intelligence (AI) tools in a big way during Operation Sindoor against Pakistan to generate a common operational pi.", "content": "Navratri 2025: Shraddha Kapoor, Alia Bhatt, and other divas' inspired pink ethnic looks for day 9", "url": "https://timesofindia.indiatimes.com/india/army-used-ai-in-a-big-way-during-operation-sindoor/articleshow/124345398.cms", "source": "The Times of India", "published_at": "2025-10-06T17:14:41Z", "relevance_score": 0.34500000000000003}, {"title": "Indore: Lokayukta traps Janpad Panchayat CEO; accepts Rs 20,000 bribe", "description": "The Ujjain Lokayukta team apprehended Rajesh Soni, the Janpad Panchayat CEO of Tonk Khurd, for accepting a bribe of Rs 20,000. Soni was caught red-handed while receiving the payment from a Rojgar Sahayak who alleged the bribe was demanded for a transfer. The …", "content": "The Ujjain Lokayukta team apprehended Rajesh Soni, the Janpad Panchayat CEO of Tonk Khurd, for accepting a bribe of Rs 20,000. Soni was caught red-handed while receiving the payment from a Rojgar Sah… [+3370 chars]", "url": "https://timesofindia.indiatimes.com/city/indore/indore-lokayukta-traps-janpad-panchayat-ceo-accepts-rs-20000-bribe/articleshow/124449616.cms", "source": "The Times of India", "published_at": "2025-10-10T09:21:06Z", "relevance_score": 0.34500000000000003}, {"title": "Ranchi Hospital Bans 3,000 Contaminated Paracetamol Tablets After Patient Complaint", "description": "Ranchi's sadar hospital has banned approximately 3,000 paracetamol tablets and others due to fungal contamination. A patient reported finding black spots and fungus on tablets procured from the hospital pharmacy. The administration is taking this precautionar…", "content": "Ranchi's sadar hospital has banned approximately 3,000 paracetamol tablets and others due to fungal contamination. A patient reported finding black spots and fungus on tablets procured from the hospi… [+1826 chars]", "url": "https://timesofindia.indiatimes.com/city/ranchi/ranchi-hospital-bans-3000-contaminated-paracetamol-tablets-after-patient-complaint/articleshow/124461088.cms", "source": "The Times of India", "published_at": "2025-10-10T17:21:21Z", "relevance_score": 0.34500000000000003}, {"title": "JMM Seeks Strategic Alliance with RJD for Bihar Polls Amid Seat-Sharing Talks", "description": "Jharkhand Mukti Morcha (JMM) delegates have returned from Patna after seat-sharing discussions for the upcoming Bihar assembly elections. The party is hopeful for a 'respectable' deal within the RJD-led INDIA bloc, reportedly eyeing constituencies in border r…", "content": "Jharkhand Mukti Morcha (JMM) delegates have returned from Patna after seat-sharing discussions for the upcoming Bihar assembly elections. The party is hopeful for a 'respectable' deal within the RJD-… [+1907 chars]", "url": "https://timesofindia.indiatimes.com/city/ranchi/jmm-seeks-strategic-alliance-with-rjd-for-bihar-polls-amid-seat-sharing-talks/articleshow/124461268.cms", "source": "The Times of India", "published_at": "2025-10-10T17:26:02Z", "relevance_score": 0.34500000000000003}, {"title": "Students exhibit innovative products at TN Global Startup Summit in Coimbatore", "description": "The summit was a melting pot of innovation, with startup founders, enablers, and academicians in attendance.", "content": "The summit was a melting pot of innovation, with startup founders, enablers, and academicians in attendance.\r\nFollow Us On Social Media\r\nPutin Offers To Help Gaza, Aligns With Trumps Plan As Hamas, I… [+1605 chars]", "url": "https://timesofindia.indiatimes.com/city/coimbatore/students-exhibit-innovative-products-at-tn-global-startup-summit-in-coimbatore/articleshow/124461133.cms", "source": "The Times of India", "published_at": "2025-10-10T17:22:48Z", "relevance_score": 0.34500000000000003}, {"title": "What is the Nobel Peace Prize — and could Donald Trump get it?", "description": "The winner of the 2025 Nobel Peace Prize will be announced Friday. Here's what to know about the honor and President Trump's interest.", "content": "Barack Obama. Jimmy Carter. Woodrow Wilson. Teddy Roosevelt. Al Gore. And Donald Trump?\r\nPresident Trump hopes to join the exclusive list of presidents and vice presidents who have received one of th… [+8230 chars]", "url": "https://www.cbsnews.com/news/nobel-peace-prize-donald-trump-what-to-know/", "source": "CBS News", "published_at": "2025-10-08T09:00:05Z", "relevance_score": 0.34500000000000003}, {"title": "Rohtak SP, accused of abetting IPS officer’s suicide, shunted", "description": "India News: Saini: Will spare none, irrespective of their influence", "content": "<ul><li>News</li>\r\n<li>India News</li>\r\n<li>Rohtak SP, accused of abetting IPS officers suicide, shunted</li></ul>\r\nSaini: Will spare none, irrespective of their influence\r\nFollow Us On Social Media\r… [+1752 chars]", "url": "https://timesofindia.indiatimes.com/india/rohtak-sp-accused-of-abetting-ips-officers-suicide-shunted/articleshow/124491822.cms", "source": "The Times of India", "published_at": "2025-10-11T23:23:21Z", "relevance_score": 0.34500000000000003}, {"title": "Complete list of Nobel Peace Prize winners (1901–2024)", "description": "The Nobel Peace Prize has been awarded 105 times to 142 laureates in its 124 year history.", "content": "The 2025 Nobel Peace Prize is scheduled to be announced on Friday, October 10, at 11:00 am local time in Oslo, Norway (09:00 GMT).\r\nThe announcement comes from the Norwegian Nobel Institute on behalf… [+5988 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/complete-list-of-nobel-peace-prize-winners-1901", "source": "Al Jazeera English", "published_at": "2025-10-10T02:52:17Z", "relevance_score": 0.34}, {"title": "Ayodhya Deepotsav 2025: City aims to break Guinness World Record with 26 lakh diyas lighting the Saryu River ghats", "description": "Ayodhya is set to illuminate the Saryu River ghats with a record-breaking 26 lakh diyas during Deepotsav 2025, from October 18-20. This grand celebration of light over darkness aims to surpass last year's 24 lakh diyas, featuring drone shows, laser effects, a…", "content": "<ul><li>News</li>\r\n<li>Ayodhya Deepotsav 2025: City aims to break Guinness World Record with 26 lakh diyas lighting the Saryu River ghats</li></ul>\r\nAyodhya is set to illuminate the Saryu River ghats… [+1845 chars]", "url": "https://timesofindia.indiatimes.com/etimes/trending/ayodhya-deepotsav-2025-city-aims-to-break-guinness-world-record-with-26-lakh-diyas-lighting-the-saryu-river-ghats/articleshow/124450659.cms", "source": "The Times of India", "published_at": "2025-10-10T10:06:50Z", "relevance_score": 0.34}, {"title": "Rajniesh Duggall on World Mental Health Day: Being emotional doesn’t make a man weak, it makes him human", "description": "On World Mental Health Day, actor Rajniesh Duggall opens up about why men’s emotional struggles often go unnoticed. He reflects on societal conditioning, the pressure to always appear strong, and the need to let men embrace vulnerability without shame.", "content": "<ul><li>News</li>\r\n<li>Rajniesh Duggall on World Mental Health Day: Being emotional doesnt make a man weak, it makes him human</li></ul>\r\nOn World Mental Health Day, actor Rajniesh Duggall opens up a… [+1767 chars]", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/rajniesh-duggall-on-world-mental-health-day-being-emotional-doesnt-make-a-man-weak-it-makes-him-human/articleshow/124451294.cms", "source": "The Times of India", "published_at": "2025-10-10T10:27:01Z", "relevance_score": 0.34}, {"title": "Three men held for duping govt job aspirants of Rs 1.2 crore", "description": "Ranchi police, in a joint operation with military intelligence, have arrested three individuals for allegedly defrauding job aspirants of approximately Rs 1.2 crore. The accused promised government positions in military engineering, railways, and other centra…", "content": "<ul><li>News</li>\r\n<li>Three men held for duping govt job aspirants of Rs 1.2 crore</li></ul>\r\nRanchi police, in a joint operation with military intelligence, have arrested three individuals for alle… [+2002 chars]", "url": "https://timesofindia.indiatimes.com/city/ranchi/three-men-held-for-duping-govt-job-aspirants-of-rs-1-2-crore/articleshow/124461266.cms", "source": "The Times of India", "published_at": "2025-10-10T17:25:58Z", "relevance_score": 0.34}, {"title": "History will never forget it was SEALs who put a bullet in Bin Laden's head: Trump", "description": "US President Donald Trump praised the US Navy SEALs for killing al-Qaeda leader Osama bin Laden, saying “history will never forget” their role in the 2011 operation in Pakistan. Speaking at an event in Norfolk, Virginia, marking the US Navy’s 250th anniversar…", "content": "US President Donald Trump has praised the US Navy SEALs, saying that history will never forget it was this special American force that stormed into al-Qaeda leader Osama bin Laden's compound in Pakis… [+2360 chars]", "url": "https://economictimes.indiatimes.com/news/international/global-trends/history-will-never-forget-it-was-seals-who-put-a-bullet-in-bin-ladens-head-trump/articleshow/124331166.cms", "source": "The Times of India", "published_at": "2025-10-06T05:12:49Z", "relevance_score": 0.34}, {"title": "'He works so hard...': Jaxson Dart’s mom Kara gets emotional after New York Giants’ crushing win over Philadelphia Eagles", "description": "Rookie quarterback Jaxson Dart led the New York Giants to a stunning 34-17 upset over the Super Bowl champion Philadelphia Eagles. Dart's impressive performance, including a touchdown pass and a rushing score, marked a significant turning point for the team. …", "content": "<ul><li>News</li>\r\n<li>'He works so hard...': Jaxson Darts mom Kara gets emotional after New York Giants crushing win over Philadelphia Eagles</li></ul>\r\nRookie quarterback Jaxson Dart led the New Yo… [+2037 chars]", "url": "https://timesofindia.indiatimes.com/sports/nfl/news/he-works-so-hard-jaxson-darts-mom-kara-gets-emotional-after-new-york-giants-crushing-win-over-philadelphia-eagles/articleshow/124460639.cms", "source": "The Times of India", "published_at": "2025-10-10T17:26:51Z", "relevance_score": 0.34}, {"title": "$41 million AMRAAM deal with Pakistan sparks speculation", "description": "A recent Pentagon order mentioning Pakistan as a recipient of Raytheon missile sales has sparked speculation. However, the modest $41 million value likely signifies upgrades to existing Amraam missile systems, not fresh acquisitions. This follows a separate $…", "content": "New Delhi: The recent modification of an American order on missile manufacturer Raytheon, which mentions Pakistan as a recipient of a sale order, has thrown up speculation on the nature of weapons be… [+1369 chars]", "url": "https://economictimes.indiatimes.com/news/defence/41-million-amraam-deal-with-pakistan-sparks-speculation/articleshow/124396947.cms", "source": "The Times of India", "published_at": "2025-10-08T18:46:23Z", "relevance_score": 0.34}, {"title": "India to reopen embassy in Kabul after 4-year hiatus amid new Taliban ties", "description": "India reopens embassy in Kabul, marking its first diplomatic engagement with the Taliban since their 2021 takeover.", "content": "India has announced that it is upgrading its technical mission in Kabul to a full-fledged embassy, cementing its first high-level diplomatic engagement with Afghanistans Taliban administration since … [+3989 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/india-to-reopen-embassy-in-kabul-after-4-year-hiatus-amid-new-taliban-ties", "source": "Al Jazeera English", "published_at": "2025-10-10T12:06:22Z", "relevance_score": 0.315}, {"title": "Bondi faces grilling from Senate Democrats on DOJ 'weaponization,' Epstein files", "description": "The hearing follows a tumultuous summer for the Department of Justice.", "content": "President Donald Trump's tightening grip over the Justice Department to target his political opponents and lawmakers' increasing calls for the release of more files from federal investigations into d… [+7209 chars]", "url": "https://abcnews.go.com/Politics/democrats-highlight-doj-weaponization-epstein-files-bondis-senate/story?id=126260560", "source": "ABC News", "published_at": "2025-10-07T13:24:23Z", "relevance_score": 0.315}, {"title": "More than 350 trekkers escape blizzard-hit Everest, hundreds still stranded", "description": "Rescued trekkers reach China's Qudang township while 200 others still face treacherous Everest conditions awaiting help.", "content": "Rescuers have guided more than 350 people to safety after they were stranded by blizzard-like conditions on the Tibetan side of Mount Everest, Chinese state media reported on Sunday.\r\nIn total, more … [+2526 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/more-than-350-trekkers-escape-blizzard-hit-everest-hundreds-still-stranded", "source": "Al Jazeera English", "published_at": "2025-10-06T01:01:28Z", "relevance_score": 0.315}, {"title": "Pune: NDA cadet found hanging in hostel room; police suspect suicide", "description": "A first-year NDA cadet, Antriksh Kumar Singh, was found hanging in his hostel room on Friday morning. Fellow cadets discovered him after he failed to report for training. The NDA has ordered a court of inquiry into the suspected suicide, with preliminary inve…", "content": "A first-term NDA cadet, Antriksh Kumar Singh, was found dead in his cabin, apparently by suicide, after failing to report for morning training. The 18-year-old from Lucknow was discovered hanging fro… [+1698 chars]", "url": "https://timesofindia.indiatimes.com/city/pune/pune-nda-cadet-found-hanging-in-hostel-room-police-suspect-suicide/articleshow/124449889.cms", "source": "The Times of India", "published_at": "2025-10-10T09:56:43Z", "relevance_score": 0.315}, {"title": "How Ladakh protest leader Sonam Wangchuk went from Indian hero to ‘traitor’", "description": "Wangchuk, a celebrated innovator, inspired a Bollywood megahit. Now he's being accused of challenging the Indian state.", "content": "New Delhi, India On the night of August 5, 2019, hundreds of Kashmiris were arrested amid a crackdown by Indian security forces that followed the Indian governments decision to strip the region of it… [+15015 chars]", "url": "https://www.aljazeera.com/features/2025/10/7/how-ladakh-protest-leader-sonam-wangchuk-went-from-indian-hero-to-traitor", "source": "Al Jazeera English", "published_at": "2025-10-07T02:53:02Z", "relevance_score": 0.31}, {"title": "Two years of Israel’s genocide in Gaza: By the numbers", "description": "Israel has killed or injured more than 10 percent of Gaza's population over the past 24 months.", "content": "It has been two years since Israel launched its genocide against Palestinians in Gaza.\r\nIsraels assault on Gaza began on October 7, 2023, in response to attacks on southern Israel by fighters from th… [+9376 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/two-years-of-israels-genocide-in-gaza-by-the-numbers", "source": "Al Jazeera English", "published_at": "2025-10-07T07:31:10Z", "relevance_score": 0.31}, {"title": "Skoda Octavia RS sells out in India, one every 12 seconds! All you need to know", "description": "Skoda Octavia RS bookings in India have been a phenomenal success, with all 100 allocated units selling out within minutes of opening, even before the official price reveal. This sporty sedan, a successor to the 2004 pioneer, boasts a powerful 2.0-litre TSI e…", "content": "Skoda Octavia RS bookings in India have been a phenomenal success, with all 100 allocated units selling out within minutes of opening, even before the official price reveal. This sporty sedan, a succ… [+1730 chars]", "url": "https://timesofindia.indiatimes.com/auto/cars/skoda-octavia-rs-sells-out-in-india-one-every-12-seconds-all-you-need-to-know/articleshow/124450649.cms", "source": "The Times of India", "published_at": "2025-10-10T09:59:53Z", "relevance_score": 0.31}, {"title": "Chhattisgarh cabinet fixes paddy rate at Rs 3,100 per quintal; procurement to begin on Nov 15", "description": "Chhattisgarh government will begin paddy procurement on November 15, 2025. Farmers will receive Rs 3,100 per quintal. Procurement will continue until January 31, 2026. A limit of 21 quintals per acre is set. Payments will be made within seven days. E-KYC is m…", "content": "Chhattisgarh government will begin paddy procurement on November 15, 2025. Farmers will receive Rs 3,100 per quintal. Procurement will continue until January 31, 2026. A limit of 21 quintals per acre… [+1740 chars]", "url": "https://timesofindia.indiatimes.com/city/raipur/chhattisgarh-cabinet-fixes-rs-3100-per-quintal-paddy-rate-procurement-to-begin-nov-15/articleshow/124450809.cms", "source": "The Times of India", "published_at": "2025-10-10T10:19:21Z", "relevance_score": 0.31}, {"title": "Chhattisgarh High Court instructs state govt to review RTE reimbursement rates", "description": "The Chhattisgarh High Court has directed the state government to review a long-pending representation from private schools concerning the reimbursement amount for students admitted under the RTE Act. The court ordered the Secretary of the Department of School…", "content": "The Chhattisgarh High Court has directed the state government to review a long-pending representation from private schools concerning the reimbursement amount for students admitted under the RTE Act.… [+1765 chars]", "url": "https://timesofindia.indiatimes.com/city/raipur/chhattisgarh-high-court-instructs-state-govt-to-review-rte-reimbursement-rates/articleshow/124451523.cms", "source": "The Times of India", "published_at": "2025-10-10T10:31:16Z", "relevance_score": 0.31}, {"title": "Run for empowerment: UP police lead ‘Mission Shakti’ events celebrating women’s strength, culture & courage", "description": "Uttar Pradesh Police celebrated women's strength through Mission Shakti 5.0 events. Kanpur Dehat's \"Run for Empowerment\" honoured daily life's unsung heroines, while Hamirpur's symbolic Hurdle Race depicted overcoming social barriers. These initiatives champi…", "content": "<ul><li>News</li>\r\n<li>Run for empowerment: UP police lead Mission Shakti events celebrating womens strength, culture &amp; courage</li></ul>\r\nUttar Pradesh Police celebrated women's strength through… [+1879 chars]", "url": "https://timesofindia.indiatimes.com/city/lucknow/run-for-empowerment-up-police-lead-mission-shakti-events-celebrating-womens-strength-culture-courage/articleshow/124451247.cms", "source": "The Times of India", "published_at": "2025-10-10T10:24:19Z", "relevance_score": 0.31}, {"title": "Shanghai Masters: Unseeded Arthur Rinderknech ousts Felix Auger-Aliassime to reach semifinals", "description": "Arthur Rinderknech, ranked 54th, continued his impressive Shanghai Masters run by defeating seed Felix Auger-Aliassime 6-3, 6-4. He will face either Daniil Medvedev or Alex de Minaur in the semi-finals, following his cousin Valentin Vacherot into the last fou…", "content": "Arthur Rinderknech, ranked 54th, continued his impressive Shanghai Masters run by defeating seed Felix Auger-Aliassime 6-3, 6-4. He will face either Daniil Medvedev or Alex de Minaur in the semi-fina… [+3243 chars]", "url": "https://timesofindia.indiatimes.com/sports/tennis/top-stories/shanghai-masters-unseeded-arthur-rinderknech-ousts-felix-auger-aliassime-to-reach-semifinals/articleshow/124450120.cms", "source": "The Times of India", "published_at": "2025-10-10T09:42:41Z", "relevance_score": 0.31}, {"title": "US: No new delivery of missiles to Pakistan", "description": "US News: US embassy clarified that the recent American foreign military sales amendment does not include deliveries of new advanced medium-range air-to-air mis.", "content": "SC questions HC order for SIT probe into Karur stampedeIsraeli military says ceasefire is in effect in GazaNo women journo at minister's presserRepatriate pregnant woman: Bangladesh court to Indian m… [+1311 chars]", "url": "https://timesofindia.indiatimes.com/world/us/us-no-new-delivery-of-missiles-to-pakistan/articleshow/124466420.cms", "source": "The Times of India", "published_at": "2025-10-10T22:03:22Z", "relevance_score": 0.31}, {"title": "Taliban FM begins first visit by senior Afghan leader to India since 2021", "description": "Amir Khan Muttaqi’s trip has been made possible after a UN committee temporarily lifted a travel ban on him.", "content": "Afghanistans United Nations-sanctioned foreign minister has arrived in India, the first visit by a top Taliban leader since they returned to power in 2021, following the withdrawal of United States-l… [+1927 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/taliban-fm-begins-first-visit-by-senior-afghan-leader-to-india-since-2021", "source": "Al Jazeera English", "published_at": "2025-10-09T07:32:13Z", "relevance_score": 0.28500000000000003}, {"title": "Veteran Kannada actor M.S. Umesh hospitalised after domestic fall", "description": "Veteran Kannada actor M.S. Umesh, 83, has been hospitalized after sustaining injuries from a fall at his Bengaluru residence. Known for his comic timing in films like Sankata and Golmaal Radhakrishna, Umesh is receiving medical care. The Kannada film industry…", "content": "<ul><li>News</li>\r\n<li>tv</li>\r\n<li>kannada</li>\r\n<li>Veteran Kannada actor M.S. Umesh hospitalised after domestic fall</li></ul>\r\nVeteran Kannada actor M.S. Umesh, 83, has been hospitalized after su… [+2040 chars]", "url": "https://timesofindia.indiatimes.com/tv/news/kannada/veteran-kannada-actor-m-s-umesh-hospitalised-after-domestic-fall/articleshow/124452196.cms", "source": "The Times of India", "published_at": "2025-10-10T10:59:02Z", "relevance_score": 0.245}, {"title": "Key moments that led to Trump’s Gaza ceasefire deal announcement", "description": "The Gaza ceasefire deal, based on Trump's 20-point plan, aims to free prisoners and captives in the first phase.", "content": "US President Donald Trump has announced that Israel and Hamas have agreed to the first phase of a peace plan that aims to achieve a ceasefire in Gaza.\r\nThis plan seeks to end Israels war that has dra… [+7373 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/key-moments-that-led-to-trumps-gaza-ceasefire-deal-announcement", "source": "Al Jazeera English", "published_at": "2025-10-09T11:02:52Z", "relevance_score": 0.23000000000000004}, {"title": "Why gold’s historic rally is about more than just Trump", "description": "The price of gold has soared 50 percent in 2025. Experts say the 'safe haven' asset is becoming an all-occasions asset.", "content": "The price of gold has soared to a historic high, crossing $4,000 per troy ounce (31.1g) as global investors have flocked to the asset over the past year.\r\nGold futures, which are contracts to buy or … [+5541 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/why-golds-historic-rally-is-about-more-than-just-trump", "source": "Al Jazeera English", "published_at": "2025-10-08T12:04:03Z", "relevance_score": 0.22500000000000003}, {"title": "Listed Londoner: Lyse Doucet, Journalist", "description": "Journalist Lyse Doucet shares her London loves and loathes with Robert Elms.", "content": "Available for over a year\r\nLyse Doucet is the BBCs Chief International Correspondent, and one of its senior presenters.\r\nShe is originally from New Brunswick in Francophone south-eastern Canada. But … [+534 chars]", "url": "https://www.bbc.co.uk/sounds/play/p0m7v73v", "source": "BBC News", "published_at": "2025-10-10T09:20:20Z", "relevance_score": 0.22500000000000003}, {"title": "Trump’s $100K H-1B fee: Will it drive foreign teachers out of US classrooms?", "description": "President Trump’s proposed $100,000 H-1B visa fee has alarmed US school districts relying on international teachers, especially in STEM and special education. With over 2,300 H-1B educators in 500 districts, the fee could worsen teacher shortages and burden u…", "content": "President Trumps proposed $100,000 H-1B visa fee has alarmed US school districts relying on international teachers, especially in STEM and special education. With over 2,300 H-1B educators in 500 dis… [+3438 chars]", "url": "https://timesofindia.indiatimes.com/education/news/trumps-100k-h-1b-fee-will-it-drive-foreign-teachers-out-of-us-classrooms/articleshow/124448202.cms", "source": "The Times of India", "published_at": "2025-10-10T09:13:01Z", "relevance_score": 0.22500000000000003}, {"title": "From Kabul to Chicago: The empire comes home", "description": "Trump's deployment of troops to US cities shows how America's empire is collapsing back on itself.", "content": "A hot discussion topic in Afghanistan these days is the extreme crime allegedly plaguing various cities in the United States, most of them Democratic-led ones.\r\nThis, at least, is one of the notions … [+5361 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/9/from-kabul-to-chicago-the-empire-comes-home", "source": "Al Jazeera English", "published_at": "2025-10-09T12:06:54Z", "relevance_score": 0.195}, {"title": "Trump appears to reveal another strike on alleged cartel drug boat", "description": "President Donald Trump appeared to reveal Sunday that the U.S. had carried out another strike on an alleged drug cartel boat from Venezuela.", "content": "President Donald Trump appeared on Sunday to reveal the U.S. had conducted another strike on an alleged cartel drug boat as he celebrated the 250th anniversary of the U.S. Navy aboard the aircraft ca… [+2529 chars]", "url": "https://abcnews.go.com/Politics/trump-appears-reveal-strike-alleged-cartel-drug-boat/story?id=126237676", "source": "ABC News", "published_at": "2025-10-06T00:45:40Z", "relevance_score": 0.19}, {"title": "Stumped", "description": "Diana Edulji explains how Sachin Tendulkar helped Harmanpreet Kaur secure a job.", "content": "Available for over a year\r\nWith the Women's World Cup underway, Alison Mitchell, Jim Maxwell and Prakash Wakankar take stock of the opening week of the tournament. \r\nWe speak to former India captain … [+663 chars]", "url": "https://www.bbc.co.uk/sounds/play/w3ct6zjv", "source": "BBC News", "published_at": "2025-10-09T11:32:00Z", "relevance_score": 0.075}]}