{"timestamp": 1760318260.92143, "data": {"url": "https://www.aljazeera.com/news/2025/10/10/we-dont-want-to-disappear-tuvalu-fights-for-climate-action-and-survival", "title": "‘We don’t want to disappear’: Tuvalu fights for climate action and survival", "text": "Tuvalu’s climate change minister tells Al Jazeera his country is exploring new ways to survive rising sea levels and needs help to build protective sea walls now.\n\nTuvalu’s Minister of Climate Change Maina Talia has told Al Jazeera that his country is fighting to stay above rising sea levels and needs “real commitments” from other countries that will allow Tuvaluans to “stay in Tuvalu” as the climate crisis worsens.\n\nThe low-lying nation of nine atolls and islands, which is situated between Australia and Hawaii in the Pacific Ocean, is fighting to maintain its sovereignty by exploring new avenues in international diplomacy.\n\nBut, right now, the country needs help just to stay above water.\n\n“Coming from a country that is barely not one metre above the sea, reclaiming land and building sea walls and building our resilience is the number one priority for us,” Talia told Al Jazeera in an interview during the recent United Nations General Assembly in New York.\n\n“We cannot delay any more. Climate finance is important for our survival,” Talia said.\n\n“It’s not about building [over the] next two or three years to come, but right now, and we need it now, in order for us to respond to the climate crisis,” he said.\n\nTalia, who is also Tuvalu’s minister of home affairs and the environment, said the issue of financing will be a key issue at the upcoming UN COP30 climate meeting in Belem, in the Brazilian Amazon, in November.\n\n‘You pollute, you pay’\n\nTuvalu is one of many countries already pushing for a better deal on climate financing at this year’s COP, after many advocates left last year’s meeting in Azerbaijan disappointed by the unambitious $300bn target set by richer countries.\n\nAdvertisement\n\nDescribing the COP climate meeting as having become more like a “festival for the oil-producing countries”, Talia said Tuvalu is also exploring a range of alternative initiatives, from a push to create the world’s first fossil fuel non-proliferation treaty to seeking to add its entire cultural heritage to the UNESCO World Heritage List.\n\nRepresentatives of oil-producing countries are now attending the COP climate meetings in “big numbers”, Talia said, in order to try and “really bury our voice as small developing countries”.\n\n“They take control of the narrative. They take control of the process. They try to water down all the texts. They try to put a stop to climate finance,” Talia said.\n\n“It’s about time that we should call out to the world that finance is important for us to survive,” he said.\n\n“The polluter pay principle is still there. You pollute, you pay,” he added.\n\nTalia also said that it was frustrating to see his own country struggling to survive, while other countries continue to spend billions of dollars on weapons for current and future wars.\n\n“Whilst your country is facing this existential threat, it’s quite disappointing to see that the world is investing billions and trillions of dollars in wars, in conflicts,” he said.\n\nA report released this week by the Global Center on Adaptation (GCA) found that 39 small island countries, which are home to some 65 million people, already need about $12bn a year to help them cope with the effects of climate change.\n\nThat figure is many times more than the roughly $2bn a year they are collectively receiving now, and which represents just 0.2 percent of the amount spent on global climate finance worldwide.\n\nGCA, a Rotterdam-based nonprofit organisation, also found that island states are already experiencing an average $1.7bn in annual economic losses due to climate change.\n\nTuvalu is not only focused on its own survival – the island state is considered to be facing one of the most severe existential threats from rising sea levels – it is also continuing to find ways to fight climate change globally.\n\n“That’s why Tuvalu is leading the Fossil Fuel Non-Proliferation Treaty,” Talia said.\n\nAbout 16 countries have now signed on to the treaty, with Colombia offering to host the first international conference for the phase-out of fossil fuels next year.\n\n“We see its relevance for us,” Talia said of the treaty.\n\n“We want to grow in number in order for us to come up with a treaty, apart from the Paris Agreement,” he said.\n\n‘We need to hold the industrialised countries accountable’\n\nEven as Tuvalu, a country with a population of less than 10,000 people, is fighting for immediate action on climate change, it is also making preparations for its own uncertain future, including creating a digital repository of its culture so that nothing is lost to the sea.\n\nAdvertisement\n\nTalia, who is also Tuvalu’s minister for culture, said that he made the formal preliminary submission to UNESCO two weeks before the UNGA meeting for “the whole of Tuvalu to be listed” on the World Heritage List.\n\n“If we are to disappear, which is something that we don’t want to anticipate, but if worst comes to worst, at least you know our values, our culture, heritage, are well secured,” he told Al Jazeera.\n\nLikewise, Talia said his country doesn’t see its 2023 cooperation pact with Australia, which also includes the world’s first climate change migration visa, as an indication that the island’s future is sealed.\n\n“I don’t look at the Falepili Agreement as a way of escaping the issue of climate change, but rather a pathway,” he said.\n\n“A pathway that we will allow our people in Tuvalu to get good education, trained, and then return home,” he said, referring to the agreement giving some Tuvaluans access to education, healthcare and unlimited travel to Australia.\n\nThe agreement text includes an acknowledgement from both parties that “the statehood and sovereignty of Tuvalu will continue, and the rights and duties inherent thereto will be maintained, notwithstanding the impact of climate change-related sea level rise”.\n\nTalia also said that a recent ruling from the UN’s top court, the International Court of Justice (ICJ) in The Hague, declared that states have a responsibility to address climate change by cooperating to cut emissions, following through on climate agreements, and protecting vulnerable populations and ecosystems from harm.\n\nThe ICJ ruling “really changed the whole context of climate change debates”, Talia said.\n\n“The highest court has spoken, the highest court has delivered the judgement,” he said of the case, which was brought before the ICJ by Tuvalu’s neighbour Vanuatu.\n\n“So it’s just a matter of, how are we going to live that, or weave that, into our climate policies,” he said.\n\n“We need to hold the industrialised countries accountable to their actions,” he added.", "authors": ["Lyndal Rowlands"], "published_date": "2025-10-10T00:00:00", "top_image": "https://www.aljazeera.com/wp-content/uploads/2025/09/getty_68d97afc2c-1759083260.jpg?resize=1920%2C1440", "summary": "Tuvalu’s climate change minister tells Al Jazeera his country is exploring new ways to survive rising sea levels and needs help to build protective sea walls now.\nGCA, a Rotterdam-based nonprofit organisation, also found that island states are already experiencing an average $1.7bn in annual economic losses due to climate change.\n“That’s why Tuvalu is leading the Fossil Fuel Non-Proliferation Treaty,” Talia said.\n“I don’t look at the Falepili Agreement as a way of escaping the issue of climate change, but rather a pathway,” he said.\nThe ICJ ruling “really changed the whole context of climate change debates”, Talia said.", "keywords": ["disappear", "countries", "country", "climate", "sea", "survival", "dont", "tuvalu", "treaty", "fights", "world", "change", "action", "talia", "tuvalus"], "success": true, "error": null}}