{"timestamp": 1759918659.1565309, "data": [{"title": "Fool me once: the magical origin of the word hoax", "description": "Frauds, swindles, cons, scams, and deceptions are collectively known as hoaxes. But there's more than meets the eye.", "content": "Several are on President Trump's personal list: climate change\r\n, Russiagate\r\n, and the Jeffrey Epstein\r\n controversy. History, by contrast, offers clearer, less politically fraught cases: the \"missi… [+6034 chars]", "url": "https://www.npr.org/2025/10/01/nx-s1-5557924/hoax-hocus-pocus-history", "source": "NPR", "published_at": "2025-10-01T09:00:00Z"}, {"title": "Pope Leo condemns climate change critics", "description": "In his first major statement on climate change, Pope Leo criticises those who minimise climate change.", "content": "Matt McGrathEnvironment correspondent\r\nPope Leo XIV speaking at the Raising Hope climate conference near Rome\r\nIn his first major statement on climate change, Pope Leo XIV has hit out at those who mi… [+3161 chars]", "url": "https://www.bbc.com/news/articles/cgl1pgr2zn8o", "source": "BBC News", "published_at": "2025-10-01T16:58:20Z"}, {"title": "Climate, Money, Markets, And Trump’s ‘Stupid People’ U.N. Remark", "description": "Climate scientists are not stupid. Rather, stupidity is preventing climate science, money, and markets from creating a rational response to global warming.", "content": "NEW YORK, NEW YORK - SEPTEMBER 23: U.S. President Donald Trump speaks during the United Nations General Assembly (UNGA) at the United Nations headquarters on September 23, 2025 in New York City. Worl… [+8559 chars]", "url": "https://www.forbes.com/sites/hershshefrin/2025/10/01/climate-money-markets-and-trumps-stupid-people-un-remark/", "source": "Forbes", "published_at": "2025-10-01T17:11:28Z"}, {"title": "Defense contractors brace for climate threats despite Trump's denials", "description": "Washington DC (UPI) Oct 2, 2025 \n\n\n President Donald Trump repeatedly calls climate change a \"hoax,\" but the nation's five largest defense contractors say they are challenged to balance the Earth's warming with operational demands, technological adaptations a…", "content": "Defense contractors brace for climate threats despite Trump's denialsby Bridget Erin Craig Washington DC (UPI) Oct 2, 2025 \r\nPresident Donald Trump repeatedly calls climate change a \"hoax,\" but the n… [+9280 chars]", "url": "https://www.spacewar.com/reports/Defense_contractors_brace_for_climate_threats_despite_Trumps_denials_999.html", "source": "Spacewar.com", "published_at": "2025-10-05T23:53:02Z"}]}