{"timestamp": 1760318268.209096, "data": {"url": "https://www.cbsnews.com/news/bob-ross-paintings-auction-public-radio-broadcast-npr-pbs/", "title": "Bob Ross paintings to be auctioned to raise money for public TV stations after funding cuts", "text": "Thirty paintings created by the bushy-haired, soft-spoken Bob Ross will soon be up for auction to defray the costs of programming for small and rural public television stations suffering under cuts in federal funding.\n\nRoss, a public television stalwart in the 1980s and '90s, \"dedicated his life to making art accessible to everyone,\" said Joan Kowalski, president of Bob Ross Inc. \"This auction ensures his legacy continues to support the very medium that brought his joy and creativity into American homes for decades.\"\n\nThe 30 paintings to be auctioned span his career. Most were created on-air during single episodes of Ross' show, \"The Joy of Painting.\" Ross was known for his calm demeanor. During the show, he often spoke about painting happy little clouds and trees, and making no mistakes, only \"happy accidents.\" He died of cancer complications in 1995.\n\nBonhams in Los Angeles will auction three of Ross' paintings on Nov. 11. Other auctions will follow in London, New York, Boston and online. Bonhams sold two early 1990s mountain-and-lake scenes of Ross in August for $114,800 and $95,750.\n\nBob Ross, the host of the classic instruction series \"The Joy of Painting,\" taught viewers how to create \"happy little trees.\" YouTube\n\nThe auctions of the 30 paintings soon to be sold have an estimated total value of $850,000 to $1.4 million, Bonhams said. All profits are pledged to stations that use content from distributor American Public Television.\n\nThe idea is to help stations in need with licensing fees that allow them to show popular programs that include \"The Best of Joy of Painting,\" based on Ross' show, \"America's Test Kitchen,\" \"Julia Child's French Chef Classics\" and \"This Old House.\"\n\nAs desired by President Donald Trump, Congress has eliminated $1.1 billion allocated to public broadcasting, leaving about 330 PBS and 246 NPR stations to find alternative funding sources.\n\nMany stations launched emergency fund drives. Some stations have received more help than they expected, CBS News previously reported. North Carolina public radio station WQHR raised more than $200,000 in just three days, surpassing the $174,000 they needed to fill. Hawaii Public Radio lost $525,000, but donations raised $650,000.\n\nNPR has also encouraged donors in wealthier areas to support stations in regions that are in greater need. PBS and NPR have also worked to reduce the annual dues stations pay for programming and other services to lower their costs. Some stations are working on collaborations to see if they can share services and reduce costs.\n\nStill, the federal cuts have had an impact. Not all stations have seen an outpouring of donors. PBS slashed its budget by 21% and laid off about 100 employees in September. Stations have also had to lay off staff and reduce programming, CBS News previously reported. No stations have shut down yet, but operators are worried about what happens if donor money dries up.\n\n\"I am a realist,\" PBS president Paula Kerger said in September. \"I have to believe that there are some vulnerable stations that are not going to make it.\"\n\nNational Public Radio president and CEO Katherine Maher told CBS News in July that defunding public media services \"is a real risk to the public safety of the country.\"\n\n\"Public media, public radio, public television, are a critical part of the emergency response plans of nearly half of the states in this nation,\" Maher said in an interview with CBS News. \"If these types of emergency alerting go away, you will have fewer outlets to be able to respond in real time\" to future natural disasters.\n\n", "authors": [], "published_date": null, "top_image": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/08/de8ac020-a4ac-4b72-89a0-bb67a2acce47/thumbnail/1200x630/fd565bd267bcfa01326ebfd801aa63ef/ap25279448519615.jpg", "summary": "Bonhams in Los Angeles will auction three of Ross' paintings on Nov. 11.\nNorth Carolina public radio station WQHR raised more than $200,000 in just three days, surpassing the $174,000 they needed to fill.\nHawaii Public Radio lost $525,000, but donations raised $650,000.\nNational Public Radio president and CEO Katherine Maher told CBS News in July that defunding public media services \"is a real risk to the public safety of the country.\"\n\"Public media, public radio, public television, are a critical part of the emergency response plans of nearly half of the states in this nation,\" Maher said in an interview with CBS News.", "keywords": ["stations", "money", "cbs", "raise", "paintings", "cuts", "president", "pbs", "bob", "joy", "tv", "funding", "radio", "painting", "public", "ross"], "success": true, "error": null}}