{"timestamp": 1760321859.111445, "data": {"url": "https://www.aljazeera.com/news/2025/10/6/greta-thunberg-and-other-activists-deported-from-israel-arrive-in-greece", "title": "Israel deports Greta Thunberg and other Gaza flotilla activists", "text": "Among the 161 arriving in Athens, MEP Rima Hassan reports that she was ‘beaten’ by Israeli police officers.\n\nSwedish activist Greta Thunberg has arrived in Greece along with 160 other campaigners from the Global Sumud Flotilla, having been deported by Israel.\n\nIsrael’s Foreign Ministry announced on X on Monday that it had expelled a total of 171 activists from the flotilla’s ships, which were intercepted last week while trying to bring aid to blockaded Gaza. This brings the total deported so far up to 341.\n\nThe Greek Foreign Ministry confirmed that 161 of the expelled activists — including 27 Greeks and 134 nationals from 15 other countries — arrived on a flight to Athens on Monday, according to news agency AFP.\n\n“Let me be very clear. There is a genocide going on,” Thunberg told the crowd at the Athens airport, referring to Israeli military action in Gaza.\n\n“Our international systems are betraying Palestinians. They are not even able to prevent the worst war crimes from happening,” she said, in comments carried by AFP.\n\n“What we aimed to do with the Global Sumud Flotilla was to step up when our governments failed to do their legal obligation,” she added.\n\nThe 22-year-old was allegedly abused by Israeli forces while in detention. Turkish journalist and Sumud Flotilla participant Ersin Celik earlier told local media how Thunberg was “dragged on the ground” and “forced to kiss the Israeli flag”.\n\nSlovakia’s Foreign Ministry, meanwhile, confirmed that 10 of the deportees had arrived there, including one of its nationals and nine other people from the Netherlands, Canada and the United States.\n\n‘Long live the flotilla’\n\nCrowds of demonstrators welcomed the activists, unfurling a huge Palestinian flag in the arrivals hall and chanting: “Freedom for Palestine” and “Long live the flotilla!”\n\nAdvertisement\n\nAmong those arriving in Athens, Rima Hassan, a French-Palestinian member of the European Parliament, reported having been hit by Israeli police after the flotilla was intercepted.\n\n“I was beaten by two police officers when they put me in the van,” she told AFP.\n\nHassan said she and other detainees were kept in groups of up to 15 per cell on mattresses in a high-security Israeli prison.\n\nThe flotilla departed from Barcelona in Spain in early September and was intercepted by the Israeli navy in international waters approaching Gaza.\n\nIsraeli police said more than 470 people aboard the flotilla boats were arrested. The Foreign Ministry told AFP that 138 flotilla participants remained in detention in Israel.", "authors": [], "published_date": "2025-10-06T00:00:00", "top_image": "https://www.aljazeera.com/wp-content/uploads/2025/10/2025-10-06T170710Z_1741660141_RC2H6HATLK4B_RTRMADP_3_ISRAEL-PALESTINIANS-FLOTILLA-GREECE-1759775678.jpg?resize=1920%2C1440", "summary": "Swedish activist Greta Thunberg has arrived in Greece along with 160 other campaigners from the Global Sumud Flotilla, having been deported by Israel.\nThere is a genocide going on,” Thunberg told the crowd at the Athens airport, referring to Israeli military action in Gaza.\n“What we aimed to do with the Global Sumud Flotilla was to step up when our governments failed to do their legal obligation,” she added.\nTurkish journalist and Sumud Flotilla participant Ersin Celik earlier told local media how Thunberg was “dragged on the ground” and “forced to kiss the Israeli flag”.\nThe Foreign Ministry told AFP that 138 flotilla participants remained in detention in Israel.", "keywords": ["israel", "told", "thunberg", "gaza", "greta", "ministry", "flotilla", "foreign", "arrived", "deports", "israeli", "athens", "sumud", "activists"], "success": true, "error": null}}