{"timestamp": 1760121798.595912, "data": [{"title": "Your phone rings, and it's a number from Sweden. Do you answer? A Nobel Prize winner didn't", "description": "This year’s Nobel Prize science winners got the good news from early morning phone calls and door knocks", "content": "BERLIN -- BERLIN (AP) For some Nobel Prize winners this year, the news came with a knock at the door before dawn. For others, it was a long-awaited phone call honoring a discovery made decades ago.\r\n… [+5111 chars]", "url": "https://abcnews.go.com/Technology/wireStory/phone-rings-number-sweden-answer-nobel-prize-winner-126330839", "source": "ABC News", "published_at": "2025-10-08T17:01:48Z", "relevance_score": 0.75}, {"title": "These US universities shaped the 2025 Nobel Prize winners", "description": "American universities are at the forefront of global scientific innovation. This year's Nobel laureates from US institutions are recognized for groundbreaking work in quantum physics and immune system regulation. Their discoveries promise to revolutionize com…", "content": "Karwa Chauth 2025: Bollywood divas approved lehenga looks for the festival", "url": "https://timesofindia.indiatimes.com/education/news/these-us-universities-shaped-the-2025-nobel-prize-winners/articleshow/124396081.cms", "source": "The Times of India", "published_at": "2025-10-08T18:19:50Z", "relevance_score": 0.63}, {"title": "Ivy league colleges that shaped Nobel Peace Prize winners", "description": "Elite Ivy League universities have played a crucial role in shaping Nobel Peace Prize winners. Institutions like Harvard, Columbia, and Princeton have provided the intellectual foundation and connections for leaders in diplomacy and human rights. Their gradua…", "content": "Elite Ivy League universities have played a crucial role in shaping Nobel Peace Prize winners. Institutions like Harvard, Columbia, and Princeton have provided the intellectual foundation and connect… [+3377 chars]", "url": "https://timesofindia.indiatimes.com/education/news/ivy-league-colleges-that-shaped-nobel-peace-prize-winners/articleshow/124433970.cms", "source": "The Times of India", "published_at": "2025-10-09T18:33:40Z", "relevance_score": 0.4650000000000001}, {"title": "Previous winners of the Nobel Peace Prize", "description": "As the 2025 Nobel Peace Prize announcement nears, this article revisits prominent past laureates like Martin Luther King Jr. and Nelson Mandela. It also highlights controversial choices such as Henry Kissinger and Aung San Suu Kyi, and the notable omission of…", "content": "The winner of the 2025 Nobel Peace Prize will be announced on Friday in Oslo. Here are some of the best known past winners - and one person who did not win but should have.MARTIN LUTHER KING\r\nThe lea… [+4119 chars]", "url": "https://economictimes.indiatimes.com/news/international/world-news/previous-winners-of-the-nobel-peace-prize/articleshow/124355373.cms", "source": "The Times of India", "published_at": "2025-10-07T06:20:42Z", "relevance_score": 0.43500000000000005}, {"title": "Meet László Krasznahorkai, 2025 Nobel Prize in Literature winner who turns apocalypse into art", "description": "László Krasznahorkai, the Hungarian author, has been awarded the 2025 Nobel Prize in Literature for his compelling and visionary oeuvre. His work, often set in remote and unsettling landscapes, explores themes of apocalypse, resistance, and the enduring power…", "content": "László Krasznahorkai, the Hungarian author, has been awarded the 2025 Nobel Prize in Literature for his compelling and visionary oeuvre. His work, often set in remote and unsettling landscapes, explo… [+186 chars]", "url": "https://economictimes.indiatimes.com/news/international/global-trends/meet-lszl-krasznahorkai-2025-nobel-prize-winner-who-turns-apocalypse-into-art/articleshow/124413051.cms", "source": "The Times of India", "published_at": "2025-10-09T11:17:55Z", "relevance_score": 0.43000000000000005}, {"title": "Nobel Prize 2025 Winners: Here's the full list across all categories", "description": "The 2025 Nobel Prize announcements began Monday with the medicine award going to Mary Brunkow, Fred Ramsdell, and Shimon Sakaguchi for their discoveries related to the immune system. The prize, officially called the Nobel Prize in Physiology or Medicine, has …", "content": "The 2025 Nobel Prize announcements start Monday with the medicine prize being announced by a panel at the Karolinska Institute in Stockholm.Officially known as the Nobel Prize in Physiology or Medici… [+1769 chars]", "url": "https://economictimes.indiatimes.com/news/international/world-news/nobel-prize-2025-winners-heres-the-full-list-across-all-categories/articleshow/124336117.cms", "source": "The Times of India", "published_at": "2025-10-06T09:39:36Z", "relevance_score": 0.43000000000000005}, {"title": "Could President Trump join Barack Obama, Jimmy Carter, and Teddy Roosevelt as a Nobel Peace Prize winner in 2025 — or face another global snub from Oslo?", "description": "The 2025 Nobel Peace Prize will be announced on October 10. President Donald Trump is one of the talked-about nominees. Trump claims credit for brokering peace in several conflicts. He was nominated by leaders including Israeli Prime Minister Benjamin Netanya…", "content": "President Donald Trump, now in his second term in office, hopes to join one of the most exclusive clubs in world politics the group of American leaders who have received the Nobel Peace Prize. That l… [+8906 chars]", "url": "https://economictimes.indiatimes.com/news/international/us/could-president-donald-trump-join-barack-obama-jimmy-carter-and-teddy-roosevelt-as-a-nobel-peace-prize-winner-in-2025-or-face-another-global-snub-from-oslo-as-the-2025-winner-of-the-nobel-peace-prize-will-be-announced-on-friday-oct-10/articleshow/124386452.cms", "source": "The Times of India", "published_at": "2025-10-08T12:40:40Z", "relevance_score": 0.43000000000000005}, {"title": "Nobel Prize 2025 winners in Chemistry announced: Know where they studied and what they won for", "description": "Three scientists, Susumu Kitagawa, Richard Robson, and Omar M. Yaghi, have been awarded the 2025 Nobel Prize in Chemistry for their pioneering work on metal-organic frameworks (MOFs). These innovative porous materials, capable of custom-designed capture and s…", "content": "Karwa Chauth 2025: Bollywood divas approved lehenga looks for the festival", "url": "https://timesofindia.indiatimes.com/education/news/nobel-prize-2025-winners-in-chemistry-announced-know-where-they-studied-and-what-they-won-for/articleshow/124384424.cms", "source": "The Times of India", "published_at": "2025-10-08T10:45:26Z", "relevance_score": 0.42000000000000004}, {"title": "Donald Trump to win Nobel Peace Prize tomorrow? Leading bookmaker show him as the second favorite", "description": "Donald Trump's prospects for the 2025 Nobel Peace Prize have significantly improved. A US-backed Gaza peace plan has boosted his chances, making him the second favorite with bookmakers. Several countries and leaders had nominated him. The winner will be annou…", "content": "President Donald Trumps chances of winning the 2025 Nobel Peace Prize have risen sharply following the approval of a U.S.-backed Gaza peace plan by both Israel and Hamas. With the announcement just h… [+4877 chars]", "url": "https://economictimes.indiatimes.com/news/international/us/donald-trump-to-win-nobel-peace-prize-tomorrow-leading-bookmaker-show-him-as-the-second-favorite/articleshow/124424630.cms", "source": "The Times of India", "published_at": "2025-10-09T16:21:34Z", "relevance_score": 0.34}, {"title": "What is the Nobel Peace Prize — and could Donald Trump get it?", "description": "The winner of the 2025 Nobel Peace Prize will be announced Friday. Here's what to know about the honor and President Trump's interest.", "content": "Barack Obama. Jimmy Carter. Woodrow Wilson. Teddy Roosevelt. Al Gore. And Donald Trump?\r\nPresident Trump hopes to join the exclusive list of presidents and vice presidents who have received one of th… [+8230 chars]", "url": "https://www.cbsnews.com/news/nobel-peace-prize-donald-trump-what-to-know/", "source": "CBS News", "published_at": "2025-10-08T09:00:05Z", "relevance_score": 0.33}, {"title": "The Nobel Prize in literature will be announced on Thursday", "description": "The Nobel Prize in literature will be announced on Thursday", "content": "STOCKHOLM -- STOCKHOLM (AP) The Nobel Prize in literature is being announced on Thursday, with the winner joining an illustrious list of laureates that includes Ernest Hemingway, Toni Morrison and Ka… [+1147 chars]", "url": "https://abcnews.go.com/Entertainment/wireStory/nobel-prize-literature-announced-thursday-126355608", "source": "ABC News", "published_at": "2025-10-09T08:05:43Z", "relevance_score": 0.315}, {"title": "Meet Brunkow, Ramsdell and Sakaguchi — the Nobel Prize-winning trio who taught the world how the immune system knows when to stop", "description": "Shimon Sakaguchi, Mary E. Brunkow, and Fred Ramsdell received the 2025 Nobel Prize in Medicine for decoding peripheral immune tolerance. Sakaguchi discovered regulatory T cells, while Brunkow and Ramsdell identified the Foxp3 gene controlling them. Their grou…", "content": "When the Nobel Assembly at Karolinska Institutet announced this years winners of the Nobel Prize in Physiology or Medicine, it wasnt just recognising a single discovery. It was celebrating three scie… [+4984 chars]", "url": "https://economictimes.indiatimes.com/news/science/nobel-prize-2025-brunkow-ramsdell-and-sakaguchi-winners-immune-system/articleshow/124336295.cms", "source": "The Times of India", "published_at": "2025-10-06T09:49:42Z", "relevance_score": 0.315}, {"title": "Jordanian-born Palestinian chemist awarded Nobel Prize", "description": "Omar M. Yaghi, a chemist born to Palestinian refugee parents in Jordan, has been awarded a Nobel Prize.", "content": "NewsFeed\r\nOmar M. Yaghi, a chemist born to Palestinian refugee parents in Jordan, has been awarded a joint Nobel Prize for his work on metal organic frameworks.", "url": "https://www.aljazeera.com/video/newsfeed/2025/10/8/jordanian-born-palestinian-chemist-awarded-nobel-prize", "source": "Al Jazeera English", "published_at": "2025-10-08T17:43:44Z", "relevance_score": 0.31}, {"title": "Nobel Prize 2025: What they are, when will the awards be announced?", "description": "Nobel Prize for medicine to be announced on Monday, followed by five other prizes to be declared over the next week.", "content": "The Nobel Prize 2025 officially kicks off with the first award, for physiology or medicine, to be announced on Monday, setting the stage for a week of global anticipation.\r\nThe full schedule, spannin… [+9081 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/nobel-prize-2025-what-they-are-when-will-the-awards-be-announced", "source": "Al Jazeera English", "published_at": "2025-10-06T09:07:20Z", "relevance_score": 0.31}, {"title": "3 scientists win Nobel Prize in medicine for discoveries in immunology", "description": "Nobel Prize committee chair says discoveries by the trio of researchers were \"decisive for our understanding of how the immune system functions.\"", "content": "Stockholm — Mary E. Brunkow, Fred Ramsdell and Dr. Shimon Sakaguchi won the Nobel Prize in medicine on Monday for their discoveries concerning peripheral immune tolerance.\r\n Brunkow, 64, is a senior … [+3425 chars]", "url": "https://www.cbsnews.com/news/nobel-prize-in-medicine-2025-discoveries-in-immunology/", "source": "CBS News", "published_at": "2025-10-06T13:37:43Z", "relevance_score": 0.31}, {"title": "The Nobel Prize in chemistry will be announced Wednesday", "description": "The Royal Swedish Academy of Sciences is announcing the Nobel Prize in chemistry", "content": "STOCKHOLM -- STOCKHOLM (AP) The Royal Swedish Academy of Sciences is announcing the Nobel Prize in chemistry Wednesday. \r\nThere have been 116 chemistry prizes given to 195 individuals between 1901 an… [+1432 chars]", "url": "https://abcnews.go.com/Technology/wireStory/nobel-prize-chemistry-announced-wednesday-126318399", "source": "ABC News", "published_at": "2025-10-08T09:36:28Z", "relevance_score": 0.31}, {"title": "The Nobel Prize in physics is to be announced Tuesday", "description": "The Nobel Prize in Physics will be announced by the Royal Swedish Academy of Sciences in Stockholm", "content": "STOCKHOLM -- STOCKHOLM (AP) Nobel Prize in Physics will be announced Tuesday, the second award to be revealed this year by the Royal Swedish Academy of Sciences in Stockholm a day after a trio of sci… [+1029 chars]", "url": "https://abcnews.go.com/Technology/wireStory/nobel-prize-physics-announced-tuesday-126281051", "source": "ABC News", "published_at": "2025-10-07T06:24:44Z", "relevance_score": 0.31}, {"title": "Nobel winner Fred Ramsdell unreachable, hiking 'off the grid'", "description": "Fred Ramsdell, a Nobel laureate for immune system research, is currently unreachable. He is on an off-the-grid hiking trip and unaware of his 2025 Nobel Prize win. The Nobel committee and his colleagues are trying to contact him. Ramsdell shared the prize wit…", "content": "One of this year's Nobel winners is a leading medical researcher who also offers a shining example of work-life balance -- so much so that he might not know he won.Fred Ramsdell was among those honor… [+1932 chars]", "url": "https://economictimes.indiatimes.com/news/international/world-news/nobel-winner-fred-ramsdell-unreachable-hiking-off-the-grid/articleshow/124354051.cms", "source": "The Times of India", "published_at": "2025-10-07T05:11:56Z", "relevance_score": 0.31}, {"title": "Americans win Nobel prize in medicine for work on human immune system", "description": "A trio of scientists — two of them American and one Japanese — have won the Nobel Prize in Medicine for their discoveries concerning peripheral immune tolerance, a mechanism by which the body helps prevent itself from attacking its own tissues instead of fore…", "content": "A trio of scientists two of them American and one Japanese have won the Nobel Prize in Medicine for their discoveries concerning peripheral immune tolerance, a mechanism by which the body helps preve… [+3175 chars]", "url": "https://www.nbcnews.com/world/europe/nobel-prize-medicine-peripheral-immune-toleranc-rcna235832", "source": "NBC News", "published_at": "2025-10-06T09:48:37Z", "relevance_score": 0.31}, {"title": "Hungarian writer László Krasznahorkai wins the Nobel Prize in literature", "description": "Hungarian writer László Krasznahorkai wins the Nobel Prize in literature", "content": "Hungarian writer László Krasznahorkai wins the Nobel Prize in literature\r\nSTOCKHOLM -- STOCKHOLM (AP) Hungarian writer László Krasznahorkai wins the Nobel Prize in literature.", "url": "https://abcnews.go.com/Entertainment/wireStory/hungarian-writer-lszl-krasznahorkai-wins-nobel-prize-literature-126358162", "source": "ABC News", "published_at": "2025-10-09T12:05:50Z", "relevance_score": 0.31}, {"title": "Malta foreign minister nominates Trump for Nobel Peace Prize", "description": "Malta's Foreign Minister Ian Borg has nominated U.S. President Donald Trump for the Nobel Peace Prize. Borg cited Trump's role in peace deals between Armenia and Azerbaijan. He also mentioned Trump's efforts to end conflicts in the Middle East and Ukraine. Th…", "content": "The foreign minister of European Union member state Malta said on Thursday that he had nominated U.S. President Donald Trump for the Nobel Peace Prize.Ian Borg, in a Facebook post, cited Trump's succ… [+1223 chars]", "url": "https://economictimes.indiatimes.com/news/international/world-news/malta-foreign-minister-nominates-trump-for-nobel-peace-prize/articleshow/124421769.cms", "source": "The Times of India", "published_at": "2025-10-09T14:15:37Z", "relevance_score": 0.31}, {"title": "Will tomorrow be good Friday for The Peace President Donald Trump or Norway face backlash for Nobel Prize loss? Here's selection process, leading contenders, can Trump win ever, who nominated president", "description": "As the 2025 Nobel Peace Prize announcement nears, speculation surrounds US President Donald Trump’s chances. Despite lobbying and multiple nominations, experts believe Trump is unlikely to win. Norway braces for potential political backlash if Trump is denied…", "content": "Will tomorrow be good Friday for The Peace President Donald Trump or will Norway face backlash for Nobel Prize loss? The Nobel Peace Prize 2025 announcement has created intense global attention as Do… [+5565 chars]", "url": "https://economictimes.indiatimes.com/news/international/us/will-tomorrow-be-good-friday-for-the-peace-president-donald-trump-or-norway-face-backlash-for-nobel-prize-loss-heres-selection-process-leading-contenders-can-trump-win-ever-who-nominated-president-norwegian-nobel-committee-trumps-peace-efforts-political-diplomatic-pressure-chances/articleshow/124430370.cms", "source": "The Times of India", "published_at": "2025-10-09T17:37:21Z", "relevance_score": 0.31}, {"title": "Nobel Prize 2025 in Chemistry awarded to Susumu Kitagawa, Richard Robson & Omar M. Yaghi for 'development of new molecular architecture'", "description": "The 2025 Nobel Prize in Chemistry honours Susumu Kitagawa, Richard Robson, and Omar M. Yaghi. Their work on metal-organic frameworks revolutionizes material science. These porous crystals offer new possibilities for gas storage and environmental solutions. Th…", "content": "The 2025 Nobel Prize in Chemistry has been awarded to Susumu Kitagawa, Richard Robson and Omar M. Yaghi for their groundbreaking work in developing a new type of molecular architecture known as metal… [+3363 chars]", "url": "https://economictimes.indiatimes.com/news/science/nobel-prize-2025-in-chemistry-awarded-to-susumu-kitagawa-richard-robson-and-omar-yaghi-for-metalorganic-frameworks/articleshow/124382931.cms", "source": "The Times of India", "published_at": "2025-10-08T09:50:37Z", "relevance_score": 0.31}, {"title": "Nobel Prize 2025 in Physics awarded to John Clarke, Michel Devoret and John Martinis for breakthroughs in quantum tunnelling", "description": "The Royal Swedish Academy of Sciences has awarded the 2025 Nobel Prize in Physics to John Clarke, Michel H. Devoret, and John M. Martinis. Their groundbreaking discovery of macroscopic quantum mechanical tunnelling and energy quantisation in electric circuits…", "content": "The 2025 Nobel Prize in Physics has been awarded to John Clarke, Michel H. Devoret, and John M. Martinis for experiments that demonstrated how quantum tunnelling and energy quantisation can be observ… [+1955 chars]", "url": "https://economictimes.indiatimes.com/news/science/nobel-prize-2025-in-physics-awarded-to-john-clarke-michel-devoret-and-john-martinis-for-breakthroughs-in-quantum-tunnelling/articleshow/124358709.cms", "source": "The Times of India", "published_at": "2025-10-07T09:50:33Z", "relevance_score": 0.31}, {"title": "László Krasznahorkai wins Nobel Prize 2025 in Literature: How to pronounce the Hungarian author’s name", "description": "Hungarian author László Krasznahorkai has won the 2025 Nobel Prize in Literature for his compelling and visionary oeuvre. The 70-year-old writer, known for his dense, poetic prose, was honored for reaffirming the power of art amidst apocalyptic terror. This m…", "content": "<ul><li>News</li>\r\n<li>lifestyle</li>\r\n<li>trending</li>\r\n<li>László Krasznahorkai wins Nobel Prize 2025 in Literature: How to pronounce the Hungarian authors name</li></ul>\r\nHungarian author László … [+320 chars]", "url": "https://timesofindia.indiatimes.com/etimes/trending/lszl-krasznahorkai-wins-nobel-prize-2025-in-literature-how-to-pronounce-the-hungarian-authors-name/articleshow/124421008.cms", "source": "The Times of India", "published_at": "2025-10-09T14:49:51Z", "relevance_score": 0.31}, {"title": "Meet Kitagawa, Robson & Yaghi - trio that bagged Nobel Prize in Chemistry for developing metal–organic frameworks", "description": "Susumu Kitagawa, Richard Robson, and Omar Yaghi were awarded the 2025 Nobel Prize in Chemistry for developing metal-organic frameworks (MOFs). These materials feature large cavities allowing molecules to pass through, enabling applications like water harvesti…", "content": "The trio comprising Susumu Kitagawa, Richard Robson and Omar M. Yaghi bagged the 2025 Nobel Prize in Chemistry by the Royal Swedish Academy of Sciences for creating new rooms for chemistry. The three… [+8007 chars]", "url": "https://economictimes.indiatimes.com/news/science/meet-kitagawa-robson-yaghi-trio-that-bagged-nobel-prize-in-chemistry-for-developing-metalorganic-frameworks/articleshow/124383192.cms", "source": "The Times of India", "published_at": "2025-10-08T10:12:10Z", "relevance_score": 0.31}, {"title": "László Krasznahorkai wins Nobel Prize 2025 in Literature: How to say the Hungarian author’s name", "description": "Hungarian author László Krasznahorkai has won the 2025 Nobel Prize in Literature for his compelling and visionary oeuvre. The 70-year-old writer, known for his dense, poetic prose, was honored for reaffirming the power of art amidst apocalyptic terror. This m…", "content": "<ul><li>News</li>\r\n<li>lifestyle</li>\r\n<li>trending</li>\r\n<li>László Krasznahorkai wins Nobel Prize 2025 in Literature: How to say the Hungarian authors name</li></ul>\r\nHungarian author László Kraszn… [+2243 chars]", "url": "https://timesofindia.indiatimes.com/etimes/trending/lszl-krasznahorkai-wins-nobel-prize-2025-in-literature-how-to-say-the-hungarian-authors-name/articleshow/124421008.cms", "source": "The Times of India", "published_at": "2025-10-09T14:09:53Z", "relevance_score": 0.31}, {"title": "U.S. scientist among trio awarded Nobel Prize in chemistry for developing new molecular architecture", "description": "Japanese scientist Susumu Kitagawa, Australian Richard Robson and American Omar M. Yaghi were awarded the Nobel Prize in Chemistry on Wednesday for developing a new form of molecular architecture.“Through the development of metal-organic frameworks, the laure…", "content": "Japanese scientist Susumu Kitagawa, Australian Richard Robson and American Omar M. Yaghi were awarded the Nobel Prize in Chemistry on Wednesday for developing a new form of molecular architecture.\r\nT… [+541 chars]", "url": "https://www.nbcnews.com/world/europe/us-scientist-nobel-prize-chemistry-new-molecular-architecture-rcna236305", "source": "NBC News", "published_at": "2025-10-08T10:11:23Z", "relevance_score": 0.31}, {"title": "Richard Robson, Kitagawa and Yaghi win Nobel Prize for discovery similar to bottomless 'Harry Potter' handbag; Here's what it means", "description": "Three scientists have won the Nobel Prize in Chemistry for creating new molecular structures. These structures can trap large amounts of gas. This breakthrough could help remove greenhouse gases from the atmosphere. It may also provide water in desert areas. …", "content": "Susumu Kitagawa, Richard Robson and Omar M. Yaghi won the Nobel Prize in chemistry Wednesday for their development of new molecular structures that can trap vast quantities of gas inside. The discove… [+3223 chars]", "url": "https://economictimes.indiatimes.com/news/new-updates/richard-robson-kitagawa-and-yaghi-win-nobel-prize-for-discovery-similar-to-bottomless-harry-potter-handbag-heres-what-it-means/articleshow/124393578.cms", "source": "The Times of India", "published_at": "2025-10-08T17:08:12Z", "relevance_score": 0.31}, {"title": "If Trump convinces China to abandon force against Taiwan he deserves Nobel prize, Taiwan president says", "description": "President Donald Trump should get the Nobel Peace Prize should he be able to convince Chinese President Xi Jinping to abandon the use of force against Taiwan, President Lai Ching-te told a conservative U.S. radio show and podcast in an interview.", "content": "TAIPEI President Donald Trump should get the Nobel Peace Prize should he be able to convince Chinese President Xi Jinping to abandon the use of force against Taiwan, President Lai Ching-te told a con… [+3304 chars]", "url": "https://www.nbcnews.com/world/asia/trump-convinces-china-abandon-force-taiwan-deserves-nobel-prize-taiwan-rcna236078", "source": "NBC News", "published_at": "2025-10-07T09:34:01Z", "relevance_score": 0.31}, {"title": "Nobel Prize in Literature 2025 awarded to Hungarian author László Krasznahorkai", "description": "Hungarian author László Krasznahorkai has been awarded the 2025 Nobel Prize in Literature for his compelling and visionary work. The Swedish Academy recognized his oeuvre for reaffirming the power of art amidst apocalyptic terror. This announcement follows th…", "content": "The Royal Swedish Academy of Sciences on Thursday awarded the 2025 Nobel Prize in Literature to Hungarian author László Krasznahorkai, recognised for his compelling and visionary oeuvre that, in the … [+1280 chars]", "url": "https://economictimes.indiatimes.com/news/international/world-news/nobel-prize-in-literature-2025-awarded-to-hungarian-author-lszl-krasznahorkai/articleshow/124412995.cms", "source": "The Times of India", "published_at": "2025-10-09T11:05:06Z", "relevance_score": 0.31}, {"title": "Donald Trump to win Nobel Peace Prize this Friday? Experts reject U.S President's 'peacemaker' claims", "description": "Nobel Prize 2025: This year, 338 individuals and organisations have been nominated for the peace prize, with the list kept secret for 50 years.", "content": "When it comes to this year's Nobel Peace Prize, one thing is almost certain: US President Donald Trump will not win, no matter how much he wants it. But who will? The Norwegian Nobel Committee in Osl… [+3947 chars]", "url": "https://economictimes.indiatimes.com/news/international/us/donald-trump-to-win-nobel-peace-prize-this-friday-experts-reject-u-s-presidents-peacemaker-claims/articleshow/124374777.cms", "source": "The Times of India", "published_at": "2025-10-08T02:23:22Z", "relevance_score": 0.31}, {"title": "Nobel Prize 2025 in Medicine awarded to Mary E. Brunkow, Fred Ramsdell and Shimon Sakaguchi for discoveries in immune tolerance", "description": "The 2025 Nobel Prize in Physiology or Medicine has been awarded to Mary E. Brunkow, Fred Ramsdell and Shimon Sakaguchi “for their discoveries concerning peripheral immune tolerance,” a breakthrough that has transformed understanding of how the body prevents t…", "content": "The 2025 Nobel Prize in Physiology or Medicine has been awarded to Mary E. Brunkow, Fred Ramsdell and Shimon Sakaguchi for their discoveries concerning peripheral immune tolerance, a breakthrough tha… [+2266 chars]", "url": "https://economictimes.indiatimes.com/news/science/nobel-prize-2025-in-medicine-awarded-to-mary-e-brunkow-fred-ramsdell-and-shimon-sakaguchi-for-discoveries-in-immune-tolerance/articleshow/124335972.cms", "source": "The Times of India", "published_at": "2025-10-06T09:32:56Z", "relevance_score": 0.31}, {"title": "Nobel Physics prize awarded to U.S. trio for discoveries in quantum mechanics", "description": "The Nobel Prize in Physics was on Tuesday awarded to three U.S.-based scientists for their discoveries in quantum mechanics.", "content": "The Nobel Prize in Physics was on Tuesday awarded to three U.S.-based scientists for their discoveries in quantum mechanics. \r\nThe Royal Swedish Academy of Sciences awarded the prize to John Clarke, … [+176 chars]", "url": "https://www.nbcnews.com/world/europe/nobel-physics-prize-quantum-mechanics-rcna236082", "source": "NBC News", "published_at": "2025-10-07T10:02:46Z", "relevance_score": 0.31}, {"title": "Nobel Prize in Medicine: How a Japanese scientist swam against the tide to study how our body's immune cells really work", "description": "Three scientists have won the Nobel Prize in Medicine for their work on immune tolerance. Shimon Sakaguchi's 1995 discovery identified regulatory T cells, a new class of immune cells. Mary Brunkow and Fred Ramsdell later explained a gene mutation linked to au…", "content": "In the first of the Nobel Awards of 2025, Mary E. Brunkow, Fred Ramsdell and Dr. Shimon Sakaguchi won the Nobel Prize in medicine Monday for their discoveries concerning peripheral immune tolerance. … [+3932 chars]", "url": "https://economictimes.indiatimes.com/news/new-updates/nobel-prize-in-medicine-how-a-japanese-scientist-swam-against-the-tide-to-study-how-our-bodys-immune-cells-really-work/articleshow/124343986.cms", "source": "The Times of India", "published_at": "2025-10-06T16:14:27Z", "relevance_score": 0.31}, {"title": "Is Gaza peace plan ‘first phase’ breakthrough Trump’s final push before Nobel Peace Prize announcement? 10 key facts you need to know", "description": "Trump announced a breakthrough in the Israel-Hamas conflict, with both sides agreeing to a \"first phase\" peace plan involving hostage and prisoner exchanges and troop withdrawal. This development comes just before the Nobel Peace Prize announcement. The US pr…", "content": "US President Donald Trump announced on Wednesday (October 8, 2025) that Israel and Hamas have agreed to the first phase of his peace plan to pause fighting and release at least some hostages and pris… [+5215 chars]", "url": "https://economictimes.indiatimes.com/news/international/us/is-gaza-peace-plan-first-phase-breakthrough-trumps-final-push-before-nobel-peace-prize-announcement-10-key-facts-you-need-to-know/articleshow/124405898.cms", "source": "The Times of India", "published_at": "2025-10-09T05:43:56Z", "relevance_score": 0.3}, {"title": "Nobel Prize in Physiology announced: How three scientists unlocked new secrets of the human immune system", "description": "Three scientists have been awarded the Nobel Prize in Physiology or Medicine for their work on peripheral immune tolerance. Mary Brunkow, Fred Ramsdell, and Shimon Sakaguchi's discoveries explain autoimmune diseases and transplant failures. Their research pav…", "content": "Navratri 2025: Shraddha Kapoor, Alia Bhatt, and other divas' inspired pink ethnic looks for day 9", "url": "https://timesofindia.indiatimes.com/etimes/trending/nobel-prize-in-physiology-announced-how-three-scientists-unlocked-new-secrets-of-the-human-immune-system/articleshow/124342066.cms", "source": "The Times of India", "published_at": "2025-10-06T14:18:27Z", "relevance_score": 0.3}, {"title": "Trio gets Nobel Prize in Medicine for work on immune system", "description": "US scientists Mary Brunkow, Fred Ramsdell, and Japan's Shimon Sakaguchi have been awarded the 2025 Nobel Prize in Medicine. Their groundbreaking research on regulatory T cells, the immune system's 'security guards,' offers new avenues for treating cancer and …", "content": "Navratri 2025: Shraddha Kapoor, Alia Bhatt, and other divas' inspired pink ethnic looks for day 9", "url": "https://timesofindia.indiatimes.com/world/us/trio-gets-med-nobel-for-work-on-immune-system/articleshow/124351225.cms", "source": "The Times of India", "published_at": "2025-10-07T02:02:46Z", "relevance_score": 0.3}, {"title": "Trio win Nobel chemistry prize for work on 'Hermione's handbag' materials", "description": "Susumu Kitagawa, Richard Robson, and Omar Yaghi have been awarded the 2025 Nobel Prize in Chemistry for their groundbreaking work on metal-organic frameworks (MOFs). These innovative materials, with exceptionally large surface areas, offer solutions for criti…", "content": "Karwa Chauth 2025: Bollywood divas approved lehenga looks for the festival", "url": "https://timesofindia.indiatimes.com/science/trio-win-chem-nobel-for-work-on-hermiones-handbag-materials/articleshow/124402775.cms", "source": "The Times of India", "published_at": "2025-10-09T02:28:02Z", "relevance_score": 0.3}, {"title": "Still a mystery: why is there no nobel prize for mathematics?", "description": "Alfred Nobel excluded mathematics from his prizes, likely due to his focus on tangible benefits to mankind, viewing math as too theoretical. While personal rivalry theories are disproven, mathematics already had recognition channels. The Fields Medal now serv…", "content": "Navratri 2025: Shraddha Kapoor, Alia Bhatt, and other divas' inspired pink ethnic looks for day 9", "url": "https://timesofindia.indiatimes.com/science/still-a-mystery-why-is-there-no-nobel-prize-for-mathematics/articleshow/124334126.cms", "source": "The Times of India", "published_at": "2025-10-06T08:15:12Z", "relevance_score": 0.3}, {"title": "2025 Nobel Prize in Chemistry has a 'magical' Harry Potter connection and works like Hermione Granger’s bottomless handbag", "description": "Three scientists have earned the 2025 Nobel Prize in Chemistry for pioneering metal-organic frameworks (MOFs). These revolutionary molecular structures, likened to Hermione Granger's magical bag, can trap and store gases with remarkable efficiency. Their grou…", "content": "Investment Ideas\r\nGrow your wealth with stock ideas &amp; sectoral trends.\r\nStock Reports Plus\r\nBuy low &amp; sell high with access to Stock Score, Upside potential &amp; more. \r\nBigBull Portfolio\r\nG… [+439 chars]", "url": "https://economictimes.indiatimes.com/news/new-updates/2025-nobel-prize-in-chemistry-has-a-magical-harry-potter-connection-and-works-like-hermione-grangers-bottomless-handbag/articleshow/124412694.cms", "source": "The Times of India", "published_at": "2025-10-09T10:49:30Z", "relevance_score": 0.3}, {"title": "An American immunologist won the Nobel Prize—but found out 20 hours late. Here’s the story", "description": "Fred Ramsdell, a leading immunologist, has won the 2025 Nobel Prize in Medicine. He received the award while on a preplanned hiking trip in the Rocky Mountains, disconnected from his phone. His wife discovered the news upon regaining cell service. Ramsdell wa…", "content": "Fred Ramsdell, 64, a leading immunologist, was far from the glare of the scientific spotlight and deep in the Rocky Mountains, hiking and camping without his phonewhen he became a global medicine phe… [+2259 chars]", "url": "https://economictimes.indiatimes.com/news/new-updates/an-american-immunologist-won-the-nobel-prizebut-found-out-20-hours-late-heres-the-story/articleshow/124384052.cms", "source": "The Times of India", "published_at": "2025-10-08T10:26:38Z", "relevance_score": 0.3}, {"title": "Nobel Prize for Physics awarded to trio for quantum mechanics discoveries", "description": "Prize awarded for \"discovery of macroscopic quantum mechanical tunnelling, energy quantisation in an electric circuit\".", "content": "The Royal Swedish Academy of Sciences has awarded the 2025 Nobel Prize in Physics to John Clarke, Michel H. Devoret, and John M. Martinis for work on quantum mechanic tunnelling.\r\nThe award, announce… [+780 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/nobel-prize-for-physics-awarded-for-quantum-mechanic-tunnelling", "source": "Al Jazeera English", "published_at": "2025-10-07T09:52:47Z", "relevance_score": 0.28}, {"title": "Nobel literature buzz tips Swiss postmodernist, Australians for prize", "description": "Swiss postmodernist novelist Christian Kracht and Australia'ahead of the Swedish Academy's much-anticipated announcement on Thursday. Among possible winners frequently mentioned this year are Australia's Gerald Murnane and his Aboriginal colleague Alexis Wrig…", "content": "Swiss postmodernist novelist Christian Kracht and Australia's Gerald Murnane and Alexis Wright are among the favourites for the Nobel literature prize, experts told AFP ahead of the Swedish Academy's… [+4319 chars]", "url": "https://economictimes.indiatimes.com/news/international/world-news/nobel-literature-buzz-tips-swiss-postmodernist-australians-for-prize/articleshow/124352542.cms", "source": "The Times of India", "published_at": "2025-10-07T03:32:36Z", "relevance_score": 0.28}, {"title": "Who is Omar Yaghi, scientist born to Palestinian refugees who won the 2025 Nobel Prize in Chemistry", "description": "Omar Yaghi, a Nobel laureate in Chemistry, overcame a humble upbringing in Jordan, marked by scarcity and limited education for his parents. His journey from a one-room home to pioneering metal-organic frameworks highlights science as a powerful equalizer, un…", "content": "Omar Yaghi, a Jordanian-American chemist of Palestinian origin, was somewhere between flights when the call came through. The Nobel Committee was on the line. My parents could barely read or write, h… [+5289 chars]", "url": "https://economictimes.indiatimes.com/news/international/global-trends/who-is-omar-yaghi-scientist-born-to-palestinian-refugees-who-won-the-2025-nobel-prize-in-chemistry/articleshow/124405087.cms", "source": "The Times of India", "published_at": "2025-10-09T04:53:31Z", "relevance_score": 0.275}, {"title": "Nobel Prize in Physiology or Medicine: Which Indian won it first and why?", "description": "Har Gobind Khorana, a Nobel laureate, deciphered the genetic code, revealing how DNA sequences specify amino acids. His pioneering work in gene synthesis at MIT laid the groundwork for genetic engineering and biotechnology. Khorana's contributions extended to…", "content": "Navratri 2025: Shraddha Kapoor, Alia Bhatt, and other divas' inspired pink ethnic looks for day 9", "url": "https://timesofindia.indiatimes.com/education/learning-with-toi/nobel-prize-in-physiology-or-medicine-which-indian-won-it-first-and-why/articleshow/124340638.cms", "source": "The Times of India", "published_at": "2025-10-06T13:06:39Z", "relevance_score": 0.27}, {"title": "Nobel Peace Prize 2025: What are Trump’s credentials, and can he win?", "description": "With the Gaza ceasefire deal, Trump claims to have helped broker peace in eight wars. Do his assertions hold up?", "content": "As the Norwegian Nobel Committee prepares to announce this years winner of the Nobel Peace Prize, one name, one persona hovers over its decision the United States president, Donald Trump.\r\nSince step… [+11807 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/nobel-peace-prize-2025-what-are-trumps-credentials-and-can-he-win", "source": "Al Jazeera English", "published_at": "2025-10-09T10:39:50Z", "relevance_score": 0.255}, {"title": "Nobel Prize for Literature awarded to Hungarian writer László Krasznahorkai", "description": "Krasznahorkai, 71, was recognised for his \"compelling and visionary oeuvre\".", "content": "The Royal Swedish Academy of Sciences has awarded the 2025 Nobel Prize in Literature to Hungarian novelist and screenwriter László Krasznahorkai.\r\nThe second Hungarian to win the prestigious literary… [+1876 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/nobel-prize-for-literature-awarded", "source": "Al Jazeera English", "published_at": "2025-10-09T11:05:59Z", "relevance_score": 0.25}, {"title": "Nobel Prize for medicine awarded to immune system researchers", "description": "The international team discovered how the immune system is kept in check to prevent it attacking the body.", "content": "The Nobel Prize in physiology or medicine has been awarded to Mary E Brunkow, Fred Ramsdell and Shimon Sakaguchi for their work on the functioning of the human immune system.\r\nThe award, announced by… [+1505 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/nobel-prize-for-medicine-awarded-to-immune-system-researchers", "source": "Al Jazeera English", "published_at": "2025-10-06T09:37:31Z", "relevance_score": 0.25}, {"title": "Chemistry Nobel Prize awarded to trio in field of metal–organic frameworks", "description": "Susumu Kitagawa, Richard Robson and Omar M Yaghi’s work can be used to harvest water from desert air.", "content": "The Royal Swedish Academy of Sciences has awarded the 2025 Nobel Prize in chemistry to Susumu Kitagawa, Richard Robson and Omar M Yaghi for their work in the development of metal-organic frameworks.\r… [+1226 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/nobel-prize-in-chemistry-awarded", "source": "Al Jazeera English", "published_at": "2025-10-08T09:56:46Z", "relevance_score": 0.25}, {"title": "Nobel in Physics goes to 3 scientists for work on quantum technology", "description": "One of 2025's three Nobel Prize in Physics winners says the trio's work is \"one of the underlying reasons that cellphones work.''", "content": "Stockholm — John Clarke, Michel H. Devoret and John M. Martinis won the Nobel Prize in Physics on Tuesday for research on seemingly obscure quantum tunneling that is advancing digital technology.\r\n C… [+4095 chars]", "url": "https://www.cbsnews.com/news/nobel-prize-in-physics-2025-quantum-tunneling-technology/", "source": "CBS News", "published_at": "2025-10-07T12:26:10Z", "relevance_score": 0.22000000000000003}, {"title": "No peace: Trump's smoldering Nobel obsession", "description": "Donald Trump's persistent pursuit of the Nobel Peace Prize, fueled by a desire for prestige and a rivalry with Barack Obama, has intensified as the 2025 winner nears announcement. Despite claiming credit for ending seven wars, many of his assertions are dispu…", "content": "Washington: Donald Trump has made no secret of the fact that he is obsessed with winning the Nobel Peace Prize. But so far the award has eluded him throughout his two US presidencies.Trump's push for… [+3411 chars]", "url": "https://economictimes.indiatimes.com/news/international/global-trends/no-peace-trumps-smoldering-nobel-obsession/articleshow/124374396.cms", "source": "The Times of India", "published_at": "2025-10-08T01:10:57Z", "relevance_score": 0.22000000000000003}, {"title": "'Hello, you've won a Nobel, hello?' [Click]", "description": "Nobel laureates are often unreachable when the call of a lifetime comes, with some opting for phone detoxes or disappearing off-grid. This elusiveness poses a challenge for the Nobel Committee, who must contact winners for the prestigious award ceremony. The …", "content": "Not everyone is desperate to win the Nobel Prize so as to always keep one's phone literally handy, or have a dedicated office line to receive a call from the good people in Sweden - or Oslo, if it's … [+1154 chars]", "url": "https://economictimes.indiatimes.com/opinion/just-in-jest/hello-youve-won-a-nobel-hello-click/articleshow/124395879.cms", "source": "The Times of India", "published_at": "2025-10-08T18:14:26Z", "relevance_score": 0.19}, {"title": "'The Peace President': White House cheers for Trump ahead of Nobel announcement. What are his chances of wining?", "description": "The White House has promoted US President Donald Trump as 'The Peace President' ahead of the Nobel Peace Prize announcement. Trump has claimed to have settled seven global conflicts. However, experts suggest his chances are slim due to his approach to interna…", "content": "Ahead of the Nobel Peace prize announcement, the White House Thursday shared a photo of US President Donald Trump on social media, hailing him as \"The Peace President\". Despite claiming that he has s… [+5118 chars]", "url": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-the-peace-president-white-house-cheers-for-trump-ahead-of-nobel-announcement-what-are-his-chances-of-wining/articleshow/124427631.cms", "source": "The Times of India", "published_at": "2025-10-09T16:28:44Z", "relevance_score": 0.19}, {"title": "Computer advances and 'invisibility cloak' vie for physics Nobel", "description": "The Nobel Prize in Physics is set to be announced, with potential honorees recognized for advancements in wavelet theory powering image compression, \"invisibility cloak\" research, and the science behind the James Webb Space Telescope. Other speculated fields …", "content": "A maths theory powering computer image compression, an \"invisibility cloak\" or the science behind the James Webb Space Telescope are some achievements that could be honoured when the Nobel physics pr… [+4176 chars]", "url": "https://economictimes.indiatimes.com/tech/technology/computer-advances-and-invisibility-cloak-vie-for-physics-nobel/articleshow/124352330.cms", "source": "The Times of India", "published_at": "2025-10-07T03:13:11Z", "relevance_score": 0.185}, {"title": "'It's a big day': Trump moves closer to Middle East peace — and maybe a prize", "description": "ANALYSIS: Even if Trump succeeds in the Middl East where his predecessors failed, a Nobel prize would still be a longshot.", "content": "WASHINGTON President Donald Trump likes to enumerate the peace deals he says he forged seven at last count.\r\nBut two that have eluded him potentially mean the most to his legacy and his dogged pursui… [+5315 chars]", "url": "https://www.nbcnews.com/politics/donald-trump/trump-moves-closer-middle-east-peace-nobel-prize-rcna235554", "source": "NBC News", "published_at": "2025-10-04T01:09:17Z", "relevance_score": 0.18}, {"title": "What is common between Nobel Laureate Mary E. Brunkow and Amazon chairman Jeff Bezos? They both went to…", "description": "Nobel laureate Mary E. Brunkow and Amazon chairman Jeff Bezos share an unexpected connection: Princeton University. While Brunkow revolutionized immunology and won the 2025 Nobel Prize, Bezos transformed global commerce through Amazon. Their journeys, decades…", "content": "Navratri 2025: Shraddha Kapoor, Alia Bhatt, and other divas' inspired pink ethnic looks for day 9", "url": "https://timesofindia.indiatimes.com/education/news/what-is-common-between-nobel-laureate-mary-e-brunkow-and-amazon-chairman-jeff-bezos-they-both-went-to/articleshow/124340158.cms", "source": "The Times of India", "published_at": "2025-10-06T12:32:30Z", "relevance_score": 0.18}, {"title": "Meet the 2025 Nobel laureates in Physiology: Degrees and labs that shaped their careers", "description": "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi received the 2025 Nobel Prize for their discoveries in peripheral immune tolerance. Sakaguchi identified regulatory T cells, while Brunkow and Ramsdell linked FOXP3 gene mutations to T-reg dysfunction, revo…", "content": "Navratri 2025: Shraddha Kapoor, Alia Bhatt, and other divas' inspired pink ethnic looks for day 9", "url": "https://timesofindia.indiatimes.com/education/news/meet-the-2025-nobel-laureates-in-physiology-degrees-and-labs-that-shaped-their-careers/articleshow/124338734.cms", "source": "The Times of India", "published_at": "2025-10-06T11:27:57Z", "relevance_score": 0.18}, {"title": "Three scientists win Physics Nobel for work that paved way for cellphones", "description": "US scientists John Clarke, Michel Devoret, and John Martinis have won the 2025 Nobel Prize in Physics for groundbreaking experiments demonstrating quantum physics in action. Their work, proving quantum tunneling and energy quantization in a visible system, la…", "content": "Shakha Pola designs for Bengali women", "url": "https://timesofindia.indiatimes.com/world/us/three-scientists-win-physics-nobel-for-work-that-paved-way-for-cellphones/articleshow/124375320.cms", "source": "The Times of India", "published_at": "2025-10-08T02:56:55Z", "relevance_score": 0.18}, {"title": "Meet the 2025 Nobel laureates in Physics: Where they studied and how their research shaped quantum science", "description": "The 2025 Nobel Prize in Physics honours John Clarke, Michel Devoret, and John Martinis for revealing quantum phenomena in everyday circuits. Their experiments demonstrated quantum tunnelling and energy quantisation in systems large enough to hold, bridging th…", "content": "Navratri 2025: Shraddha Kapoor, Alia Bhatt, and other divas' inspired pink ethnic looks for day 9", "url": "https://timesofindia.indiatimes.com/education/news/meet-the-nobel-2025-laureates-in-physics-where-they-studied-and-how-their-research-shaped-quantum-science/articleshow/124361344.cms", "source": "The Times of India", "published_at": "2025-10-07T11:08:55Z", "relevance_score": 0.18}, {"title": "Meet Clarke, Devoret and Martinis — the 2025 Nobel laureates who brought quantum tunnelling to life", "description": "Three physicists at UC Berkeley have been awarded the 2025 Nobel Prize in Physics.  They discovered quantum mechanical tunnelling and energy quantisation in an electric circuit.  This groundbreaking work proved quantum rules exist in visible, tangible systems…", "content": "In the quiet corridors of the University of California, Berkeley, sometime in the mid-1980s, three physicists -- John Clarke, Michel H. Devoret, and John M. Martinis -- were building what looked like… [+6335 chars]", "url": "https://economictimes.indiatimes.com/news/science/meet-clarke-devoret-and-martinis-the-2025-nobel-laureates-who-brought-quantum-tunnelling-to-life/articleshow/124360033.cms", "source": "The Times of India", "published_at": "2025-10-07T10:08:00Z", "relevance_score": 0.18}, {"title": "Meet Bastian, winner of \"People's\" World's Cutest Rescue Dog Contest", "description": "First on \"CBS Mornings,\" Bastian takes home the title of \"People's\" World's Cutest Rescue Dog. His owner, Joelle, shares their story.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/meet-bastian-winner-of-peoples-worlds-cutest-rescue-dog-contest/", "source": "CBS News", "published_at": "2025-10-08T13:28:00Z", "relevance_score": 0.12}, {"title": "Six-time Grammy Award-winner Jason Isbell on his new album", "description": "Six-time Grammy Award-winning singer-songwriter Jason Isbell is back on CBS Saturday Mornings with songs from his new album, \"Foxes in the Snow,\" his first in a decade with his band, \"The 400 Unit.\"", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/six-time-grammy-award-winner-jason-isbell-on-his-new-album/", "source": "CBS News", "published_at": "2025-10-04T13:51:00Z", "relevance_score": 0.12}, {"title": "Ukraine's Donetsk region seen as Russia’s gateway, not the ultimate prize in war", "description": "For more than a decade, Russian aggression has made Ukraine’s Donetsk region synonymous with war", "content": "DONETSK REGION, Ukraine -- DONETSK REGION, Ukraine (AP) From a bunker in eastern Ukraine, the 33-year-old soldier asks her comrade to fly a reconnaissance drone over her childhood home, hoping for a … [+5472 chars]", "url": "https://abcnews.go.com/International/wireStory/ukraines-donetsk-region-russias-gateway-ultimate-prize-war-126281336", "source": "ABC News", "published_at": "2025-10-07T08:08:16Z", "relevance_score": 0.12}, {"title": "With Mideast deal, Trump is on the brink of a major diplomatic accomplishment", "description": "US President Donald Trump is close to securing a ceasefire between Israel and Hamas, which could end years of conflict and free the remaining hostages. The deal, if sustained, may mark his biggest diplomatic success and strengthen his Nobel Peace Prize prospe…", "content": "President Donald Trump is at the brink of the biggest diplomatic accomplishment of his second term -- a cessation of the brutal war between Israel and Hamas -- and on Wednesday evening he made clear … [+6409 chars]", "url": "https://economictimes.indiatimes.com/news/international/global-trends/with-mideast-deal-trump-is-on-the-brink-of-a-major-diplomatic-accomplishment/articleshow/124404530.cms", "source": "The Times of India", "published_at": "2025-10-09T04:18:43Z", "relevance_score": 0.06}, {"title": "10/4: Saturday Morning", "description": "Hamas says it agrees to parts of Trump’s proposed peace plan for Gaza; Six-time Grammy Award-winner Jason Isbell on his new album", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/100425-saturday-morning/", "source": "CBS News", "published_at": "2025-10-04T16:53:25Z", "relevance_score": 0.03}, {"title": "Jennifer Hudson reflects on fourth season of \"The Jennifer Hudson Show\"", "description": "Jennifer Hudson, an EGOT winner known for her powerful voice and magnetic presence, is celebrating the fourth season of her Emmy-nominated daytime series, \"The Jennifer Hudson Show.\" She joins \"CBS Mornings\" to talk about its success.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/jennifer-hudson-reflects-on-fourth-season-of-the-jennifer-hudson-show/", "source": "CBS News", "published_at": "2025-10-07T14:14:00Z", "relevance_score": 0.03}, {"title": "Daniel Day-Lewis and Ronan Day-Lewis on making \"Anemone\"", "description": "Three-time Oscar-winner Daniel Day-Lewis has been absent from movie screens for eight years, until a collaboration with his son, Ronan, brought him back. They talk with Jane Pauley about their new film \"Anemone,\" the story of a man living in self-exile. Danie…", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/daniel-day-lewis-and-ronan-day-lewis-on-making-anemone/", "source": "CBS News", "published_at": "2025-10-05T14:20:00Z", "relevance_score": 0.03}, {"title": "More Than The Score", "description": "World Cup Winner Lewis Moody reveals MND diagnosis.", "content": "Available for over a year\r\nFormer England captain Lewis Moody has revealed he has been diagnosed with motor neurone disease. Moody was part of the side that won the 2003 World Cup. The 47 year old is… [+450 chars]", "url": "https://www.bbc.co.uk/sounds/play/p0m7253l", "source": "BBC News", "published_at": "2025-10-06T16:06:00Z", "relevance_score": 0.03}, {"title": "Here Are The Finalists For The 2025 National Book Awards", "description": "Fiction by Rabih Alameddine, Megha Majumdar, and Karen Russell, along with a memoir by Yiyun Li, are among this year's National Book Award finalists. On Tuesday, the National Book Foundation announced five nominees in each of five categories. Winners will be …", "content": "NEW YORK (AP) Fiction by Rabih Alameddine, Megha Majumdar and Karen Russell and a memoir of family tragedy by Yiyun Li are among this years finalists for the National Book Award. \r\nOn Tuesday, the Na… [+2713 chars]", "url": "https://apnews.com/article/alameddine-majumdar-yiyun-national-book-award-0975efbffec7baf2347eddfe3318a6fa", "source": "Associated Press", "published_at": "2025-10-07T16:04:00Z", "relevance_score": 0.03}, {"title": "BBC Inside Science", "description": "Renewables overtake coal as the world’s biggest source of electricity.", "content": "Available for over a year\r\nThis week, renewables overtake coal as the worlds biggest source of electricity. China is leading the renewable charge despite its global reputation as a coal burning pollu… [+1315 chars]", "url": "https://www.bbc.co.uk/sounds/play/m002kgs9", "source": "BBC News", "published_at": "2025-10-09T16:00:00Z", "relevance_score": 0.0}, {"title": "Trump draws international praise as broker of Israel-Hamas deal", "description": "Israeli President Isaac Herzog thanked Trump \"for his incredible leadership.\"", "content": "LONDON -- World leaders on Thursday issued a wave of statements commending Israel and Hamas for agreeing to the first phase of a ceasefire deal, with many also praising U.S. President Donald Trump fo… [+5096 chars]", "url": "https://abcnews.go.com/International/trump-draws-international-praise-broker-israel-hamas-deal/story?id=126356500", "source": "ABC News", "published_at": "2025-10-09T12:59:40Z", "relevance_score": 0.0}, {"title": "WATCH: Hamas responds to President Trump's proposal to end Gaza war", "description": "Hamas responded to President Trump's proposal for peace in Gaza, saying it will release all remaining hostages if Israel withdraws from Gaza and \"proper field conditions are met.\"", "content": "<ul><li>Sean 'Diddy' Combs sentenced to more than 4 years in prison\r\n</li><li>Prince William opens about family, legacy and the future of the royals \r\n</li><li>Trump tells Israel to stop bombing afte… [+4736 chars]", "url": "https://abcnews.go.com/International/video/hamas-responds-president-trumps-proposal-end-gaza-war-126211226", "source": "ABC News", "published_at": "2025-10-04T10:37:39Z", "relevance_score": 0.0}, {"title": "WATCH: Sean 'Diddy' Combs sentenced to 50 months in prison", "description": "Sean Combs sat expressionless in his seat when the judge sentenced him to just over four years in prison Friday for his conviction on two prostitution-related offenses.", "content": "<ul><li>Sean 'Diddy' Combs sentenced to more than 4 years in prison\r\n</li><li>Prince William opens about family, legacy and the future of the royals \r\n</li><li>Trump tells Israel to stop bombing afte… [+4736 chars]", "url": "https://abcnews.go.com/Entertainment/video/sean-diddy-combs-sentenced-50-months-prison-126211133", "source": "ABC News", "published_at": "2025-10-04T10:37:29Z", "relevance_score": 0.0}, {"title": "Israel-Hamas negotiations to start, spurred by Trump ceasefire plan", "description": "President Trump wants Israeli and Hamas negotiators to \"move fast\" in new talks aimed at securing a ceasefire in the Gaza war, spurred by his 20-point plan.", "content": "Jerusalem — Israel and Hamas have started indirect talks on a plan to end the war in Gaza.\r\nAn Egyptian official — speaking on condition of anonymity because he was not authorized to speak publicly a… [+6429 chars]", "url": "https://www.cbsnews.com/news/israel-hamas-negotiations-trump-ceasefire-deal-gaza-war-egypt-talks/", "source": "CBS News", "published_at": "2025-10-06T18:32:24Z", "relevance_score": 0.0}, {"title": "Israelis mark the second anniversary of the Hamas-led October 7th attacks", "description": "The attacks saw over 1,200 people killed and 251 others taken back to Gaza as hostages. It was the single deadliest day for Jews since the Holocaust. Israel responded by launching a military offensive in Gaza which has killed more than 67,000 people, accordin…", "content": "The attacks saw over 1,200 people killed and 251 others taken back to Gaza as hostages. It was the single deadliest day for Jews since the Holocaust. Israel responded by launching a military offensiv… [+745 chars]", "url": "https://www.bbc.co.uk/programmes/w172zss9mnyknk1", "source": "BBC News", "published_at": "2025-10-07T21:27:00Z", "relevance_score": 0.0}, {"title": "Alexis Ohanian and Shelly-Ann Fraser-Pryce spotlight women's track at Athlos NYC", "description": "Three-time Olympic gold medalist Shelly-Ann Fraser-Pryce joins \"CBS Mornings\" with Alexis Ohanian to discuss her retirement and the launch of Athlos NYC. The new competition celebrates the world's top female track and field athletes with the sport's largest c…", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/alexis-ohanian-and-shelly-ann-fraser-pryce-spotlight-womens-track-at-athlos-nyc/", "source": "CBS News", "published_at": "2025-10-09T14:01:00Z", "relevance_score": 0.0}, {"title": "MotoGP Indonesia: Aldeguer wins first race as Marquez, Bezzecchi crash out", "description": "Gresini's Fermin Aldeguer won his first career MotoGP after Marc Marquez and Marco Bezzecchi collided on opening lap.", "content": "Rookie Fermin Aldeguer earned the first victory of his fledgling MotoGP career at the Indonesia Grand Prix, while newly crowned champion Marc Marquez crashed out and was injured after a crunching col… [+2983 chars]", "url": "https://www.aljazeera.com/sports/2025/10/5/motogp-indonesia-aldeguer-wins-first-race-as-marquez-bezzecchi-crash-out", "source": "Al Jazeera English", "published_at": "2025-10-05T08:57:22Z", "relevance_score": 0.0}, {"title": "AI investments are pulling the US economy forward. Will it continue?", "description": "In the absence of tech-related spending, the US would be close to, or in, recession this year, experts say.", "content": "Despite United States President Donald Trumps tariff and immigration policies roiling businesses, the US economy is relatively stable. Experts say the country can thank the artificial intelligence (A… [+5164 chars]", "url": "https://www.aljazeera.com/economy/2025/10/9/ai-investments-are-pulling-the-us-economy-forward-will-it-continue", "source": "Al Jazeera English", "published_at": "2025-10-09T16:54:52Z", "relevance_score": 0.0}, {"title": "How Ladakh protest leader Sonam Wangchuk went from Indian hero to ‘traitor’", "description": "Wangchuk, a celebrated innovator, inspired a Bollywood megahit. Now he's being accused of challenging the Indian state.", "content": "New Delhi, India On the night of August 5, 2019, hundreds of Kashmiris were arrested amid a crackdown by Indian security forces that followed the Indian governments decision to strip the region of it… [+15015 chars]", "url": "https://www.aljazeera.com/features/2025/10/7/how-ladakh-protest-leader-sonam-wangchuk-went-from-indian-hero-to-traitor", "source": "Al Jazeera English", "published_at": "2025-10-07T02:53:02Z", "relevance_score": 0.0}, {"title": "Trump's Israel-Hamas ceasefire sparks cautious celebration but future remains unclear for Gaza", "description": "The previous ceasefire lasted from Jan. 19 to March 18, when Israel resumed military operations in Gaza.", "content": "President Donald Trump's announcement that Israel and Hamas have agreed the first phase of a ceasefire deal was widely welcomed Thursday by world leaders, the families of hostages and Palestinians wh… [+5509 chars]", "url": "https://www.nbcnews.com/world/israel/ceasefire-israel-hamas-gaza-palestinians-trump-netanyahu-qatar-rcna217806", "source": "NBC News", "published_at": "2025-10-09T09:15:48Z", "relevance_score": 0.0}, {"title": "Daily Lal Kitab Horoscope Today, October 10, 2025: Rahu can complicate deals for these Zodiac Signs", "description": "Today's Lal Kitab horoscopes blend planetary influences with practical advice. Focus on emotional balance and mindful action, as celestial bodies guide you to pause, reflect, and honor your inner rhythm. Simple remedies are offered to navigate potential chall…", "content": "Today's Lal Kitab horoscopes blend planetary influences with practical advice. Focus on emotional balance and mindful action, as celestial bodies guide you to pause, reflect, and honor your inner rhy… [+1826 chars]", "url": "https://timesofindia.indiatimes.com/astrology/horoscope/daily-lal-kitab-horoscope-today-october-10-2025-rahu-can-complicate-deals-for-these-zodiac-signs/articleshow/124381301.cms", "source": "The Times of India", "published_at": "2025-10-08T08:17:19Z", "relevance_score": 0.0}, {"title": "Horoscope Tomorrow, October 11, 2025: These zodiac signs will turn challenges into clarity", "description": "Tomorrow's horoscope guides each zodiac sign through relationship matters, job changes, and moments of reflection. Celestial guidance encourages trusting instincts and walking through the day confidently. Each sign receives specific advice, from Aries acting …", "content": "Tomorrow's horoscope guides each zodiac sign through relationship matters, job changes, and moments of reflection. Celestial guidance encourages trusting instincts and walking through the day confide… [+1838 chars]", "url": "https://timesofindia.indiatimes.com/astrology/horoscope/horoscope-tomorrow-october-11-2025-these-zodiac-signs-will-turn-challenges-into-clarity/articleshow/124388868.cms", "source": "The Times of India", "published_at": "2025-10-08T14:09:40Z", "relevance_score": 0.0}, {"title": "‘Do you want a player to die on court?’ – Tennis stars wilt in China heat", "description": "Weather conditions have led to player complaints; mercury is likely to rise through to Sunday's Shanghai Masters final.", "content": "Novak Djokovic threw up, Alexander Zverev poured sweat out of his shoe, and Emma Raducanu quit her match with dizziness and the bad news for the worlds top tennis players is that more baking weather … [+4320 chars]", "url": "https://www.aljazeera.com/sports/2025/10/8/do-you-want-a-player-to-die-on-court-tennis-stars-wilt-in-china-heat", "source": "Al Jazeera English", "published_at": "2025-10-08T09:29:03Z", "relevance_score": 0.0}, {"title": "Over 4 lakh cases pending in information commissions across India", "description": "As the Right to Information Act nears its 20th anniversary, a new report reveals over 4 lakh cases are pending in information commissions nationwide. Six commissions have been defunct, with Jharkhand and Himachal Pradesh still non-operational. Some states fac…", "content": "<ul><li>News</li>\r\n<li>India News</li>\r\n<li>Over 4 lakh cases pending in information commissions across India</li></ul>\r\nAs the Right to Information Act nears its 20th anniversary, a new report revea… [+1903 chars]", "url": "https://timesofindia.indiatimes.com/india/over-4-lakh-cases-pending-in-information-commissions-across-india/articleshow/124431507.cms", "source": "The Times of India", "published_at": "2025-10-09T17:38:21Z", "relevance_score": 0.0}, {"title": "Toll rises to 23 in MP poisoned cough syrup case; TN pharma owner held", "description": "India News: CHENNAI/BHOPAL/NAGPUR: The adulterated cough syrup death toll in MP rose to 23 after two more children died of renal failure on Thursday, while police.", "content": "<ul><li>News</li>\r\n<li>India News</li>\r\n<li>Toll rises to 23 in MP poisoned cough syrup case; TN pharma owner held</li></ul>\r\nFollow Us On Social Media\r\nPutin-Sympathizer Orban Secretly Sent Agents T… [+1526 chars]", "url": "https://timesofindia.indiatimes.com/india/toll-rises-to-23-in-mp-poisoned-cough-syrup-case-tn-pharma-owner-held/articleshow/124432827.cms", "source": "The Times of India", "published_at": "2025-10-09T18:04:11Z", "relevance_score": 0.0}, {"title": "Ahead of Delhi meet, Taliban seek India’s recognition for Islamic Emirate", "description": "India News: The Taliban are seeking an upgrade of their relationship with India in the form of diplomatic recognition, as the Afghanistan foreign minister Amir Kh.", "content": "<ul><li>News</li>\r\n<li>India News</li>\r\n<li>Ahead of Delhi meet, Taliban seek Indias recognition for Islamic Emirate</li></ul>\r\nFollow Us On Social Media\r\nAmerica 360: Trump Calls For Democrat Govern… [+1538 chars]", "url": "https://timesofindia.indiatimes.com/india/ahead-of-delhi-meet-taliban-seek-indias-recognition-for-islamic-emirate/articleshow/124434189.cms", "source": "The Times of India", "published_at": "2025-10-09T18:33:45Z", "relevance_score": 0.0}, {"title": "Daily Egyptian Horoscope for October 10, 2025: These zodiac signs may invite trouble by ignoring red flags today", "description": "Ancient Egyptian wisdom guides daily life, with divine forces influencing your path. Each zodiac sign receives tailored advice, encouraging introspection, self-acceptance, and mindful action. Whether seeking clarity, strength, or peace, the cosmos offers subt…", "content": "Ancient Egyptian wisdom guides daily life, with divine forces influencing your path. Each zodiac sign receives tailored advice, encouraging introspection, self-acceptance, and mindful action. Whether… [+3411 chars]", "url": "https://timesofindia.indiatimes.com/astrology/horoscope/daily-egyptian-horoscope-for-october-10-2025-these-zodiac-signs-may-invite-trouble-by-ignoring-red-flags-today/articleshow/124380822.cms", "source": "The Times of India", "published_at": "2025-10-08T08:00:46Z", "relevance_score": 0.0}, {"title": "Dog saved during Hurricane Florence wins People's cutest rescue dog contest", "description": "Bastian, a 7-year-old dog rescued from Hurricane Florence floodwaters, has been named People magazine's World's Cutest Rescue Dog.", "content": "A 7-year-old dog rescued from floodwaters during Hurricane Florence has been named People magazine's World's Cutest Rescue Dog. The announcement was made on Wednesday exclusively on \"CBS Mornings.\"\r\n… [+1580 chars]", "url": "https://www.cbsnews.com/news/bastian-worlds-cutest-rescue-dog-people-hurricane-florence/", "source": "CBS News", "published_at": "2025-10-08T17:02:56Z", "relevance_score": 0.0}, {"title": "Agent Orange and his nostalgia trip", "description": "Trump's latest MAGA plans of anachronistic 'Bullworker-style' muscle-flexing has all the traits of a DeLorean time machine that some of us recall from the 1985 film, Back to the Future.", "content": "Donald Trump is a 20th-c. militarist stuck in the 21st c. His nostalgia isn't restricted to the bumper sticker of 'Make America Great Again', but extends to a Cold War era plied by the likes of Nixon… [+1560 chars]", "url": "https://economictimes.indiatimes.com/opinion/et-editorial/agent-orange-and-his-nostalgia-trip/articleshow/124323827.cms", "source": "The Times of India", "published_at": "2025-10-05T17:22:43Z", "relevance_score": 0.0}, {"title": "No to Trump: Why Afghanistan’s neighbours have opposed US Bagram plan", "description": "Regional powers gather in Moscow to discuss Afghanistan’s future, signalling a new phase of post-US diplomacy.", "content": "Islamabad, Pakistan  Seated next to British Prime Minister Keir Starmer during a visit to the United Kingdom in September, United States President Donald Trump made clear he was eyeing a plot of land… [+12861 chars]", "url": "https://www.aljazeera.com/news/2025/10/9/no-to-trump-why-afghanistans-neighbours-have-opposed-us-bagram-plan", "source": "Al Jazeera English", "published_at": "2025-10-09T05:23:43Z", "relevance_score": 0.0}, {"title": "Drugs worth Rs 2.5cr seized, Nigerian held", "description": "Panaji: The anti-narcotic cell (ANC) of Goa police on Thursday seized drugs worth Rs 2.5 crore and arrested a Nigerian national. DySP ANC Nerlon Albuq.", "content": "Follow Us On Social Media\r\nPutin-Sympathizer Orban Secretly Sent Agents To Spy On European Union | DetailsKatie Porters Temper Caught on Camera: Democrats FURIOUS Outburst at Staffer ResurfacesPM Mod… [+1400 chars]", "url": "https://timesofindia.indiatimes.com/city/goa/drugs-worth-rs-2-5cr-seized-nigerian-held/articleshow/124433339.cms", "source": "The Times of India", "published_at": "2025-10-09T18:16:41Z", "relevance_score": 0.0}, {"title": "State amends municipalities act, raises council strength", "description": "Panaji: Govt has notified the Goa Municipalities (Amendment) Act, 2025, bringing two key changes to the decades-old Goa Municipalities Act, 1968. The .", "content": "Follow Us On Social Media\r\nPutin-Sympathizer Orban Secretly Sent Agents To Spy On European Union | DetailsKatie Porters Temper Caught on Camera: Democrats FURIOUS Outburst at Staffer ResurfacesPM Mod… [+1400 chars]", "url": "https://timesofindia.indiatimes.com/city/goa/state-amends-municipalities-act-raises-council-strength/articleshow/124433110.cms", "source": "The Times of India", "published_at": "2025-10-09T18:15:35Z", "relevance_score": 0.0}, {"title": "School Assembly News Headlines for October 10: Top national, international, sports and business update", "description": "India and the UK finalized a $468 million missile deal, while Tejashwi Yadav promised government jobs for all households ahead of Bihar polls. Afghanistan's Taliban foreign minister visited India to build ties. In international news, László Krasznahorkai won …", "content": "As we start a new day of learning, lets pause to reflect on the important events shaping both our country and the world. The news for October 9, 2025, spans political updates, global affairs, sports … [+7248 chars]", "url": "https://economictimes.indiatimes.com/news/new-updates/school-assembly-news-headlines-for-october-10-top-national-international-sports-and-business-update/articleshow/124417492.cms", "source": "The Times of India", "published_at": "2025-10-09T14:08:54Z", "relevance_score": 0.0}, {"title": "Many states holding similar events now, says CM, as Purple Fest kicks off", "description": "Panaji: State commissioner for persons with disabilities Guruprasad Pawaskar on Thursday said the three editions of Purple Fest not only had a social .", "content": "Follow Us On Social Media\r\nPutin-Sympathizer Orban Secretly Sent Agents To Spy On European Union | DetailsKatie Porters Temper Caught on Camera: Democrats FURIOUS Outburst at Staffer ResurfacesPM Mod… [+1400 chars]", "url": "https://timesofindia.indiatimes.com/city/goa/many-states-holding-similar-events-now-says-cm-as-purple-fest-kicks-off/articleshow/124433489.cms", "source": "The Times of India", "published_at": "2025-10-09T18:18:52Z", "relevance_score": 0.0}, {"title": "Speeding rental car crashes into wet cement at Calangute", "description": "Calangute: A speeding rent-a-cab, driven by a tourist from Noida, fell into wet cement of the under-construction Baga traffic circle at Calangute on W.", "content": "Follow Us On Social Media\r\nPutin-Sympathizer Orban Secretly Sent Agents To Spy On European Union | DetailsKatie Porters Temper Caught on Camera: Democrats FURIOUS Outburst at Staffer ResurfacesPM Mod… [+1400 chars]", "url": "https://timesofindia.indiatimes.com/city/goa/speeding-rental-car-crashes-into-wet-cement-at-calangute/articleshow/124433010.cms", "source": "The Times of India", "published_at": "2025-10-09T18:10:26Z", "relevance_score": 0.0}, {"title": "Toll rises to 23 in MP poisoned cough syrup case; TN pharma owner held", "description": "CHENNAI/BHOPAL/NAGPUR: The adulterated cough syrup death toll in MP rose to 23 after two more children died of renal failure on Thursday, while police.", "content": "Follow Us On Social Media\r\nPutin-Sympathizer Orban Secretly Sent Agents To Spy On European Union | DetailsKatie Porters Temper Caught on Camera: Democrats FURIOUS Outburst at Staffer ResurfacesPM Mod… [+1400 chars]", "url": "https://timesofindia.indiatimes.com/city/chennai/toll-rises-to-23-in-mp-poisoned-cough-syrup-case-tn-pharma-owner-held/articleshow/124432798.cms", "source": "The Times of India", "published_at": "2025-10-09T18:04:12Z", "relevance_score": 0.0}, {"title": "Damage to water pipe in Mapusa hits supply", "description": "Mapusa: A major water pipeline near Carvalho fuel pump in Mapusa was damaged on Thursday afternoon, affecting supply to Verla-Canca and Anjuna for sev.", "content": "Follow Us On Social Media\r\nKatie Porters Temper Caught on Camera: Democrats FURIOUS Outburst at Staffer ResurfacesPM Modi Speaks To Friend Trump, Discusses Trade, Congratulates Him On Gaza Peace Plan… [+1406 chars]", "url": "https://timesofindia.indiatimes.com/city/goa/damage-to-water-pipe-in-mapusa-hits-supply/articleshow/124432684.cms", "source": "The Times of India", "published_at": "2025-10-09T18:02:14Z", "relevance_score": 0.0}, {"title": "Rise in fatal road accidents & deaths despite earlier decline", "description": "Panaji: Fatal road accidents in the state increased by 13% for the first time this year, with the number of fatalities in Sep matching those of the sa.", "content": "Follow Us On Social Media\r\nKatie Porters Temper Caught on Camera: Democrats FURIOUS Outburst at Staffer ResurfacesPM Modi Speaks To Friend Trump, Discusses Trade, Congratulates Him On Gaza Peace Plan… [+1406 chars]", "url": "https://timesofindia.indiatimes.com/city/goa/rise-in-fatal-road-accidents-deaths-despite-earlier-decline/articleshow/124432734.cms", "source": "The Times of India", "published_at": "2025-10-09T18:03:25Z", "relevance_score": 0.0}, {"title": "HC notice to TCP on changes to building rules", "description": "Panaji: The Bombay high court on Thursday issued notices to the town and country planning department (TCP) and its scrutiny committee for amending the.", "content": "Follow Us On Social Media\r\nKatie Porters Temper Caught on Camera: Democrats FURIOUS Outburst at Staffer ResurfacesPM Modi Speaks To Friend Trump, Discusses Trade, Congratulates Him On Gaza Peace Plan… [+1406 chars]", "url": "https://timesofindia.indiatimes.com/city/goa/hc-notice-to-tcp-on-changes-to-building-rules/articleshow/124432657.cms", "source": "The Times of India", "published_at": "2025-10-09T18:01:02Z", "relevance_score": 0.0}]}