{"timestamp": 1760318260.352489, "data": [{"title": "‘We don’t want to disappear’: Tuvalu fights for climate action and survival", "description": "Pacific island nation explores new ways to survive climate change but needs help to build protective sea walls now.", "content": "Tuvalus Minister of Climate Change Maina Talia has told Al Jazeera that his country is fighting to stay above rising sea levels and needs real commitments from other countries that will allow Tuvalua… [+6326 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/we-dont-want-to-disappear-tuvalu-fights-for-climate-action-and-survival", "source": "Al Jazeera English", "published_at": "2025-10-10T01:07:30Z", "relevance_score": 0.655}, {"title": "Bill Nye warns U.S. could \"cede leadership to other countries\" if NASA budget is cut", "description": "Bill Nye the Science Guy on Monday protested against a federal budget proposal that would see NASA's funding reduced from $24 billion to $18.8 billion.", "content": "Bill Nye and hundreds of others gathered at Capitol Hill on Monday to protest against the Trump administration's proposed budget cuts to NASA, arguing that Congress has an obligation to promote the p… [+2497 chars]", "url": "https://www.cbsnews.com/news/bill-nye-protests-nasa-budget-cut-the-takeout/", "source": "CBS News", "published_at": "2025-10-07T00:45:11Z", "relevance_score": 0.62}, {"title": "Inhalers for asthma, COPD are climate change contributors, study finds", "description": "\"These emissions drive global warming, exacerbating the very respiratory conditions inhalers are meant to relieve,\" researchers wrote.", "content": "Inhalers that provide fast-acting treatment for people with certain respiratory conditions are contributing to greenhouse gas emissions, which can worsen both climate change and the conditions themse… [+2242 chars]", "url": "https://www.cbsnews.com/news/inhalers-produce-carbon-emissions-study/", "source": "CBS News", "published_at": "2025-10-07T20:58:55Z", "relevance_score": 0.595}, {"title": "Nobel in Physics goes to 3 scientists for work on quantum technology", "description": "One of 2025's three Nobel Prize in Physics winners says the trio's work is \"one of the underlying reasons that cellphones work.''", "content": "Stockholm — John Clarke, Michel H. Devoret and John M. Martinis won the Nobel Prize in Physics on Tuesday for research on seemingly obscure quantum tunneling that is advancing digital technology.\r\n C… [+4095 chars]", "url": "https://www.cbsnews.com/news/nobel-prize-in-physics-2025-quantum-tunneling-technology/", "source": "CBS News", "published_at": "2025-10-07T12:26:10Z", "relevance_score": 0.555}, {"title": "Bob Ross paintings to be auctioned to raise money for public TV after cuts", "description": "Thirty paintings by Bob Ross are set to be auctioned to support public television stations after federal funding cuts.", "content": "Thirty paintings created by the bushy-haired, soft-spoken Bob Ross will soon be up for auction to defray the costs of programming for small and rural public television stations suffering under cuts i… [+3392 chars]", "url": "https://www.cbsnews.com/news/bob-ross-paintings-auction-public-radio-broadcast-npr-pbs/", "source": "CBS News", "published_at": "2025-10-07T18:06:08Z", "relevance_score": 0.535}, {"title": "WATCH: The story behind the viral surprise father-daughter wedding dance video", "description": "Marissa Nielsen surprised her dad Greg Wickles by inviting her three older sisters to join in on a father-daughter dance at her wedding.", "content": "<ul><li>Israel's security cabinet approves 1st phase of Israel-Hamas ceasefire agreement\r\n</li><li>Inside Gaza as the 1st step toward a ceasefire unfolds\r\n</li><li>Trump says there will be 'everlasti… [+4642 chars]", "url": "https://abcnews.go.com/GMA/Family/video/story-viral-surprise-father-daughter-wedding-dance-video-126377848", "source": "ABC News", "published_at": "2025-10-09T19:33:49Z", "relevance_score": 0.49500000000000005}, {"title": "Government shutdown drags on after Senate fails again to pass funding bill", "description": "The government shutdown is in its seventh day following another Senate failure to pass a funding bill. CBS News' Taurean Small has more from Capitol Hill.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/government-shutdown-drags-on-after-senate-fails-again-to-pass-funding-bill/", "source": "CBS News", "published_at": "2025-10-07T12:56:00Z", "relevance_score": 0.48500000000000004}, {"title": "National WIC Association policy director on state of funding amid government shutdown", "description": "The government shutdown is threatening funding for free food programs. Ali Hard, public policy director of the National WIC Association, joins \"The Takeout\" to explain how the shutdown could impact millions of families reliant on the program.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/national-wic-association-policy-director-funding-government-shutdown/", "source": "CBS News", "published_at": "2025-10-10T22:41:00Z", "relevance_score": 0.48500000000000004}, {"title": "Senate to vote on short-term funding bill as Democrats, Republicans remain deadlocked", "description": "The Senate reconvenes Monday and is set to vote on a short-term funding bill as Democratic and Republican lawmakers remain deadlocked over the government shutdown. CBS News' Caitlin Huey-Burns has the latest from Capitol Hill.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/senate-to-vote-on-short-term-funding-bill-as-lawmakers-remain-deadlocked/", "source": "CBS News", "published_at": "2025-10-06T15:35:00Z", "relevance_score": 0.48500000000000004}, {"title": "Federal workers worry about government shutdown back pay as Senate repeatedly fails to pass funding", "description": "An Office of Management and Budget draft memo suggests that some furloughed workers may not get back pay after the government shutdown ends. This comes as Democrats and Republicans continue digging their heels in on funding solutions. CBS News' Zak Hudak and …", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/federal-workers-worry-about-government-shutdown-back-pay-as-senate-repeatedly-fails-to-pass-funding/", "source": "CBS News", "published_at": "2025-10-08T16:14:00Z", "relevance_score": 0.48500000000000004}, {"title": "Denmark to boost Arctic defence by $4.26bn, plans to buy 16 new F-35s", "description": "The investment is the latest in Denmark's multibillion-dollar spending spree amid Trump's threats to acquire Greenland.", "content": "Denmark plans to spend roughly 27.4 billion Danish kroner ($4.26bn) in an effort to shore up its defence capabilities in the Arctic and stave off threats made by United States President Donald Trump … [+3693 chars]", "url": "https://www.aljazeera.com/news/2025/10/11/denmark-to-boost-arctic-defence-by-4-26bn-plans-to-buy-16-new-f-35s", "source": "Al Jazeera English", "published_at": "2025-10-11T04:10:49Z", "relevance_score": 0.4700000000000001}, {"title": "Government shutdown updates: Senate to vote Monday on stopgap-funding measures", "description": "The Senate is scheduled to reconvene at 3 p.m. ET on Monday, as the federal government shutdown continues into its sixth day.", "content": "The Senate is scheduled to reconvene at 3 p.m. ET on Monday, as the federal government shutdown continues for a sixth day.\r\nThe body is expected to hold a vote at about 5:30 p.m. ET on a bill backed … [+1087 chars]", "url": "https://abcnews.go.com/Politics/live-updates/government-shutdown-live-updates/?id=126242587", "source": "ABC News", "published_at": "2025-10-06T09:14:36Z", "relevance_score": 0.4650000000000001}, {"title": "WATCH: Illinois governor responds to Trump's call to jail Democratic leaders", "description": "Illinois Gov. JB Pritzker responded after President Donald Trump called for his jailing in a social media post claiming Pritzker and Chicago Mayor Brandon Johnson have failed to protect ICE officers.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Rabbi reflects on Oct. 7 annive… [+4426 chars]", "url": "https://abcnews.go.com/US/video/illinois-governor-responds-trumps-call-jail-democratic-leaders-126343677", "source": "ABC News", "published_at": "2025-10-08T20:21:02Z", "relevance_score": 0.4650000000000001}, {"title": "‘Do you want a player to die on court?’ – Tennis stars wilt in China heat", "description": "Weather conditions have led to player complaints; mercury is likely to rise through to Sunday's Shanghai Masters final.", "content": "Novak Djokovic threw up, Alexander Zverev poured sweat out of his shoe, and Emma Raducanu quit her match with dizziness and the bad news for the worlds top tennis players is that more baking weather … [+4320 chars]", "url": "https://www.aljazeera.com/sports/2025/10/8/do-you-want-a-player-to-die-on-court-tennis-stars-wilt-in-china-heat", "source": "Al Jazeera English", "published_at": "2025-10-08T09:29:03Z", "relevance_score": 0.4650000000000001}, {"title": "White House memo says federal workers may not get automatic backpay: Report", "description": "The memo is seen as a pressure tactic on Democrats as the US government shutdown heads into its eighth day.", "content": "The White House is attempting to challenge a legal precedent that grants automatic back pay to hundreds of thousands of furloughed federal workers at the end of a government shutdown, according to me… [+3491 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/white-house-memo-says-federal-workers-may-not-get-automatic-backpay-report", "source": "Al Jazeera English", "published_at": "2025-10-08T04:54:31Z", "relevance_score": 0.4650000000000001}, {"title": "Fresh Russian incursions raise temperature for NATO in the Baltic Sea", "description": "Vaindloo island, a tiny rocky outcrop in the Gulf of Finland, is serving as an unlikely barometer for rising tensions between NATO and Russia.", "content": "LONDON -- Vaindloo island, a tiny rocky outcrop in the Gulf of Finland, is serving as an unlikely barometer for rising tensions between NATO and Russia.\r\nOn Sept. 19, three Russian MiG-31 jets entere… [+8567 chars]", "url": "https://abcnews.go.com/International/fresh-russian-incursions-raise-temperature-nato-baltic-sea/story?id=126293095", "source": "ABC News", "published_at": "2025-10-10T08:04:03Z", "relevance_score": 0.4650000000000001}, {"title": "AstraZeneca agrees to lower drug prices for Medicaid under Trump administration deal", "description": "AstraZeneca has agreed to lower prescription drug costs for Medicaid under a deal with the Trump administration", "content": "WASHINGTON -- WASHINGTON (AP) AstraZeneca on Friday became the second major pharmaceutical manufacturer to announce it had agreed to lower the cost of prescription drugs for Medicaid under a deal str… [+3585 chars]", "url": "https://abcnews.go.com/Politics/wireStory/astrazeneca-agrees-lower-drug-prices-medicaid-trump-administration-126418888", "source": "ABC News", "published_at": "2025-10-10T23:21:40Z", "relevance_score": 0.4600000000000001}, {"title": "Ethiopia claims Eritrea is readying to ‘wage war’ against it", "description": "In a letter to the UN, Ethiopia’s foreign minister claims Eritrea is colluding with a Tigray-based opposition group.", "content": "Ethiopia has accused Eritreas government of working with an opposition group based in Ethiopias northern Tigray region to prepare for a military offensive, underscoring concerns of renewed conflict i… [+2372 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/ethiopia-claims-eritrea-is-readying-to-wage-war-against-it", "source": "Al Jazeera English", "published_at": "2025-10-08T09:43:46Z", "relevance_score": 0.4600000000000001}, {"title": "Senate to reconvene over government funding, but the shutdown ending seems unlikely", "description": "The Senate reconvenes Monday after failing to pass legislation that would fund the government and end its current shutdown. CBS News political contributors and strategists Ashley Davis and Joel Payne join with more.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/senate-to-reconvene-end-to-shutdown-seems-unlikely/", "source": "CBS News", "published_at": "2025-10-06T14:03:00Z", "relevance_score": 0.45500000000000007}, {"title": "How much does a $200,000 HELOC cost monthly in today's rate climate?", "description": "Don't borrow equity with a $200,000 HELOC before crunching the monthly costs. Here's what to expect if you apply now.", "content": "Your home's equity can be a robust and affordable source to borrow from now.\r\nGetty Images/iStockphoto\r\nAt first glance, borrowing from your home equity can sound risky.\r\nYour home serves as collater… [+4000 chars]", "url": "https://www.cbsnews.com/news/how-much-does-200000-heloc-cost-monthly-october-2025-rate-climate/", "source": "CBS News", "published_at": "2025-10-10T16:41:56Z", "relevance_score": 0.44000000000000006}, {"title": "Indians hard hit as US student visas decline by a fifth from last year", "description": "Indian nationals see decrease of 45 percent compared to same period last year as US clamps down on foreign students.", "content": "The number of student visas issued by the United States has dropped by about one-fifth compared to the same one-month period last year, with India seeing a dramatic decline amid restrictive policies … [+2049 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/indians-hard-hit-as-us-student-visas-decline-by-a-fifth-from-last-year", "source": "Al Jazeera English", "published_at": "2025-10-06T21:04:28Z", "relevance_score": 0.44000000000000006}, {"title": "Chemistry Nobel Prize awarded to trio in field of metal–organic frameworks", "description": "Susumu Kitagawa, Richard Robson and Omar M Yaghi’s work can be used to harvest water from desert air.", "content": "The Royal Swedish Academy of Sciences has awarded the 2025 Nobel Prize in chemistry to Susumu Kitagawa, Richard Robson and Omar M Yaghi for their work in the development of metal-organic frameworks.\r… [+1226 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/nobel-prize-in-chemistry-awarded", "source": "Al Jazeera English", "published_at": "2025-10-08T09:56:46Z", "relevance_score": 0.43500000000000005}, {"title": "WATCH: Bystanders help lift helicopter after crash in Sacramento", "description": "New video shows drivers racing to lift a medical helicopter that crashed Monday night on a busy Sacramento highway.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Rabbi reflects on Oct. 7 annive… [+4426 chars]", "url": "https://abcnews.go.com/US/video/bystanders-lift-helicopter-after-crash-sacramento-126343225", "source": "ABC News", "published_at": "2025-10-08T20:13:57Z", "relevance_score": 0.43500000000000005}, {"title": "Cycling team to drop Israel name after mass pro-Palestinian Vuelta protests", "description": "Israel-Premier Tech cycling team will drop Israeli ties after multiple protests at the Vuelta a Espana race.", "content": "The IsraelPremier Tech cycling team will drop its ties to Israel from the 2026 season, following repeated pro-Palestinian protests against it at the recent Vuelta a Espana bike race.\r\nThe move was an… [+2447 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/cycling-team-to-drop-israel-name-after-mass-pro-palestinian-vuelta-protests", "source": "Al Jazeera English", "published_at": "2025-10-06T22:28:37Z", "relevance_score": 0.43500000000000005}, {"title": "Government shutdown halts data, stokes risk as economy wobbles, experts say", "description": "Federal agencies said they would not release some key data during the shutdown.", "content": "The government shutdown halted the release of key economic data, choking off the flow of information as some experts warn the economy may be slipping toward a recession, some economists told ABC News… [+4310 chars]", "url": "https://abcnews.go.com/Business/government-shutdown-halts-data-stokes-risk-economy-wobbles/story?id=126259604", "source": "ABC News", "published_at": "2025-10-06T17:44:02Z", "relevance_score": 0.405}, {"title": "Nestle quits global alliance on reducing dairy methane emissions", "description": "Food giant Nestle has withdrawn from the Dairy Methane Action Alliance, a global initiative aimed at reducing methane emissions from dairy farming. Despite leaving the alliance, Nestle stated it remains committed to its net-zero targets and will continue work…", "content": "Food group Nestle said on Wednesday it had withdrawn from a global alliance for cutting methane emissions that aims to reduce the impact of dairy farming on global warming.The Dairy Methane Action Al… [+2228 chars]", "url": "https://economictimes.indiatimes.com/news/international/world-news/nestle-quits-global-alliance-on-reducing-dairy-methane-emissions/articleshow/124410065.cms", "source": "The Times of India", "published_at": "2025-10-09T08:56:23Z", "relevance_score": 0.375}, {"title": "Interstellar comet passing by Mars seen in rare images", "description": "The images taken by two Mars orbiters show a bright, fuzzy white dot of the comet, also known as 3I/ATLAS, appearing to move against a backdrop of distant...", "content": "A rare interstellar comet only the third ever confirmed to enter our solar system was photographed last week, closely approaching Mars, the European Space Agency said Tuesday.\r\nThe images taken on Fr… [+1731 chars]", "url": "https://www.cbsnews.com/news/comet-passing-by-mars-images/?ftag=YHF4eb9d17", "source": "CBS News", "published_at": "2025-10-08T01:16:00Z", "relevance_score": 0.37}, {"title": "Extended interview: Bill Nye on the importance of funding NASA", "description": "Bill Nye the Science Guy joined hundreds of protesters in Washington, D.C., on Monday to demonstrate against the Trump administration's proposed budget cuts to NASA science activities. CBS News chief Washington correspondent Major Garrett spoke with Nye about…", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/extended-interview-bill-nye-importance-nasa-funding/", "source": "CBS News", "published_at": "2025-10-06T23:28:00Z", "relevance_score": 0.365}, {"title": "Senate voting on Democrat, Republican funding bills again as Americans feel government shutdown", "description": "The Senate is expected to vote again on the bills proposed by Republicans and Democrats to fund the government. This comes as the shutdown enters its eighth day and as Americans begin to feel the impact. CBS News' Caitlin Huey-Burns reports.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/senate-voting-on-democrat-republican-funding-bills-again-as-americans-feel-government-shutdown/", "source": "CBS News", "published_at": "2025-10-08T15:31:00Z", "relevance_score": 0.365}, {"title": "Government shutdown stretches into Week 2 as mass layoffs loom", "description": "The government shutdown is carrying into another week as Democrats and Republicans remain at odds over funding the government. Meanwhile, federal workers continue to fear mass layoffs. CBS News' Ed O'Keefe has the latest.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/government-shutdown-stretches-into-week-2-mass-layoffs-loom/", "source": "CBS News", "published_at": "2025-10-06T13:54:00Z", "relevance_score": 0.365}, {"title": "Canadian theme park says it may have to euthanize 30 beluga whales", "description": "The heavily scrutinized Marineland theme park in Canada says, without emergency funding, it will have to euthanize 30 beluga whales.", "content": "A Canadian theme park said it will have no choice but to euthanize 30 beluga whales if the federal government does not provide emergency funding by the end of Tuesday.\r\n Marineland, a zoo and amuseme… [+2233 chars]", "url": "https://www.cbsnews.com/news/marineland-beluga-whales-theme-park-says-may-have-to-euthanize-30-animals/", "source": "CBS News", "published_at": "2025-10-07T13:17:15Z", "relevance_score": 0.35000000000000003}, {"title": "Exposure to mining fossil fuel linked to ALS, new research finds", "description": "A major pollutant from fossil fuels has been linked to an increased risk of amyotrophic lateral sclerosis (ALS), according to new research.", "content": "A major pollutant from mining fossil fuels has been linked to an increased risk of amyotrophic lateral sclerosis (ALS), according to new research.\r\nLongterm exposure to sulfur dioxide, a component pr… [+2800 chars]", "url": "https://abcnews.go.com/Health/exposure-mining-fossil-fuel-linked-als-new-research/story?id=126254429", "source": "ABC News", "published_at": "2025-10-06T23:05:13Z", "relevance_score": 0.34500000000000003}, {"title": "Dubai chocolate bars are more than a trend. They disrupted the confectionery market", "description": "Some flavor crazes flirt with us and fade. Others stay and make themselves at home.\n\n\n\nIt’s too soon to tell for sure, but the Dubai chocolate movement seems to have put down roots and is spreading at a brisk clip. The sweet flavors and thick texture that hav…", "content": "Some flavor crazes flirt with us and fade. Others stay and make themselves at home.\r\nIts too soon to tell for sure, but the Dubai chocolate movement seems to have put down roots and is spreading at a… [+3231 chars]", "url": "https://apnews.com/article/dubai-chocolate-bars-7e951b8efcca8ceb38e481f6c2718d21", "source": "Associated Press", "published_at": "2025-10-06T19:15:00Z", "relevance_score": 0.34500000000000003}, {"title": "LeBron James’ surprise ‘decision’ announcement was an ad with Hennessy", "description": "LeBron James had another “decision” to announce. Turns out, it was an ad.\n\n\n\nThe Los Angeles Lakers star teased that he would have something to say Tuesday. The “decision” reference is a nod to how he announced in July 2010 that he was joining the Miami Heat.…", "content": "LeBron James had another decision to announce. Turns out, it was an ad.\r\nThe Los Angeles Lakers star teased that he would have something to say Tuesday. The decision reference is a nod to how he anno… [+2299 chars]", "url": "https://apnews.com/article/lebron-james-decision-nba-ecfcfad6c58717aa0cbd4f3cd6b38bb3", "source": "Associated Press", "published_at": "2025-10-07T17:00:00Z", "relevance_score": 0.34500000000000003}, {"title": "WATCH: Hundreds of hikers trapped by blizzard on Mount Everest", "description": "An effort is underway to rescue hundreds of hikers who became trapped on Mount Everest due to an unexpected blizzard.", "content": "<ul><li>Illinois files lawsuit to block deployment of National Guard\r\n</li><li>Trump administration pushes back on order to block National Guard deployment\r\n</li><li>South Carolina judge's house fire… [+4225 chars]", "url": "https://abcnews.go.com/International/video/hundreds-hikers-trapped-blizzard-mount-everest-126258058", "source": "ABC News", "published_at": "2025-10-06T15:53:48Z", "relevance_score": 0.34500000000000003}, {"title": "WATCH: Supreme Court denies Ghislaine Maxwell appeal", "description": "The Supreme Court has declined to take up the appeal of Maxwell, who was contesting her prosecution and conviction on grounds that the government had violated an agreement made with Jeffrey Epstein before his death.", "content": "<ul><li>Illinois files lawsuit to block deployment of National Guard\r\n</li><li>Trump administration pushes back on order to block National Guard deployment\r\n</li><li>South Carolina judge's house fire… [+4225 chars]", "url": "https://abcnews.go.com/US/video/supreme-court-denies-ghislaine-maxwell-appeal-126257745", "source": "ABC News", "published_at": "2025-10-06T16:04:10Z", "relevance_score": 0.34500000000000003}, {"title": "WATCH: Ex-FBI Director James Comey pleads not guilty", "description": "Former FBI Director James Comey pleaded not guilty on Wednesday. He is charged with one count of false statements and one count of obstruction of a congressional proceeding.", "content": "<ul><li>James Comey pleads not guilty, trial date set for January\r\n</li><li>US delegation expected to join peace talks between Israel and Hamas\r\n</li><li>Inside Nasser Hospital's malnutrition ward am… [+4405 chars]", "url": "https://abcnews.go.com/US/video/fbi-director-james-comey-pleads-guilty-126330331", "source": "ABC News", "published_at": "2025-10-08T15:28:28Z", "relevance_score": 0.34500000000000003}, {"title": "3 scientists win Nobel Prize in medicine for discoveries in immunology", "description": "Nobel Prize committee chair says discoveries by the trio of researchers were \"decisive for our understanding of how the immune system functions.\"", "content": "Stockholm — Mary E. Brunkow, Fred Ramsdell and Dr. Shimon Sakaguchi won the Nobel Prize in medicine on Monday for their discoveries concerning peripheral immune tolerance.\r\n Brunkow, 64, is a senior … [+3425 chars]", "url": "https://www.cbsnews.com/news/nobel-prize-in-medicine-2025-discoveries-in-immunology/", "source": "CBS News", "published_at": "2025-10-06T13:37:43Z", "relevance_score": 0.34500000000000003}, {"title": "Activists warn Trump’s Caribbean boat strikes risk regional war", "description": "Human rights groups urge Congress to block unauthorised force as fears of wider Caribbean conflict and chaos grow.", "content": "Washington, DC Dozens of United States-based human rights, faith and policy groups have criticised President Donald Trumps expansion of military operations in the Caribbean, warning that his administ… [+6426 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/activists-warn-trumps-caribbean-boat-strikes-risk-regional-war", "source": "Al Jazeera English", "published_at": "2025-10-08T18:39:23Z", "relevance_score": 0.34500000000000003}, {"title": "Mike Johnson continues to blame Democrats for the government shutdown", "description": "House Speaker Mike Johnson continued to blame Democrats for the government shutdown after 10 days of lapsed federal funding. CBS News' Taurean Small reports.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/mike-johnson-continues-to-blame-democrats-for-government-shutdown/", "source": "CBS News", "published_at": "2025-10-10T17:54:00Z", "relevance_score": 0.335}, {"title": "Shutdown drags into Day 8 as White House suggests furloughed workers not guaranteed back pay", "description": "The government shutdown is in its eighth day as Congress remains deadlocked over funding the government. Meanwhile, a draft memo suggested that not all furloughed federal workers may be eligible for back pay. CBS News' Taurean Small has the latest.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/shutdown-drags-into-day-8-as-white-house-suggests-furloughed-workers-not-guaranteed-back-pay/", "source": "CBS News", "published_at": "2025-10-08T12:55:00Z", "relevance_score": 0.335}, {"title": "Arctic seals, most bird species on new list of threatened species", "description": "One bright spot is green sea turtles, which have recovered substantially, the IUCN said as it released its latest Red List of Threatened Species.", "content": "Arctic seals are being pushed closer to extinction by climate change and more than half of bird species around the world are declining under pressure from deforestation and agricultural expansion, ac… [+5551 chars]", "url": "https://www.cbsnews.com/news/threatened-species-arctic-seals-majority-bird-species-iucn-red-list/", "source": "CBS News", "published_at": "2025-10-10T11:06:48Z", "relevance_score": 0.325}, {"title": "WATCH: Monarch butterfly gets wing transplant, continues migration", "description": "An injured monarch butterfly was able to continue its migration after undergoing a wing transplant at a nature preserve in New York.", "content": "<ul><li>Trump announces hostage, prisoner exchange between Israel and Hamas\r\n</li><li>How much of a role did Trump play in the latest Israel-Hamas peace deal?\r\n</li><li>National Guard troops set to d… [+4684 chars]", "url": "https://abcnews.go.com/US/video/monarch-butterfly-gets-wing-transplant-continues-migration-126352326", "source": "ABC News", "published_at": "2025-10-09T05:57:02Z", "relevance_score": 0.32}, {"title": "Robin Williams' daughter pleads for people to stop sending AI videos of her dad", "description": "The filmmaker said it is not what her dad, who died in 2014, would have wanted.", "content": "Her latest comments come in the wake of unease following the unveiling of \"AI actor\", Tilly Norwood. \r\nNorwood was created by Dutch actor and comedian Eline Van der Velden, who reportedly said she wa… [+1008 chars]", "url": "https://www.bbc.co.uk/news/articles/c0r0erqk18jo", "source": "BBC News", "published_at": "2025-10-07T16:56:40Z", "relevance_score": 0.32}, {"title": "Nepal hit by deadly floods after days of heavy monsoon rains", "description": "Disaster officials report at least 47 people killed as landslides and floods wreak havoc.", "content": "Landslides and floods triggered by heavy downpours in Nepal have killed at least 47 people, according to disaster officials.\r\nTorrential downpours have lashed Nepal since Friday, leaving rivers in sp… [+1193 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/6/nepal-hit-by-deadly-floods-after-days-of-heavy-monsoon-rain", "source": "Al Jazeera English", "published_at": "2025-10-06T09:24:36Z", "relevance_score": 0.32}, {"title": "How Ladakh protest leader Sonam Wangchuk went from Indian hero to ‘traitor’", "description": "Wangchuk, a celebrated innovator, inspired a Bollywood megahit. Now he's being accused of challenging the Indian state.", "content": "New Delhi, India On the night of August 5, 2019, hundreds of Kashmiris were arrested amid a crackdown by Indian security forces that followed the Indian governments decision to strip the region of it… [+15015 chars]", "url": "https://www.aljazeera.com/features/2025/10/7/how-ladakh-protest-leader-sonam-wangchuk-went-from-indian-hero-to-traitor", "source": "Al Jazeera English", "published_at": "2025-10-07T02:53:02Z", "relevance_score": 0.32}, {"title": "AI adoption to drive next phase of growth for IT services: Ajay Bagga", "description": "Indian IT firms anticipate a strong comeback in FY26. Global trends and increased AI use will drive growth. The Indian stock market also looks set for a recovery. Factors like tax cuts, liquidity, and infrastructure spending are boosting the economy. Positive…", "content": "Indian IT services companies are poised for a rebound in FY26, driven by global macro trends and rising adoption of artificial intelligence (AI), says market strategist Ajay Bagga. Speaking to ET Now… [+2057 chars]", "url": "https://economictimes.indiatimes.com/markets/expert-view/ai-adoption-to-drive-next-phase-of-growth-for-it-services-ajay-bagga/articleshow/124444387.cms", "source": "The Times of India", "published_at": "2025-10-10T04:44:13Z", "relevance_score": 0.32}, {"title": "WATCH: Air traffic controller shortages amid shutdown lead to canceled flights, delays", "description": "Flight delays and cancellations are climbing as sick calls involving air traffic controllers leave a number of airport towers and control facilities without enough staff to handle all flights.", "content": "<ul><li>Shutdown continues as GOP, Democrat funding plans fail to advance in Senate\r\n</li><li>Treasury official talks economic fallout of government shutdown\r\n</li><li>Man arrested, faces federal cha… [+4400 chars]", "url": "https://abcnews.go.com/US/video/air-traffic-controller-shortages-amid-shutdown-lead-canceled-126339446", "source": "ABC News", "published_at": "2025-10-08T19:08:39Z", "relevance_score": 0.315}, {"title": "Hundreds of Everest hikers reach safety after snowstorm in Tibetan valley", "description": "Those rescued included guides, yak herders and trekkers, who were trapped in a heavy snowstorm that began on Friday.", "content": "Hundreds of hikers, local guides and yak herders have now reached safety after becoming stranded in freezing temperatures by a heavy snowstorm over the weekend on the east face of Mount Everest in Ti… [+3023 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/hundreds-of-everest-hikers-reach-safety-after-snowstorm-in-tibetan-valley", "source": "Al Jazeera English", "published_at": "2025-10-08T05:03:31Z", "relevance_score": 0.315}, {"title": "Homeland Security Sec. Kristi Noem visits ICE facility at center of Portland protests", "description": "Noem met with local law enforcement officials at the ICE facility, according to the Portland Police Bureau.", "content": "Department of Homeland Security Secretary Kristi Noem made a high-profile visit to an Immigration and Customs Enforcement (ICE) facility in Portland on Tuesday amid a legal battle over sending federa… [+4386 chars]", "url": "https://abcnews.go.com/US/kristi-noem-portland-ice-facility/story?id=126312341", "source": "ABC News", "published_at": "2025-10-08T01:35:30Z", "relevance_score": 0.315}, {"title": "Pakistan and India: What’s the global cost of natural disasters?", "description": "Floods in Pakistan and India re-ignite the debate on the mounting cost of global disasters.", "content": "Floods in Pakistan and India re-ignite the debate on the mounting cost of global disasters.Global natural disasters are striking harder and more often, with climate emergencies now breaking records y… [+447 chars]", "url": "https://www.aljazeera.com/video/counting-the-cost/2025/10/10/pakistan-and-india-whats-the-global-cost-of-natural-disasters", "source": "Al Jazeera English", "published_at": "2025-10-10T16:15:00Z", "relevance_score": 0.315}, {"title": "WATCH: Authorities announce arrest in connection with Palisades fire", "description": "A 29-year-old man has been arrested in connection with the Palisades Fire, which killed a dozen people earlier this year and caused widespread destruction in Los Angeles County, the DOJ announced.", "content": "<ul><li>Man arrested, faces federal charge in connection with Palisades Fire: DOJ\r\n</li><li>James Comey pleads not guilty, trial date set for January\r\n</li><li>US delegation expected to join peace ta… [+4418 chars]", "url": "https://abcnews.go.com/US/video/authorities-announce-arrest-connection-palisades-firev-126335430", "source": "ABC News", "published_at": "2025-10-08T17:26:43Z", "relevance_score": 0.315}, {"title": "WATCH: Speaker Johnson has emotional exchange with a military mom about shutdown", "description": "A military mom confronted House Speaker Johnson on C-SPAN over the lack of a standalone bill to pay troops if the government shutdown extends beyond Oct. 15.", "content": "<ul><li>Israel's security cabinet approves 1st phase of Israel-Hamas ceasefire agreement\r\n</li><li>Inside Gaza as the 1st step toward a ceasefire unfolds\r\n</li><li>Trump says there will be 'everlasti… [+4642 chars]", "url": "https://abcnews.go.com/US/video/speaker-johnson-emotional-exchange-military-mom-shutdown-126379234", "source": "ABC News", "published_at": "2025-10-09T20:22:20Z", "relevance_score": 0.315}, {"title": "Celebrate the ceasefire, but don’t forget: Gaza survived on its own", "description": "Western leaders now claim credit for 'peace', but Gaza’s survival belongs to its people alone.", "content": "On November 7, 2023, children stood before cameras at al-Shifa Hospital and spoke in English, not their mother tongue, but in the language of those they thought might save them. We want to live, we w… [+7437 chars]", "url": "https://www.aljazeera.com/opinions/2025/10/9/celebrate-the-ceasefire-but-dont-forget-gaza-survived-on-its-own", "source": "Al Jazeera English", "published_at": "2025-10-09T19:27:56Z", "relevance_score": 0.315}, {"title": "Lula asks Trump to lift 40 percent tariff from Brazilian goods", "description": "Trump had imposed a 40% tariff on Brazil in July on top of a 10% earlier even though US has a trade surplus with Brazil.", "content": "Brazilian President Luiz Inacio Lula da Silva has asked United States President Donald Trump to lift the 40 percent tariff imposed by the US government on Brazilian imports.\r\nThe leaders spoke for 30… [+1606 chars]", "url": "https://www.aljazeera.com/economy/2025/10/6/lula-asks-trump-to-lift-40-percent-tariff-from-brazilian-goods", "source": "Al Jazeera English", "published_at": "2025-10-06T17:41:00Z", "relevance_score": 0.315}, {"title": "UK, France, Germany say they hope to restart Iran nuclear talks", "description": "Joint statement comes more than a month after E3 countries triggered mechanism reinstating UN sanctions against Iran.", "content": "The United Kingdom, France and Germany have said they wish to restart stalled nuclear talks with Iran and the United States, more than a month after the three European countries triggered a mechanism… [+3053 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/uk-france-germany-say-they-hope-to-restart-iran-nuclear-talks", "source": "Al Jazeera English", "published_at": "2025-10-10T20:30:08Z", "relevance_score": 0.315}, {"title": "WATCH: London police dismantle international phone theft gang", "description": "Police in London have made dozens of arrests linked to a criminal gang who are alleged to have smuggled 40,000 stolen mobile phones from the U.K. to China.", "content": "<ul><li>Air traffic control shortages worsen as shutdown drags on\r\n</li><li>James Comey to be arraigned Wednesday\r\n</li><li>Former surgeon generals warn US about RFK Jr.\r\n</li><li>Tropical Storm Jerr… [+4442 chars]", "url": "https://abcnews.go.com/International/video/london-police-dismantle-international-phone-theft-gang-126320757", "source": "ABC News", "published_at": "2025-10-08T11:02:28Z", "relevance_score": 0.31}, {"title": "WATCH: Beloved March Madness icon Sister Jean dies at 106", "description": "Sister Jean Dolores Schmidt, the team chaplain for the Loyola University Chicago basketball team who became a national celebrity during the school's 2018 underdog March Madness run, has died at 106.", "content": "<ul><li>Trump threatens 'massive' increase of tariffs on China\r\n</li><li>Multiple dead in 'devastating blast' at explosives manufacturer: Sheriff\r\n</li><li>Kilmar Abrego Garcia's attorneys return to … [+4560 chars]", "url": "https://abcnews.go.com/US/video/beloved-march-madness-icon-sister-jean-dies-106-126411786", "source": "ABC News", "published_at": "2025-10-10T17:56:52Z", "relevance_score": 0.31}, {"title": "WATCH: Kilmar Abrego Garcia's attorneys return to court as deportation saga continues", "description": "Attorneys for Kilmar Abrego Garcia went to court in Maryland on Friday for an evidentiary hearing in which witnesses testified about the steps taken to remove him from the U.S.", "content": "<ul><li>Retired 4-star general on Israel-Hamas ceasefire\r\n</li><li>What happens next after a ceasefire between Israel and Hamas?\r\n</li><li>Trump threatens 'massive' increase of tariffs on China\r\n</li… [+4552 chars]", "url": "https://abcnews.go.com/US/video/kilmar-abrego-garcias-attorneys-return-court-deportation-saga-126418311", "source": "ABC News", "published_at": "2025-10-10T23:06:41Z", "relevance_score": 0.31}, {"title": "Around four million people displaced across Africa’s Sahel, UN warns", "description": "Women and children represent 80 percent of those forcibly displaced in countries including Burkina Faso, Mali and Niger.", "content": "Around four million people are now displaced across Africas Sahel region, the United Nations has said, with violence and insecurity driving a growing number of people from their homes.\r\nThe United Na… [+2977 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/around-four-million-people-displaced-across-africas-sahel-un-warns", "source": "Al Jazeera English", "published_at": "2025-10-10T16:45:56Z", "relevance_score": 0.31}, {"title": "5 things to know for Oct. 10: Government shutdown, Gaza ceasefire plan, Nobel Peace Prize, Letitia James, Philippines quake", "description": "CNN’s 5 Things AM brings you the news you need to know every morning.", "content": "Travelers waiting in airport security lines across the US will now be met with a new video blaming Democratic lawmakers for the government shutdown. Its a notable departure from standard practice, as… [+5601 chars]", "url": "https://www.cnn.com/2025/10/10/us/5-things-to-know-for-oct-10-government-shutdown-gaza-ceasefire-plan-nobel-peace-prize-letitia-james-philippines-quake", "source": "CNN", "published_at": "2025-10-10T10:35:04Z", "relevance_score": 0.305}, {"title": "Government funding stalemate continues with no end in sight", "description": "Senators returned to Capitol Hill on Monday, still with no signs of a breakthrough to end the government shutdown. CBS News congressional correspondent Nikole Killion has the latest.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/government-funding-stalemate-continues/", "source": "CBS News", "published_at": "2025-10-06T21:52:00Z", "relevance_score": 0.305}, {"title": "Increased sick calls from controllers working without pay leads to flight delays", "description": "Controllers are considered essential workers and are exempt from being furloughed during a shutdown.", "content": "A week into the government shutdown, air traffic controller sick calls are beginning to cause delays and cancellations as a number of airport towers and control facilities dont have enough staff to p… [+6012 chars]", "url": "https://abcnews.go.com/US/air-traffic-controllers-working-pay-begin-call-sick/story?id=126289491", "source": "ABC News", "published_at": "2025-10-07T17:42:33Z", "relevance_score": 0.28}, {"title": "WATCH: Crypto scam almost costs woman her life savings", "description": "The FBI says scams perpetrated using bitcoin ATMs cost Americans nearly $250 million in 2024, more than double the sum from the previous year.", "content": "<ul><li>Major challenges lie ahead for Gaza, Israel if ceasefire deal rolls out\r\n</li><li>Trump's use of the National Guard faces critical legal tests\r\n</li><li>'My kids could die': Mom begs Johnson … [+4641 chars]", "url": "https://abcnews.go.com/US/video/crypto-scam-costs-woman-life-savings-126369926", "source": "ABC News", "published_at": "2025-10-09T15:58:02Z", "relevance_score": 0.28}, {"title": "WATCH: Jared Kushner, Ivanka Trump speak in Israel after ceasefire announcement", "description": "Jared Kushner and Ivanka Trump addressed a crowd gathered in Tel Aviv following the announcement of the ceasefire agreement in Gaza.", "content": "<ul><li>Joe Biden undergoing radiation therapy for prostate cancer treatment\r\n</li><li>Nor'easter develops as East Coast set for impact\r\n</li><li>Official shares new details on deadly explosion in Te… [+4466 chars]", "url": "https://abcnews.go.com/International/video/jared-kushner-ivanka-trump-speak-israel-after-ceasefire-126434451", "source": "ABC News", "published_at": "2025-10-11T19:30:30Z", "relevance_score": 0.275}, {"title": "Global Warning: Our future in a warmer world", "description": "A three-part series on the realities of climate change - but with innovative solutions to safeguard our future.", "content": "A three-part series on the realities of climate change but with innovative solutions to safeguard our future.This decisive decade demands unprecedented action to address humanitys greatest challenge.… [+2754 chars]", "url": "https://www.aljazeera.com/video/featured-documentaries/2025/10/11/global-warning-our-future-in-a-warmer-world", "source": "Al Jazeera English", "published_at": "2025-10-11T13:02:42Z", "relevance_score": 0.265}, {"title": "Emboldened Democrats dig in on health care demands in shutdown fight", "description": "Eight days into the government shutdown, Democrats believe the public and polling is on their side and are pushing for Obamacare funding to reopen the government.", "content": "WASHINGTON Eight days into the government shutdown, Senate Democratic communications directors received a private briefing and a memo from pollster Geoff Garin.\r\nThe crux of the message: Stay the cou… [+7536 chars]", "url": "https://www.nbcnews.com/politics/congress/emboldened-democrats-dig-health-care-demands-shutdown-fight-rcna236625", "source": "NBC News", "published_at": "2025-10-09T19:20:01Z", "relevance_score": 0.25}, {"title": "New poll shows how Americans feel about the government shutdown", "description": "Few Americans feel the government shutdown is worth it as Congress remains deadlocked over funding the government, a recent CBS News poll shows. Taurean Small and Anthony Salvanto join with more.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/new-poll-how-americans-feel-about-government-shutdown/", "source": "CBS News", "published_at": "2025-10-06T13:09:00Z", "relevance_score": 0.245}, {"title": "Details on health care fight at center of government shutdown", "description": "Health care subsidies remain the central issue Democrats want addressed in a funding bill before the party votes to reopen the government. Julie Rovner, chief Washington correspondent for KFF, joined CBS News to discuss.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/democrats-urging-gop-to-address-health-care-subsidies-before/", "source": "CBS News", "published_at": "2025-10-08T19:15:00Z", "relevance_score": 0.245}, {"title": "Lawmakers deadlocked on sixth day of government shutdown", "description": "With the government shutdown in its sixth day, the Senate is set to vote again on a short-term funding bill Monday. CBS News congressional correspondent Nikole Killion has more.", "content": "Copyright ©2025 CBS Interactive Inc. All rights reserved.", "url": "https://www.cbsnews.com/video/lawmakers-deadlocked-on-sixth-day-of-government-shutdown/", "source": "CBS News", "published_at": "2025-10-06T19:42:00Z", "relevance_score": 0.245}, {"title": "UNESCO board backs Egypt’s Khaled el-Enany as its next chief", "description": "The Egyptologist and former minister of antiquities will be the first Arab to lead the UN's cultural organisation.", "content": "The board of the United Nations Educational, Scientific and Cultural Organization (UNESCO) has nominated Egypts Khaled el-Enany, an academic and former minister of tourism and antiquities, as its nex… [+3669 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/unesco-board-backs-egypts-khaled-el-enany-as-its-next-chief", "source": "Al Jazeera English", "published_at": "2025-10-07T06:07:05Z", "relevance_score": 0.22500000000000003}, {"title": "US and China provoke sharp fall in global outlook for renewable power", "description": "Lowered support means capacity now expected to grow to no more than 4,600GW by 2030, 900GW lower than 2024 estimate.", "content": "The International Energy Agency (IEA) has scaled back its forecast for renewable power growth to 2030, citing weaker outlooks in the United States and China.\r\nThe Paris-based agency now projects tota… [+2136 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/us-and-china-provoke-sharp-fall-in-global-outlook-for-renewable-power", "source": "Al Jazeera English", "published_at": "2025-10-07T08:37:03Z", "relevance_score": 0.22500000000000003}, {"title": "Australia, Papua New Guinea sign mutual defence treaty", "description": "Pukpuk treaty commits the two neighbours to greater military cooperation, although the text is yet to be released.", "content": "Australias Prime Minister Anthony Albanese and the Prime Minister of Papua New Guinea (PNG) James Marape have signed a mutual defence treaty in Canberra, with the leaders saying the text of the agree… [+2805 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/australia-papua-new-guinea-sign-mutual-defence-treaty", "source": "Al Jazeera English", "published_at": "2025-10-06T03:24:55Z", "relevance_score": 0.22000000000000003}, {"title": "WATCH: Former NFL QB Mark Sanchez facing felony charge after physical altercation", "description": "Former NFL QB Mark Sanchez, who was arrested following a physical altercation this weekend, is now facing a felony charge of battery involving serious bodily injury, prosecutors in Indianapolis said.", "content": "<ul><li>Government shutdown's impact on air traffic controllers\r\n</li><li>Parties no closer to deal to end government shutdown\r\n</li><li>Standoff over National Guard intensifies\r\n</li><li>Medical hel… [+4389 chars]", "url": "https://abcnews.go.com/US/video/former-nfl-qb-mark-sanchez-facing-felony-charge-126288356", "source": "ABC News", "published_at": "2025-10-07T13:12:06Z", "relevance_score": 0.22000000000000003}, {"title": "WATCH: Near-supermoon lights up American skies", "description": "Time-lapse imagery captured the nearly full moon, a forerunner to the harvest supermoon, rising and setting over U.S. cities.", "content": "<ul><li>Government shutdown's impact on air traffic controllers\r\n</li><li>Parties no closer to deal to end government shutdown\r\n</li><li>Standoff over National Guard intensifies\r\n</li><li>Medical hel… [+4389 chars]", "url": "https://abcnews.go.com/US/video/supermoon-lights-american-skies-126288444", "source": "ABC News", "published_at": "2025-10-07T13:17:22Z", "relevance_score": 0.22000000000000003}, {"title": "Nobel Prize 2025: What they are, when will the awards be announced?", "description": "Nobel Prize for medicine to be announced on Monday, followed by five other prizes to be declared over the next week.", "content": "The Nobel Prize 2025 officially kicks off with the first award, for physiology or medicine, to be announced on Monday, setting the stage for a week of global anticipation.\r\nThe full schedule, spannin… [+9081 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/nobel-prize-2025-what-they-are-when-will-the-awards-be-announced", "source": "Al Jazeera English", "published_at": "2025-10-06T09:07:20Z", "relevance_score": 0.22000000000000003}, {"title": "Indie theaters evolve in a new era: \"Everybody wants movies in their lives\"", "description": "The owners and operators of independent cinemas are working to adapt as audience habits change.", "content": "Audiences have been enjoying films at movie theaters for decades, but streaming and expensive ticket prices have impacted moviegoing habits. For the owners and operators of independent theaters, surv… [+3881 chars]", "url": "https://www.cbsnews.com/news/independent-theaters-evolve-kevin-smith-metrograph-vidiots-smodcastle/", "source": "CBS News", "published_at": "2025-10-11T14:24:21Z", "relevance_score": 0.22000000000000003}, {"title": "Six million people in Haiti face acute hunger as gang violence spreads", "description": "Half of the population projected to experience critical food shortages by mid-2026 as armed groups block aid.", "content": "More than half of Haitis population is experiencing critical levels of hunger as armed groups tighten their grip across the Caribbean nation and the ravaged economy continues its downward spiral.\r\nA … [+2777 chars]", "url": "https://www.aljazeera.com/news/2025/10/11/six-million-people-in-haiti-face-acute-hunger-as-gang-violence-spreads", "source": "Al Jazeera English", "published_at": "2025-10-11T06:47:14Z", "relevance_score": 0.22000000000000003}, {"title": "What caused Nepal’s devastating flood damage and how was it contained?", "description": "Karki government has been praised for issuing early warnings and imposing road closures in response to flood forecasts.", "content": "Heavy rains have resulted in severe flooding and landslides in Nepal and Indias eastern Himalayan city of Darjeeling in the past few days.\r\nDozens of people have been killed in landslides in Nepals e… [+9498 chars]", "url": "https://www.aljazeera.com/news/2025/10/7/what-caused-nepals-devastating-flood-damage-and-how-was-it-contained", "source": "Al Jazeera English", "published_at": "2025-10-07T12:08:16Z", "relevance_score": 0.21500000000000002}, {"title": "WATCH: Trump says Sean 'Diddy' Combs asked him for a pardonvv", "description": "President Donald Trump said that Sean \"Diddy\" Combs has reached out to ask him for a pardon following his conviction on two prostitution-related charges.", "content": "<ul><li>Nova music festival massacre survivor: 'I remember just running for my life'\r\n</li><li>Trump says Sean 'Diddy' Combs asked him for a pardon\r\n</li><li>Government shutdown's impact on air traff… [+4405 chars]", "url": "https://abcnews.go.com/US/video/trump-sean-diddy-combs-asked-pardon-126299891", "source": "ABC News", "published_at": "2025-10-07T16:52:50Z", "relevance_score": 0.21500000000000002}, {"title": "WATCH: Farmer finds NASA equipment in neighbor’s wheat field", "description": "A woman in rural West Texas says she was caught by surprise when she spotted a car-sized piece of scientific equipment that was adorned with NASA stickers.", "content": "<ul><li>Joe Biden undergoing radiation therapy for prostate cancer treatment\r\n</li><li>Nor'easter develops as East Coast set for impact\r\n</li><li>Official shares new details on deadly explosion in Te… [+4466 chars]", "url": "https://abcnews.go.com/US/video/farmer-finds-nasa-equipment-neighbors-wheat-field-126431956", "source": "ABC News", "published_at": "2025-10-11T18:25:10Z", "relevance_score": 0.21500000000000002}, {"title": "How much will a $150,000 HELOC cost monthly now that the Fed's cutting interest rates?", "description": "With an interest rate cut just issued and others looming for this year, here's what a $150,000 HELOC costs now.", "content": "HELOC costs are set to decline further now that the Federal Reserve is cutting interest rates again.\r\nGetty Images/iStockphoto\r\nWithdrawing $150,000 out of your hard-earned home equity may not be a d… [+4157 chars]", "url": "https://www.cbsnews.com/news/how-much-150000-heloc-cost-monthly-october-2025-fed-cutting-interest-rates/", "source": "CBS News", "published_at": "2025-10-06T19:51:37Z", "relevance_score": 0.2}, {"title": "More than 350 trekkers escape blizzard-hit Everest, hundreds still stranded", "description": "Rescued trekkers reach China's Qudang township while 200 others still face treacherous Everest conditions awaiting help.", "content": "Rescuers have guided more than 350 people to safety after they were stranded by blizzard-like conditions on the Tibetan side of Mount Everest, Chinese state media reported on Sunday.\r\nIn total, more … [+2526 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/more-than-350-trekkers-escape-blizzard-hit-everest-hundreds-still-stranded", "source": "Al Jazeera English", "published_at": "2025-10-06T01:01:28Z", "relevance_score": 0.195}, {"title": "Global green energy exceeds coal power for first time ever, study finds", "description": "Energy think tank Ember says a slight drop in global fossil fuel power marks \"a turning point,\" as the U.S. and Europe lag behind by China and India in investment.", "content": "Worldwide solar and wind power generation has outpaced electricity demand this year, and for the first time on record, renewable energies combined generated more power than coal, according to a new a… [+5546 chars]", "url": "https://www.cbsnews.com/news/renewable-energy-exceeds-coal-power-globally-first-time-ember-analysis/", "source": "CBS News", "published_at": "2025-10-08T16:03:00Z", "relevance_score": 0.195}, {"title": "With Gaza in ruins, will US media name the crime?", "description": "With at least 66,000 Palestinians dead and mounting genocide declarations, will Western media hold Israel accountable?", "content": "The Take\r\nRead moreDespite a United Nations inquiry and multiple human rights organisations finding that Israel is committing genocide in Gaza, Western news outlets are still reluctant to use the ter… [+117 chars]", "url": "https://www.aljazeera.com/video/the-take-2/2025/10/6/aje-onl-glb_gazamediacoverage_av_v2-061025", "source": "Al Jazeera English", "published_at": "2025-10-06T16:58:54Z", "relevance_score": 0.195}, {"title": "Drier weather threatens India’s tea exports, global supply", "description": "Climate extremes shrink Assam tea harvests, increase costs, reduce exports, and reshape the global industry and prices.", "content": "Under blazing skies at a tea plantation in Indias northeastern state of Assam, worker Kamini Kurmi wears an umbrella fastened over her head to keep her hands free to pluck delicate leaves from the bu… [+3598 chars]", "url": "https://www.aljazeera.com/gallery/2025/10/8/drier-weather-threatens-indias-tea-exports-global-supply", "source": "Al Jazeera English", "published_at": "2025-10-08T10:12:28Z", "relevance_score": 0.19}, {"title": "WATCH: Dog goes viral for loving mom's music", "description": "A dog has gone viral on social media for loving his professional pianist mom's jazz music.", "content": "<ul><li>Retired 4-star general on Israel-Hamas ceasefire\r\n</li><li>What happens next after a ceasefire between Israel and Hamas?\r\n</li><li>Trump threatens 'massive' increase of tariffs on China\r\n</li… [+4552 chars]", "url": "https://abcnews.go.com/Lifestyle/video/dog-viral-loving-moms-music-126418202", "source": "ABC News", "published_at": "2025-10-10T23:06:55Z", "relevance_score": 0.19}, {"title": "Appeals court lifts order on Portland National Guard, deployment still blocked", "description": "The broader order stopping any state's National Guard deploying still in effect.", "content": "In a move that does not change the situation on the ground in Portland, the Ninth Circuit Court of Appeals has temporarily lifted a lower court's order blocking the deployment of Oregon National Guar… [+1476 chars]", "url": "https://abcnews.go.com/US/appeals-court-lifts-order-portland-national-guard-deployment/story?id=126345146", "source": "ABC News", "published_at": "2025-10-08T21:24:40Z", "relevance_score": 0.19}, {"title": "Landslide hits bus in northern India, killing 15, as rescue continues", "description": "The bus was travelling on a hilly stretch in Himachal Pradesh when a landslide struck after days of torrential rains.", "content": "At least 15 people have been killed after debris from a massive landslide hit a bus in Indias northern state of Himachal Pradesh, local authorities have said.\r\nThe bus was travelling on a hilly stret… [+2083 chars]", "url": "https://www.aljazeera.com/news/2025/10/8/landslide-hits-bus-in-northern-india-killing-15-as-rescue-continues", "source": "Al Jazeera English", "published_at": "2025-10-08T06:10:21Z", "relevance_score": 0.19}, {"title": "WATCH: National Guard now on duty in Chicago area despite local opposition", "description": "In two courthouses on opposite sides of the country, President Donald Trump’s attempt to send troops into Democratic-led Chicago and Portland, Oregon, will face a critical legal test on Thursday.", "content": "<ul><li>Trump says there will be 'everlasting peace' in the Middle East\r\n</li><li>Major challenges lie ahead for Gaza, Israel if ceasefire deal rolls out\r\n</li><li>Trump's use of the National Guard f… [+4658 chars]", "url": "https://abcnews.go.com/US/video/national-guard-now-duty-chicago-area-despite-local-126371677", "source": "ABC News", "published_at": "2025-10-09T16:51:57Z", "relevance_score": 0.19}, {"title": "Football Daily", "description": "Premier League referee Anthony Taylor joins Dan Roan for insight into being a top referee", "content": "Available for 29 days\r\nPremier League referee Anthony Taylor joins Dan Roan to give rare insight into life as one of footballs top officials. \r\nHe opens up about the pressures of refereeing at the hi… [+578 chars]", "url": "https://www.bbc.co.uk/sounds/play/p0m7qyn9", "source": "BBC News", "published_at": "2025-10-10T05:00:00Z", "relevance_score": 0.19}, {"title": "FLIGHT DELAYS ACROSS COUNTRY", "description": "The impact of the government shutdown hit travelers across the United States  Monday, as air traffic controllers called out sick, closing a control tower and leading to delays at major airports.", "content": "A pilot preparing to take off Monday from Hollywood Burbank Airport in California took the routine step of radioing the air traffic control tower.\r\nBut instead of the usual back-and-forth conversatio… [+7859 chars]", "url": "https://www.cnn.com/2025/10/07/us/government-shutdown-air-travel-hnk", "source": "CNN", "published_at": "2025-10-07T11:07:36Z", "relevance_score": 0.19}, {"title": "Trump announces layoffs amid government shutdown, despite legal questions", "description": "Reduction-in-force notifications have gone out to employees in departments including the Treasury and Homeland Security.", "content": "The administration of United States President Donald Trump has announced that it started laying off federal employees as the government shutdown grinds on, despite questions about Trumps legal author… [+4145 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/trump-announces-layoffs-amid-government-shutdown-despite-legal-questions", "source": "Al Jazeera English", "published_at": "2025-10-10T19:46:17Z", "relevance_score": 0.19}, {"title": "White House reverses Trump claim firings have begun amid gov’t shutdown", "description": "US lawmakers remain at impasse as shutdown stretches into sixth day; White House again threatens layoffs.", "content": "The White House has dialled back US President Donald Trumps claim that federal workers were already being fired amid the ongoing United States government shutdown.\r\nThe backtrack on Monday came as th… [+4159 chars]", "url": "https://www.aljazeera.com/news/2025/10/6/white-house-reverses-trump-claim-firings-have-begun-amid-govt-shutdown", "source": "Al Jazeera English", "published_at": "2025-10-06T21:02:20Z", "relevance_score": 0.185}, {"title": "Seychelles votes in closely contested presidential run-off election", "description": "African island nation decides its future as Wavel Ramkalawan seeks a second term against Patrick Herminie.", "content": "Voters in Seychelles have been casting their ballots in a tightly fought presidential run-off between incumbent Wavel Ramkalawan and opposition leader Patrick Herminie.\r\nPolls opened in the African i… [+2419 chars]", "url": "https://www.aljazeera.com/news/2025/10/11/seychelles-votes-in-closely-contested-presidential-run-off-election", "source": "Al Jazeera English", "published_at": "2025-10-11T09:10:20Z", "relevance_score": 0.185}, {"title": "Bondi faces grilling from Senate Democrats on DOJ 'weaponization,' Epstein files", "description": "The hearing follows a tumultuous summer for the Department of Justice.", "content": "President Donald Trump's tightening grip over the Justice Department to target his political opponents and lawmakers' increasing calls for the release of more files from federal investigations into d… [+7209 chars]", "url": "https://abcnews.go.com/Politics/democrats-highlight-doj-weaponization-epstein-files-bondis-senate/story?id=126260560", "source": "ABC News", "published_at": "2025-10-07T13:24:23Z", "relevance_score": 0.16999999999999998}, {"title": "Florida removes Miami Beach rainbow crosswalk after city loses appeal", "description": "A rainbow-colored crosswalk celebrating the contributions of Miami Beach's LGBTQ+ community has been removed from the city’s iconic Ocean Drive", "content": "MIAMI -- MIAMI (AP) A rainbow-colored crosswalk meant to celebrate the history and contributions of the LGBTQ+ community in Miami Beach has been removed from the city's iconic Ocean Drive entertainme… [+2675 chars]", "url": "https://abcnews.go.com/Lifestyle/wireStory/florida-removes-miami-beach-rainbow-crosswalk-after-city-126271129", "source": "ABC News", "published_at": "2025-10-06T22:00:26Z", "relevance_score": 0.165}, {"title": "Joan Kennedy, first wife of Sen. Edward Kennedy, has died", "description": "The first wife of the late Sen. Edward Kennedy, Joan Kennedy, died Wednesday at the age of 89", "content": "BOSTON -- BOSTON (AP) Joan B. Kennedy, the former wife of Sen. Edward M. Kennedy who endured a long and troubled marriage marked by family tragedies, her husbands infidelities and her own struggles w… [+2087 chars]", "url": "https://abcnews.go.com/US/wireStory/joan-kennedy-wife-sen-edward-kennedy-died-126328284", "source": "ABC News", "published_at": "2025-10-08T14:26:12Z", "relevance_score": 0.165}, {"title": "WATCH: President Trump signs proclamation protecting Columbus Day name", "description": "President Trump signed a proclamation protecting the name Columbus Day before hosting a Cabinet meeting on Thursday.", "content": "<ul><li>Israel's security cabinet approves 1st phase of Israel-Hamas ceasefire agreement\r\n</li><li>Inside Gaza as the 1st step toward a ceasefire unfolds\r\n</li><li>Trump says there will be 'everlasti… [+4642 chars]", "url": "https://abcnews.go.com/US/video/president-trump-signs-proclamation-protecting-columbus-day-126379332", "source": "ABC News", "published_at": "2025-10-09T20:22:15Z", "relevance_score": 0.165}, {"title": "Takaichi’s bid as Japan’s 1st female PM in doubt as ruling coalition splits", "description": "LDP leader calls coalition collapse 'extremely regrettable', party faces 37-seat shortfall of a parliamentary majority.", "content": "Japans Komeito party has announced it will withdraw from its coalition with the Liberal Democratic Party (LDP), as newly elected leader Sanae Takaichi awaits a parliamentary vote to confirm her as Ja… [+1771 chars]", "url": "https://www.aljazeera.com/news/2025/10/10/takaichis-bid-as-japans-1st-female-pm-in-doubt-as-ruling-coalition-splits", "source": "Al Jazeera English", "published_at": "2025-10-10T09:54:17Z", "relevance_score": 0.16}]}