{"timestamp": 1760321913.602766, "data": {"url": "https://www.aljazeera.com/news/2025/10/6/illinois-lawsuit-seeks-to-block-trump-sending-national-guard-to-chicago", "title": "Trump threatens use of Insurrection Act to deploy troops to cities", "text": "US president's comments came as Portland, Chicago continue to fight the deployment of the national guard in the courts.\n\nUnited States President Donald Trump has said he would consider using the Insurrection Act to send soldiers to US cities, as the states of Illinois and Oregon continue to fight federal military deployments in court.\n\n“We have an Insurrection Act for a reason. If I had to enact it, I’d do that,” Trump told reporters in the Oval Office on Monday.\n\n“If people were being killed and courts were holding us up, or governors or mayors were holding us up, sure, I’d do that,” Trump added.\n\nThe US president’s comments came shortly after US District Judge April Perry allowed the federal government to continue the deployment in Chicago while it responds to a new court case filed by the state of Illinois, challenging the deployment of National Guard soldiers to the city.\n\nPerry set a deadline of midnight Wednesday for the federal government to reply.\n\nIllinois Attorney General Kwame Raoul and officials from the city of Chicago filed the lawsuit earlier on Monday, after a federal judge in Oregon temporarily blocked Trump from sending the National Guard to the state’s largest city, Portland, on Sunday night.\n\nTrump has sought to expand the use of the US military during his second term, including to aid in domestic immigration and law enforcement.\n\nThat has come amid a wider effort to portray Democrat-run cities as violence-ridden and lawless.\n\nIn a post on X, Illinois Governor JB Pritzker decried Trump’s latest plan, which would involve federalising 300 of the state’s National Guard troops and deploying another 400 from Texas, as “unlawful and unconstitutional”.\n\nAdvertisement\n\nSpeaking later in the day, he further accused Trump of using members of the military as “political props”, charging that the president was trying to “justify and normalise the presence of armed soldiers under his direct command”.\n\nThe state’s Attorney General Raoul said US citizens “should not live under the threat of occupation by the United States military, particularly for the reason that their city or state leadership has fallen out of a president’s favour”.\n\nSince taking office in January, Trump has already deployed National Guard troops to Los Angeles in the state of California and the federal district of Washington, DC, and has floated sending troops to at least eight other major cities.\n\nIn September, a federal judge ruled that the Trump administration “wilfully ” broke federal law by deploying guard troops to Los Angeles amid protests over immigration raids.\n\nIn the Oregon case, Judge Karin Immergut temporarily blocked Trump’s plan to deploy 200 National Guard troops from neighbouring California, saying anti-immigration enforcement protests there “did not pose a danger of rebellion”.\n\nImmergut also chided the Trump administration for appearing to disregard an order she had issued just a day earlier.\n\n“Aren’t defendants simply circumventing my order?” she asked on Sunday. “Why is this appropriate?”\n\nUnder US law, the US military cannot be used for domestic law enforcement unless the president deems the situation an insurrection and invokes the Insurrection Act. However, the National Guard can be used in a support capacity for federal law enforcement agents in some instances.\n\nTrump has repeatedly said he was open to invoking the federal law, which dates back to 1807.\n\nDespite the legal setbacks, the US president has remained defiant.\n\nSpeaking to US military commanders last week, Trump referred to “civil disturbances” as the “enemy within”. He further pledged to straighten out US cities “one by one”.\n\nIn one particularly remarkable statement, Trump said: “We should use some of these dangerous cities as training grounds for our military.”\n\nBeyond the National Guard, the Trump administration has surged federal law enforcement and immigration agents to cities across the country.\n\nIn Chicago, protesters have frequently rallied near an immigration facility outside of the city, where authorities arrested 13 people on Friday.\n\nOn Saturday, the Department of Homeland Security said federal agents shot a woman in Chicago’s southwest.\n\nA department statement said the shooting happened after Border Patrol agents monitoring the area “were rammed by vehicles and boxed in by 10 cars”. The woman, who survived the shooting, was taken into federal custody soon afterwards.\n\nAdvertisement\n\nIn another incident last week, federal agents “rappelled from Black Hawk helicopters” as they stormed a five-storey apartment building, according to a report in US cable news network NewsNation, which was invited to observe the operation.", "authors": [], "published_date": "2025-10-06T00:00:00", "top_image": "https://www.aljazeera.com/wp-content/uploads/2025/10/reuters_68e3ea42-1759767106.jpg?resize=1920%2C1440", "summary": "US president's comments came as Portland, Chicago continue to fight the deployment of the national guard in the courts.\nIn September, a federal judge ruled that the Trump administration “wilfully ” broke federal law by deploying guard troops to Los Angeles amid protests over immigration raids.\nIn the Oregon case, Judge Karin Immergut temporarily blocked Trump’s plan to deploy 200 National Guard troops from neighbouring California, saying anti-immigration enforcement protests there “did not pose a danger of rebellion”.\nHowever, the National Guard can be used in a support capacity for federal law enforcement agents in some instances.\nOn Saturday, the Department of Homeland Security said federal agents shot a woman in Chicago’s southwest.", "keywords": ["agents", "national", "threatens", "states", "cities", "trump", "law", "troops", "act", "insurrection", "federal", "deploy", "guard", "military"], "success": true, "error": null}}