{"timestamp": 1760318266.679947, "data": {"url": "https://www.cbsnews.com/news/nobel-prize-in-physics-2025-quantum-tunneling-technology/", "title": "Nobel Prize in Physics goes to 3 scientists based in U.S. for work on quantum technology", "text": "Stockholm — John Clarke, Michel H. Devoret and John M. Martinis won the Nobel Prize in Physics on Tuesday for research on seemingly obscure quantum tunneling that is advancing digital technology.\n\nClarke, 83, conducted his research at the University of California, Berkeley; Martinis at the University of California, Santa Barbara; and Devoret at Yale and also at the University of California, Santa Barbara.\n\n\"To put it mildly, it was the surprise of my life,\" Clarke told reporters at the announcement by phone after being told of his win.\n\nHe paid tribute to the other two laureates, saying that \"their contributions are just overwhelming.\"\n\n\"Our discovery in some ways is the basis of quantum computing. Exactly at this moment where this fits in is not entirely clear to me.\"\n\nHowever, speaking from his cellphone, Clarke added: \"One of the underlying reasons that cellphones work is because of all this work.''\n\nPhotos of (LtoR) British physicist John Clarke at the University of California, French physicist Michel H Devoret (University of California and Yale) and U.S. physicist John M. Martinis (University of California), are seen on a screen during a press conference on the awarding of the 2025 Nobel Prize in Physics at the Royal Swedish Academy of Sciences in Stockholm, Sweden, Oct. 7, 2025. JONATHAN NACKSTRAND/AFP/Getty\n\nThe Nobel committee said that the laureates' work in the 1980s continues to provide opportunities to develop \"the next generation of quantum technology, including quantum cryptography, quantum computers, and quantum sensors.\"\n\n\"It is wonderful to be able to celebrate the way that century-old quantum mechanics continually offers new surprises. It is also enormously useful, as quantum mechanics is the foundation of all digital technology,\" said Olle Eriksson, Chair of the Nobel Committee for Physics.\n\nThe 100-year-old field of quantum mechanics deals with the seemingly impossible subatomic world where switches can be on and off at the same time and parts of atoms tunnel through what seems like impenetrable barriers. The prize winning trio's work helped take that into the larger world, where it has the potential to supercharge computing and communications.\n\nWhat the three physicists did \"is taking the scale of something that we can't see, we can't touch, we can't feel and bringing it up to the scale of something recognizable and make it something you can build upon,\" said Physics Today editor-in-chief Richard Fitzgerald, who in the 1990s worked in the field on a competitors' group.\n\n\"Quantum computers is one very sort of obvious use, but they're also can be used for quantum sensors, so to be able to make very sensitive measurements of, for example, magnetic fields, and perhaps also for cryptography, so to encode information so it cannot be easily listened to by a third party,\" Mark Pearce, a professor of astrophysics and Nobel Physics Committee member, told The Associated Press.\n\n(L-R) Olle Eriksson, Chair of the Nobel Committee for Physics, and Hans Ellegren, Secretary General of The Royal Swedish Academy of Sciences, listen as Goeran Johansson, Member of the Nobel Committee for Physics, addresses a press conference on the awarding of the 2025 Nobel Prize in Physics to John Clarke, Michel H Devoret and John M Martinis at the Royal Swedish Academy of Sciences in Stockholm, Sweden, Oct. 7, 2025. JONATHAN NACKSTRAND/AFP/Getty\n\nIt is the 119th time the prize has been awarded. Last year, artificial intelligence pioneers John Hopfield and Geoffrey Hinton won the physics prize for helping create the building blocks of machine learning.\n\nOn Monday, Mary E. Brunkow, Fred Ramsdell and Dr. Shimon Sakaguchi won the Nobel Prize in medicine on Monday for discoveries about how the immune system knows to attack germs and not our bodies.\n\nNobel announcements continue with the chemistry prize on Wednesday and literature on Thursday. The Nobel Peace Prize will be announced Friday and the Nobel Memorial Prize in economics on Oct. 13.\n\nThe award ceremony will be held Dec. 10, the anniversary of the 1896 death of Alfred Nobel, the wealthy Swedish industrialist and the inventor of dynamite who founded the prizes.\n\nThe prizes carry priceless prestige and a cash award of 11 million Swedish kronor (nearly $1.2 million).", "authors": [], "published_date": null, "top_image": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/07/fa2f904b-ae06-47f7-bdb1-559f7a74b5e9/thumbnail/1200x630/f467a36eb05e0174d14723377e74911f/nobel-physics-2025-2239285531.jpg", "summary": "Stockholm — John Clarke, Michel H. Devoret and John M. Martinis won the Nobel Prize in Physics on Tuesday for research on seemingly obscure quantum tunneling that is advancing digital technology.\nJONATHAN NACKSTRAND/AFP/GettyThe Nobel committee said that the laureates' work in the 1980s continues to provide opportunities to develop \"the next generation of quantum technology, including quantum cryptography, quantum computers, and quantum sensors.\"\nIt is also enormously useful, as quantum mechanics is the foundation of all digital technology,\" said Olle Eriksson, Chair of the Nobel Committee for Physics.\nLast year, artificial intelligence pioneers John Hopfield and Geoffrey Hinton won the physics prize for helping create the building blocks of machine learning.\nThe Nobel Peace Prize will be announced Friday and the Nobel Memorial Prize in economics on Oct. 13.", "keywords": ["goes", "based", "clarke", "university", "technology", "scientists", "john", "swedish", "california", "prize", "quantum", "physics", "work", "nobel", "committee"], "success": true, "error": null}}