{"timestamp": 1760318265.2609868, "data": {"url": "https://www.cbsnews.com/news/inhalers-produce-carbon-emissions-study/", "title": "Inhalers produce as much carbon emissions as over 500,000 cars each year, study finds", "text": "Inhalers that provide fast-acting treatment for people with certain respiratory conditions are contributing to greenhouse gas emissions, which can worsen both climate change and the conditions themselves, according to new research.\n\nIn the study, published Monday in the Journal of the American Medical Association, researchers found inhalers approved for asthma and chronic obstructive pulmonary disease, or COPD, generated an estimated 24.9 million metric tons of carbon dioxide equivalent emissions in the United States from 2014 to 2024. This is equivalent to the emissions of about 530,000 gas-powered cars each year, according to the study.\n\n\"Scaled across tens of millions of inhalers dispensed annually, these emissions drive global warming, exacerbating the very respiratory conditions inhalers are meant to relieve,\" authors of a supplemental editorial note wrote of the findings.\n\nTwenty-eight million Americans have asthma and 34 million have chronic lung disease, according to the Asthma and Allergy Foundation of America. These cases are expected to grow as climate change makes air pollution worse, increasing the risk and severity of symptoms.\n\nResearchers found metered-dose inhalers — the boot-shaped treatment modality many picture — were the most harmful to the environment, accounting for 98% of emissions over the decadelong period.\n\nBut it's not the medication that's the problem. These inhalers contain hydrofluoroalkane propellants, which are potent greenhouse gases widely used in products like aerosol sprays, the study explained.\n\n\"Inhalers add to the growing carbon footprint of the US healthcare system, putting many patients with chronic respiratory disease at risk,\" lead author Dr. William Feldman, a pulmonologist and health services researcher at the David Geffen School of Medicine at UCLA, said in a news release. \"On the upside, there is tremendous opportunity to make changes that protect both patients and the planet by utilizing lower-emission alternatives.\"\n\nThe study found other types of inhalers — such as dry inhalers and soft powder mist inhalers — are less harmful, delivering medication to the lungs without the need for propellants.", "authors": ["Sara", "Reporter", "Lifestyle", "Sara Moniuszko Is A Health", "Lifestyle Reporter At Cbsnews.Com. Previously", "She Wrote For Usa Today", "Where She Was Selected To Help Launch The Newspaper'S Wellness Vertical. She Now Covers Breaking", "Trending News For Cbs News' Healthwatch.", "Read Full Bio", "Alex"], "published_date": null, "top_image": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/04/18/a11cea62-bb7a-45cd-8164-3881556cd6a3/thumbnail/1200x630/327627f7e2362b3b01977969ae9da855/gettyimages-1153236079.jpg", "summary": "This is equivalent to the emissions of about 530,000 gas-powered cars each year, according to the study.\n\"Scaled across tens of millions of inhalers dispensed annually, these emissions drive global warming, exacerbating the very respiratory conditions inhalers are meant to relieve,\" authors of a supplemental editorial note wrote of the findings.\nTwenty-eight million Americans have asthma and 34 million have chronic lung disease, according to the Asthma and Allergy Foundation of America.\nThese inhalers contain hydrofluoroalkane propellants, which are potent greenhouse gases widely used in products like aerosol sprays, the study explained.\nThe study found other types of inhalers — such as dry inhalers and soft powder mist inhalers — are less harmful, delivering medication to the lungs without the need for propellants.", "keywords": ["chronic", "study", "million", "disease", "asthma", "respiratory", "500000", "inhalers", "produce", "finds", "according", "conditions", "cars", "emissions", "carbon"], "success": true, "error": null}}