{"timestamp": 1760120744.094988, "data": {"url": "https://economictimes.indiatimes.com/markets/stocks/news/the-biggest-pension-fund-puts-impact-investing-on-the-agenda/articleshow/124328218.cms", "title": "The biggest pension fund puts impact investing on the agenda", "text": "Synopsis\n\nJapan's largest pension fund is considering impact investing. This decision is influencing other Japanese money managers. The government supports this strategy to address national challenges. These include an aging society and gender inequality. Impact investing focuses on climate, health, and inclusivity. This approach aims for economic and capital markets growth. It provides a driver for company development.\n\nA decision by Japan's $1.8 trillion pension fund, the world's biggest, to consider a shift into impact investing has triggered a wider adjustment among the country's money managers.\n\nThe Government Pension Investment Fund opened the door to impact strategies in March and at least four other Japanese pension funds are updating or revising their investment policies, according to a review of the funds' investment policies. At the same time, there's evidence that asset managers pitching for pension mandates are now adjusting their approach to match growing demand for impact strategies.\n\nThe ripple effect through Japan's $5 trillion money management industry is backed by the government, which has identified the strategy as a way to help address some of the country's real-world challenges. That's as policymakers in Japan face a rapidly aging society and one which ranked 118th last year in a gender-equality review of 146 countries.\n\nGPIF President Kazuto Uchida has made clear he thinks that an investment approach targeting environmental and social goals \"ultimately leads to\" economic and capital markets growth.\n\nAniket Shah, managing director and global head of sustainability and transition strategy at Jefferies Financial Group Inc., says the fact that investors can measure the real-world effect of impact investing gives it the potential to be more powerful than basic screening for ESG (environmental, social and governance) risk.\n\nLive Events\n\n\"It's more durable because looking at impact as a driver of growth of companies is a financial discussion,\" Shah said. \"This is a real economic theme and driver today.\"\n\nIn Japan, impact investing strategies are likely to center around climate, health care, wellbeing and inclusivity, according to Masato Nakamura, head of GLIN Impact Capital, a Tokyo-based investment firm that participated in meetings with GPIF and other Japanese pensions about the strategy. The expectation is that GPIF will start applying the strategy to listed equities first, he said.\n\n(You can now subscribe to our ETMarkets WhatsApp channel)\n\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\n\n...moreless\n\n(You can now subscribe to our ETMarkets WhatsApp channel)\n\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\n\n...moreless\n\nWhat’s really killing MP kids? A cheap toxin often used in cough syrups.\n\nOpenAI-Oracle-Nvidia deals: Big AI moves or just balance-sheet games?\n\nWhen hospitals and insurers lock horns, patients pay the price\n\nIs the new EU-India Strategic Agenda a victory for decarbonising steel?\n\nHyundai is losing ground to M&M and Tata, but its stock tells a different story. Why?\n\nStock Radar: Uno Minda stock hits fresh record high in October; will the rally continue?\n\n1\n\n2\n\n3", "authors": ["Bloomberg"], "published_date": "2025-10-06T06:15:00+05:30", "top_image": "https://img.etimg.com/thumb/msid-124328223,width-1200,height-630,imgsize-6902,overlay-etmarkets/articleshow.jpg", "summary": "Synopsis Japan's largest pension fund is considering impact investing.\nImpact investing focuses on climate, health, and inclusivity.\nA decision by Japan's $1.8 trillion pension fund, the world's biggest, to consider a shift into impact investing has triggered a wider adjustment among the country's money managers.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price ...moreless (You can now subscribe to our ETMarkets WhatsApp channel) (What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price ...moreless What’s really killing MP kids?", "keywords": ["biggest", "puts", "agenda", "impact", "pension", "investing", "fund", "share", "price", "investment", "subscribe", "etmarkets", "strategy", "economic", "strategies", "stock", "markets", "sensex", "market", "budget", "2025", "telegram", "alerts", "stocks", "bank", "japan's", "japanese", "money", "managers", "approach", "capital", "growth", "driver", "gpif", "today"], "success": true, "error": null}}