{"timestamp": 1760121802.262356, "data": {"url": "https://abcnews.go.com/Technology/wireStory/phone-rings-number-sweden-answer-nobel-prize-winner-126330839", "title": "Your phone rings, and it's a number from Sweden. Do you answer? A Nobel Prize winner didn't", "text": "BERLIN -- BERLIN (AP) — For some Nobel Prize winners this year, the news came with a knock at the door before dawn. For others, it was a long-awaited phone call honoring a discovery made decades ago.\n\nOne of the medicine prize winners, meanwhile, was on vacation in Yellowstone National Park without cellular service. It would be hours before he found out.\n\nThe Nobel Prizes are considered among the world’s most prestigious honors for achievements in medicine, physics, chemistry, literature, economics and peace. The winners join the pantheon of Nobel laureates, from Albert Einstein to Mother Teresa.\n\nSometimes, the award is anticipated. Potential winners plan tentative news conferences or, in the western U.S., wait up all night for the news.\n\nWhile some prizes might feature household names — such as 2009 peace prize winner then-U.S. President Barack Obama or 2016 literature laureate and singer-songwriter Bob Dylan — the natural science categories typically go to people whose names the general public doesn't know, for decades-old research.\n\nFive of this year’s nine science winners were in the U.S. when the news broke. Some were fast asleep.\n\nTwo winners in Japan, seven hours ahead of Stockholm, were awake and working when the call came from a Swedish number. One thought it was a telemarketer.\n\nWednesday's chemistry prize was the first time this year that the Nobel committee reached all three winners ahead of the formal announcement.\n\nHere's how some of this year's winners found out:\n\nWhen Associated Press photographer Lindsey Wasson knocked on the door of Mary E. Brunkow's Seattle home around 4 a.m. local time Monday, it was the scientist's dog who woke up first. Zelda's barking roused Brunkow's husband, Ross Colquhoun.\n\n“I don’t think he really knew what I was there for,\" Wasson said. \"And I said, ‘You know, sir, I think your wife just won the Nobel Prize.'”\n\nWasson's photographs captured Colquhoun waking up Brunkow and telling her the life-changing news: She was among three winners sharing the 2025 medicine prize.\n\n\"Don’t be ridiculous,\" she told her husband.\n\nBut it was true. The trio had, in research dating back two decades, uncovered a key pathway the body uses to keep the immune system in check, called peripheral immune tolerance. Experts called the findings critical to understanding autoimmune diseases such as Type 1 diabetes, rheumatoid arthritis and lupus.\n\nThe following day, AP photographers Mark J. Terrill and Damian Dovarganes headed to Santa Barbara, California, to find physicist John Martinis before the sun rose. His wife, Jean, answered the door and told them to come back later: Martinis needed to sleep.\n\n“For many years, we would stay up on the night the physics award was announced,” she told the photographers. “At some point we just decided, that's nuts. We'll figure it out if it's happening, but let's just get our sleep.”\n\nShe added, laughing: “I was trying to think how I can introduce this. Like, 'Do you think you should plan a trip to Sweden?\"\n\nShe finally woke her husband up just before 6 a.m. local time (1300 GMT), telling him only that the AP wanted an interview.\n\n“I kind of knew that the Nobel Prize announcements was this week, so I kind of put two and two together,” Martinis said later. \"I opened my computer and looked under the Nobel Prize 2025 and saw my picture along with Michel Devoret and John Clarke. So I was kind of in shock.”\n\nThe trio won the physics prize for their research on the weird world of subatomic quantum tunneling that advances the power of everyday digital communications and computing.\n\nMartinis will get that trip to Sweden. The Dec. 10 award ceremony is in Stockholm.\n\nEveryone but Fred Ramsdell seemed to know he had just won the Nobel Prize in medicine.\n\nRamsdell was away on a backpacking trip Monday, driving through Yellowstone National Park with his wife and two dogs, Larkin and Megan. He kept his cellphone in airplane mode as he often does on family trips.\n\nAs they drove through a small town hours later, his wife started screaming as notifications flooded her phone. She told him he'd just won the Nobel Prize in medicine alongside Brunkow and Shimon Sakaguchi.\n\n“I said, ‘No, I didn’t,’” Ramsdell told the AP in an interview the following day from his car. “She said, ‘Yes, you did. I have 200 text messages that say you won the Nobel Prize.’”\n\nLater Monday, Ramsdell drove to a Montana hotel to connect to Wi-Fi and call friends and colleagues. He didn't speak with the Nobel committee to get their congratulations until midnight.\n\nHe said he was stunned and awed to receive the recognition. But he has no plans to change his phone habits, which he says are important for work-life balance.\n\nThe Nobel Committee calls the winners shortly before the formal announcement is made. Some ignore the Swedish number — like Brunkow, who assumed the pre-dawn call was spam.\n\nWhen his phone rang Wednesday, chemistry winner Susumu Kitagawa was skeptical. He said he answered “rather bluntly, thinking it must be yet one of those telemarketing calls I’m getting a lot recently.”\n\nThe Nobel announcements continue with the literature prize Thursday. Will that winner pick up the phone?\n\n__\n\nRamakrishnan reported from New York. Mari Yamaguchi in Tokyo contributed.\n\n__", "authors": ["STEFANIE DAZIO Associated Press", "ADITHI RAMAKRISHNAN Associated Press", "ABC News"], "published_date": "2025-10-08T15:21:35+00:00", "top_image": "https://i.abcnewsfe.com/a/2cd67bc7-161f-4d61-a134-5c7e55d11363/wirestory_41a9952fdbecfe722abeee1c2c6afaf0_16x9.jpg?w=1600", "summary": "BERLIN -- BERLIN (AP) — For some Nobel Prize winners this year, the news came with a knock at the door before dawn.\nOne of the medicine prize winners, meanwhile, was on vacation in Yellowstone National Park without cellular service.\n\"And I said, ‘You know, sir, I think your wife just won the Nobel Prize.\n\"I opened my computer and looked under the Nobel Prize 2025 and saw my picture along with Michel Devoret and John Clarke.\nEveryone but Fred Ramsdell seemed to know he had just won the Nobel Prize in medicine.", "keywords": ["rings", "number", "sweden", "answer", "nobel", "prize", "phone", "winner", "winners", "medicine", "won", "told", "ap", "wife", "martinis", "ramsdell", "door", "hours", "physics", "chemistry", "literature", "award", "s", "research", "committee", "husband", "brunkow", "trip", "kind", "berlin", "decades", "yellowstone", "national", "park", "prizes"], "success": true, "error": null}}