{"timestamp": 1760321915.2794309, "data": {"url": "https://abcnews.go.com/US/illinois-files-lawsuit-block-deployment-national-guard/story?id=126253079", "title": "Trump threatens use of Insurrection Act in Chicago as governor says feds used Black Hawk helicopters in immigration raid", "text": "Trump threatens use of Insurrection Act in Chicago as governor says feds used Black Hawk helicopters in immigration raid\n\nTear gas fills the air after it was used by federal law enforcement agents who were being confronted by community members and activists for reportedly shooting a woman in the Brighton Park neighborhood on October 4, 2025 in Broadview, Illinois.\n\nTear gas fills the air after it was used by federal law enforcement agents who were being confronted by community members and activists for reportedly shooting a woman in the Brighton Park neighborhood on October 4, 2025 in Broadview, Illinois.\n\nTear gas fills the air after it was used by federal law enforcement agents who were being confronted by community members and activists for reportedly shooting a woman in the Brighton Park neighborhood on October 4, 2025 in Broadview, Illinois.\n\nTear gas fills the air after it was used by federal law enforcement agents who were being confronted by community members and activists for reportedly shooting a woman in the Brighton Park neighborhood on October 4, 2025 in Broadview, Illinois.\n\nIllinois Gov. JB Pritzker on Monday accused the Trump administration of staging a \"military-style invasion\" of Chicago, striking fear in residents with \"thuggery\" tactics by immigration agents and even deploying Black Hawk helicopters to raid an apartment building.\n\nPritzker slammed the Trump administration's immigration crackdown targeting Chicago just hours after the state and City of Chicago filed a lawsuit seeking to block the federalization and deployment of the National Guard.\n\n\"Let me be clear, Donald Trump is using our service members as political props and as pawns in his illegal effort to militarize our nation's cities,\" Pritzker said during a news conference.\n\nTo support his point, Pritzker played a video of an ICE raid conducted last week on an apartment complex in the South Shore neighborhood of Chicago he claimed was filmed by federal authorities with high-definition cameras for social media purposes. He said it was the same video Secretary of the U.S. Department of Homeland Security Kristi Noem posted on social media on Saturday.\n\n\"They brought Black Hawk military helicopters and more than 100 agents in full tactical gear,\" Pritzker said.\n\nHe added, \"In the dead of night and seemingly for the cameras, armed federal agents emerged from the Black Hawk helicopters, rappelling onto the roof of that apartment building.\"\n\nThe governor alleged the Trump administration is following a playbook to \"cause chaos, create fear and confusion, make it seem like peaceful protesters are a mob by firing gas pellets and tear gas canisters at them.\"\n\nTear gas fills the air after it was used by federal law enforcement agents who were being confronted by community members and activists for reportedly shooting a woman in the Brighton Park neighborhood on October 4, 2025 in Broadview, Illinois. Scott Olson/Getty Images\n\n\"Why? To create the pretext for invoking the Insurrection Act so that he can send military troops to our city,\" Pritzker said.\n\nThe Department of Homeland Security issued a press release on Monday, claiming to debunk a \"smorgasbord of lies\" told by the governor.\n\n\"Our message to JB Pritzker: Get out of your mansion and see Chicago,” said DHS Assistant Secretary Tricia McLaughlin in the release. \"If J.B. Pritzker actually walked the streets of his own city, he would see domestic terrorists and violent rioters attacking police officers and the scourge of violent crime as a direct result of his own policies.\"\n\nSpeaking to reporters in the Oval Office on Monday afternoon, Trump said he did not yet see the need to use the Insurrection Act, but \"if I had to enact it, I'd do it, if people were being killed and courts were holding us up, or governors or mayors were holding us up.\"\n\nWhite House deputy chief of staff for policy Stephen Miller on Monday cited two incidents over the weekend in which protesters rammed the vehicles of immigration agents in Chicago, prompting the shooting of one protester, who federal authorities alleged was driving one of the vehicles and was armed.\n\n\"The struggle that is taking place right now is between the lawful exercise of power by the American people through a duly elected government versus the unlawful exercise of street violence in the form of domestic terrorism,\" Miller told reporters at the White House.\n\nMiller added, \"The clearest example of this is when you have ICE officers, who are carrying out the statutes and the laws of the United States to arrest and remove illegal aliens, who are being subjected to violent attacks in the conduct of their duties. That's an example of illegitimate violence, illegitimate power in the form of domestic terrorism being used to impede the conduct of their official duties.\"\n\nIn its lawsuit filed on Monday morning, the state of Illinois and the City of Chicago asked a judge to block the Trump administration's deployment of military troops to Chicago.\n\n\"The American people, regardless of where they reside, should not live under the threat of occupation by the United States military, particularly not simply because their city or state leadership has fallen out of a president's favor,\" the complaint said.\n\nThe foundational principle separating the military from domestic affairs is \"in peril\" as President Trump seeks to deploy the National Guard to cities across the country, lawyers for Illinois and Chicago wrote in a lawsuit.\n\nThe plaintiffs' attorneys are asking a federal judge to issue an order blocking any state's National Guard from being federalized and deployed to Illinois, arguing the state is being targeted because its \"leadership has fallen out of a president's favor.\"\n\n\"There is no insurrection in Illinois. There is no rebellion in Illinois. The federal government is able to enforce federal law in Illinois. The manufactured nature of the crisis is clear,\" according to the 69-page complaint.\n\nAttorneys for Illinois and Chicago argue that Trump has failed to justify taking over the National Guard based on federal law -- which allows a federalization in response to a rebellion or invasion -- and violates the Posse Comitatus Act prohibiting the use of the military in domestic law enforcement.\n\nDemonstrators confront police during a protest outside an immigrant processing and detention center, October 3, 2025 in Broadview, Illinois. Scott Olson/Getty Images\n\n\"Defendants' unlawful deployment of the Illinois National Guard, over the objection of the state, is similar to the unlawful course of conduct they have taken against other disfavored states and cities,\" the complaint said.\n\nThe lawsuit cites Trump's social media posts about sending militarized law enforcement to Chicago -- including a post in which he said, \"I love the smell of deportations in the morning\" -- and his recent comments about using Democratic-led cities \"as training grounds for our military.\"\n\nThe lawsuit comes after a federal judge blocked Trump from sending National Guard troops to Oregon, where protesters have gathered in a one-block area surrounding the U.S. Immigration and Customs Enforcement building in Portland.\n\nIn the ruling issued on Saturday, U.S. District Judge Karin Immergut granted a temporary restraining order sought by California and Oregon.\n\n\"This country has a longstanding and foundational tradition of resistance to government overreach, especially in the form of military intrusion into civil affairs,\" Immergut wrote.\n\n\"This historical tradition boils down to a simple proposition: this is a nation of Constitutional law, not martial law,\" the judge said.\n\nImmergut, who Trump appointed to the U.S. District Court for the District of Oregon during his first term, issued the ruling a day after Trump authorized the deployment of 300 Illinois National Guard troops to Chicago to protect federal officers and federal assets in the city.\n\nTrump has described both Portland and Chicago as being overrun by violence and unrest. He has characterized both cities as \"war zones.\"\n\nBut the governors of both Oregon and Chicago have countered that Trump has greatly exaggerated the violence in those cities to justify his actions.\n\nA federal law enforcement agents confronts demonstrators from the turret of an armored vehicle during a protest outside an immigrant processing and detention center on Oct. 3, 2025, in Broadview, Illinois. Scott Olson/Getty Images\n\nAmid escalating tensions in Chicago over the Trump administration's immigration crackdown, U.S. Customs and Border Patrol agents on Saturday shot and wounded a woman they alleged was part of a convoy of protesters that rammed their vehicles during an \"ambush.\"\n\nDepartment of Homeland Security Secretary Kristi Noem said Border Patrol agents opened fire on the woman in self-defense, alleging she was armed with a semiautomatic weapon and was driving one of three vehicles that \"cornered\" and rammed the CBP agents' vehicles.\n\nIn a second incident in Chicago on Saturday, a man was taken into custody after he allegedly rammed a CBP vehicle in an attempt to run it off the road, according to the DHS.\n\nTrump ignited a war of words with Illinois and Chicago leaders in early September when he suggested sending National Guard troops to the Windy City, saying in a social media post, \"Chicago is about to find out why it's called the Department of War.\"\n\nIn the post, Trump added, \"I love the smell of deportations in the morning,\" a nod to the often-quoted line \"I love the smell of napalm in the morning\" from the war film \"Apocalypse Now.\"\n\nTrump initially insisted that he was waiting for Chicago officials to ask for the federal government's help before sending in the National Guard.\n\nFederal law enforcement agents stand guard as they are confronted by community members and activists for reportedly shooting a woman in the Brighton Park neighborhood on October 4, 2025 in Broadview, Illinois. Scott Olson/Getty Images\n\nPritzker made clear in a September news conference that he would not make such a request, telling reporters, \"When did we become a country where it's okay for the U.S. president to insist on national television that a state should call him to beg for anything, especially something we don't want?\"\n\nOn Monday morning, Chicago Mayor Brandon Johnson signed an executive order creating \"ICE Free Zones\" in the city.\n\nThe mayor's order prohibits federal immigration agents from using city-owned property in their immigration enforcement. The order also invites local business owners and community organizations to join the city's effort to \"safeguard our communities, while advancing measures to rein in the reckless behavior of federal immigration agents.\"\n\n\"With this Executive Order, Chicago stands firm in protecting the Constitutional rights of our residents and immigrant communities and upholding our democracy,\" Johnson said in a statement.\n\n\"We will not tolerate ICE agents violating our residents' constitutional rights nor will we allow the federal government to disregard our local authority. ICE agents are detaining elected officials, tear-gassing protestors, children, and Chicago police officers, and abusing Chicago residents,\" Johnson said. \"We will not stand for that in our city.\"\n\nMiller said Johnson's executive order is the latest example of Democrat politicians refusing the condemn the attacks on federal agents.\n\n\"The mayor of Chicago has not only failed to condemn the violent, obstructive acts against ICE and law enforcement, but in the aftermath of two coordinated attempted murders of ICE officers through vehicle ramming attacks, he issued a no go zone for ICE officers,\" Miller said.", "authors": ["Abc News"], "published_date": null, "top_image": "https://i.abcnewsfe.com/a/1c4b47e3-133a-466d-9ee7-3e8b03ed51f6/chicago-2-gty-gmh-251006_1759761869543_hpMain_16x9.jpg?w=1600", "summary": "JB Pritzker on Monday accused the Trump administration of staging a \"military-style invasion\" of Chicago, striking fear in residents with \"thuggery\" tactics by immigration agents and even deploying Black Hawk helicopters to raid an apartment building.\nHe added, \"In the dead of night and seemingly for the cameras, armed federal agents emerged from the Black Hawk helicopters, rappelling onto the roof of that apartment building.\"\nThe mayor's order prohibits federal immigration agents from using city-owned property in their immigration enforcement.\nThe order also invites local business owners and community organizations to join the city's effort to \"safeguard our communities, while advancing measures to rein in the reckless behavior of federal immigration agents.\"\nMiller said Johnson's executive order is the latest example of Democrat politicians refusing the condemn the attacks on federal agents.", "keywords": ["agents", "chicago", "threatens", "raid", "national", "illinois", "immigration", "woman", "feds", "trump", "law", "insurrection", "federal", "hawk", "used", "enforcement", "governor", "helicopters"], "success": true, "error": null}}