{"timestamp": 1760322067.469725, "data": {"url": "https://www.aljazeera.com/news/2025/10/12/taliban-pakistani-forces-trade-heavy-fire-along-afghanistan-border", "title": "Pakistan, Afghanistan claim dozens of casualties in border clashes", "text": "Pakistan says it killed 200 Afghan fighters as Taliban claims killing 58 Pakistani soldiers in overnight operations.\n\nPakistan’s military says it has killed more than 200 Afghan fighters while Afghanistan claims it killed 58 Pakistani soldiers in crossborder clashes along their frontier.\n\nZabihullah Mujahid, spokesperson for Afghanistan’s Taliban government, on Sunday said 30 other Pakistani soldiers were wounded and a “significant amount” of Pakistani weapons fell into Afghan hands.\n\nMujahid challenged the Pakistani report, adding that nine Taliban soldiers were killed in the overnight operations and nearly a dozen others were injured.\n\nPakistan’s military, on the other hand, said 23 of its “brave sons” were killed in the clashes, and officials said they closed their border with Afghanistan.\n\nBorder hostilities erupted after Thursday’s explosions in Afghanistan, which the Taliban blamed on Pakistan, representing the sharpest escalation in months of strained relations over Islamabad’s allegations that Afghanistan is harbouring armed groups behind attacks inside Pakistan.\n\nEarlier on Sunday, Taliban said it captured three Pakistani border posts during its retaliatory attacks at several points along the border in Kunar and Helmand provinces.\n\nEnayatullah Khwarizmi, the spokesperson for the Afghan Ministry of Defence, said late on Saturday that Taliban forces had carried out “successful retaliatory” attacks against Pakistani soldiers in response to the neighbouring country’s “repeated violations” of, and air strikes on, Afghan territory.\n\nThe Pakistani state media on Sunday said its forces seized 19 Afghan border posts, citing security sources who said Afghan Taliban fighters at the posts were either killed or fled.\n\nAdvertisement\n\nA video broadcast by Pakistan Television (PTV) showed Afghan posts in flames Taliban soldiers allegedly surrendering in Kurram.\n\nRadio Pakistan, citing security sources, said Pakistani forces completely destroyed the Taliban’s Manojba camp battalion headquarters, Jandusar Post, Turkmenzai camp and Kharchar Fort. The state broadcaster said Pakistan was targeting the hideouts of armed groups near the border “with great precision”.\n\nThe fighting has prompted calls for restraint from Iran, Qatar and Saudi Arabia.\n\n‘Long-term consequences worrying’\n\nThe overnight fighting marks a sharp escalation between the South Asian neighbours, coming days after an explosions in Kabul and Paktika that the Taliban government blamed on Pakistan.\n\nIslamabad did not claim responsibility for the blasts, but Defence Minister Khawaja Asif told parliament that “enough is enough,” warning Kabul of consequences for continued assaults on Pakistani forces.\n\nAn unnamed Pakistani source told Reuters that the strike targeted the leader of the Tehreek-e-Taliban Pakistan (TTP), Noor Wali Mehsud, in Kabul.\n\nOnce warm, relations between Pakistan and Afghanistan have deteriorated as Islamabad has accused Kabul of harbouring members of the TTP, and other armed groups which carry out attacks against it.\n\nThe TTP, or Pakistani Taliban, was formed in 2007 in response to Pakistan’s military operations in its tribal border regions supporting the US invasion of Afghanistan, and has since waged a deadly insurgency since.\n\n“This TTP issue has become a major sticking point in relations between the two countries,” Imtiaz Gul, an Islamabad-based expert on Pakistani and Afghan armed groups, told Al Jazeera.\n\n“The long-term consequences are worrying, as they will only deepen existing animosities,” he added.\n\nPakistan has faced an intensified offensive from the TTP in recent months, with the Islamabad-based Pakistan Institute for Conflict and Security Studies reporting that August marked “its deadliest month of militant violence in more than a decade.”\n\nThe institute said 194 people were killed and more than 200 injured in 143 attacks across the country.\n\nPakistan now ranks second on the Global Terrorism Index, which evaluates countries based on the impact and consequences of attacks by armed groups within their borders.\n\nTens of thousands have been displaced due to the military’s operations against the TTP and other armed groups.\n\nThe flare-up in fighting coincided with Afghan Foreign Minister Amir Khan Muttaqi’s visit to India, signalling a potential shift in bilateral relations and provoking Pakistan, which regards New Delhi as a regional rival.\n\nAdvertisement\n\nPakistan’s military said in a statement that it was “concerned” about the timing of the fighting and said India was the “the biggest sponsor of terrorism in the region”.\n\nNew Delhi denies the charge, while the Taliban says it does not allow its territory to be used against other countries.\n\nMeanwhile, the Iranian Minister of Foreign Affairs Abbas Araghchi called on his country’s two neighbours “to exercise restraint”.\n\n“Our position is that both sides must exercise restraint,” Araghchi said, according to a report by the AFP news agency, adding that “stability” between the countries “contributes to regional stability”.\n\nSaudi Arabia, too, expressed concern.\n\n“The kingdom calls for restraint, avoiding escalation, and embracing dialogue and wisdom to contribute to reducing tensions and maintaining security and stability in the region,” the Saudi Foreign Ministry said.\n\n“The kingdom affirms its support for all regional and international efforts aimed at promoting peace and stability, and its continued commitment to ensuring security, which will achieve stability and prosperity for the brotherly Pakistani and Afghan peoples,” it added.", "authors": ["Faisal Ali"], "published_date": "2025-10-12T00:00:00", "top_image": "https://www.aljazeera.com/wp-content/uploads/2025/10/AFP__20251012__78H629E__v1__HighRes__AfghanistanPakistanUnrest-1760280131.jpg?resize=1920%2C1440", "summary": "Pakistan says it killed 200 Afghan fighters as Taliban claims killing 58 Pakistani soldiers in overnight operations.\nPakistan’s military says it has killed more than 200 Afghan fighters while Afghanistan claims it killed 58 Pakistani soldiers in crossborder clashes along their frontier.\nEarlier on Sunday, Taliban said it captured three Pakistani border posts during its retaliatory attacks at several points along the border in Kunar and Helmand provinces.\nAdvertisementA video broadcast by Pakistan Television (PTV) showed Afghan posts in flames Taliban soldiers allegedly surrendering in Kurram.\nAn unnamed Pakistani source told Reuters that the strike targeted the leader of the Tehreek-e-Taliban Pakistan (TTP), Noor Wali Mehsud, in Kabul.", "keywords": ["armed", "taliban", "clashes", "soldiers", "attacks", "pakistan", "afghanistan", "dozens", "ttp", "afghan", "pakistani", "claim", "border", "casualties", "killed"], "success": true, "error": null}}