{"timestamp": 1760321910.513637, "data": {"url": "https://www.aljazeera.com/news/2025/10/8/trump-calls-to-jail-chicago-mayor-illinois-governor-in-immigration-dispute", "title": "Trump calls to jail Chicago mayor, Illinois governor in immigration dispute", "text": "Trump slams Chicago mayor and Illinois governor resisting his mass deportation campaign as troops arrive in state.\n\nUnited States President Donald Trump called for the jailing of Democratic officials in Illinois resisting his mass deportation campaign, a day after armed troops from Texas arrived in the state to bolster the operation.\n\nChicago, the largest city in Illinois and third-largest in the country, has become the latest flashpoint in the Trump administration’s drive to deport millions of immigrants, which has prompted allegations of rights abuses and myriad lawsuits.\n\nThe operation is being led by US Immigration and Customs Enforcement (ICE), whose masked agents have surged into several Democratic-led cities to conduct raids, stoking outrage among many residents and protests outside federal facilities.\n\n“Chicago Mayor should be in jail for failing to protect Ice Officers! Governor Pritzker also!” Trump posted Wednesday on his Truth Social platform.\n\nLocal officials argue that city and state law enforcement are sufficient to handle the protests, but Trump claims the military is needed to keep federal agents safe, heightening concerns among his critics of growing authoritarianism.\n\nAfter National Guard deployments in Los Angeles and Washington, DC, 200 troops arrived in Illinois on Tuesday.\n\nAn immigration enforcement building outside Chicago has also been the site of clashes between federal agents and protesters.\n\n“The federal government has not communicated with us in any way about their troop movements,” Pritzker told reporters in Chicago. “I can’t believe I have to say ‘troop movements’ in an American city, but that is what we’re talking about here.”\n\nAdvertisement\n\nA judge will have a role in determining how many boots are on the streets: There’s a court hearing Thursday on a request by Illinois and Chicago to declare the National Guard deployment illegal.\n\n‘Stand up and speak out’\n\nTrump’s attacks on Chicago Mayor Brandon Johnson and Illinois Governor JB Pritzker, both Democrats, follow similar extraordinary public calls by the president for his political opponents to face legal charges.\n\nThey come on the same day that former FBI director James Comey was arraigned on charges of lying to Congress – an indictment which came just days after Trump urged his attorney general to take action against him and others.\n\nPritzker, seen as a potential Democratic candidate in the 2028 presidential election, has become one of Trump’s most fiery critics.\n\nHe pledged Wednesday to “not back down,” listing a litany of grievances against Trump’s immigration crackdown.\n\n“Making people feel they need to carry citizenship papers. Invading our state with military troops. Sending in war helicopters in the middle of the night,” he wrote on X.\n\n“What else is left on the path to full-blown authoritarianism?” he asked. “We must all stand up and speak out.”\n\nBy “war helicopters”, Pritzker was referring to a major raid last week in which Black Hawk helicopters descended on a Chicago housing complex.\n\nDozens of people were arrested in the surprise operation, according to the Trump administration, but US media reported that American citizens were detained for hours.\n\nMayor Johnson has since announced “ICE-free zones” where city-owned property will be declared off-limits to federal authorities.\n\nJohnson accused Republicans of wanting “a rematch of the Civil War”.\n\nTrump’s immigration crackdown is aimed at fulfilling a key election pledge to rid the country of what he called waves of foreign “criminals”.\n\nTrump has nonetheless faced some legal setbacks, including a federal judge in Oregon blocking his bid to deploy troops in Portland, saying his descriptions of an emergency there were false and that the US is a “nation of Constitutional law, not martial law”.\n\nTrump says he could invoke the rarely used Insurrection Act to force deployments of troops around the country if courts or local officials are “holding us up”.", "authors": [], "published_date": "2025-10-08T00:00:00", "top_image": "https://www.aljazeera.com/wp-content/uploads/2025/10/AP25280665815461-1759868765.jpg?resize=1920%2C1440", "summary": "Trump slams Chicago mayor and Illinois governor resisting his mass deportation campaign as troops arrive in state.\n“Chicago Mayor should be in jail for failing to protect Ice Officers!\nAn immigration enforcement building outside Chicago has also been the site of clashes between federal agents and protesters.\n“The federal government has not communicated with us in any way about their troop movements,” Pritzker told reporters in Chicago.\n‘Stand up and speak out’Trump’s attacks on Chicago Mayor Brandon Johnson and Illinois Governor JB Pritzker, both Democrats, follow similar extraordinary public calls by the president for his political opponents to face legal charges.", "keywords": ["chicago", "illinois", "immigration", "trump", "calls", "dispute", "troops", "mayor", "pritzker", "federal", "officials", "state", "governor", "jail"], "success": true, "error": null}}