{"timestamp": 1760318401.585679, "data": {"url": "https://www.aljazeera.com/news/2025/10/8/white-house-memo-says-federal-workers-may-not-get-automatic-backpay-report", "title": "White House memo says federal workers may not get automatic backpay: Report", "text": "The memo is seen as a pressure tactic on Democrats as the US government shutdown heads into its eighth day.\n\nThe White House is attempting to challenge a legal precedent that grants automatic back pay to hundreds of thousands of furloughed federal workers at the end of a government shutdown, according to media reports.\n\nA new White House memo claims that the US Congress must specifically earmark funding for furloughed workers, under a new interpretation of the “Government Employee Fair Treatment Act of 2019”, according to the US news outlet Axios.\n\nAxios reported the news on Tuesday evening in the US, citing a memo from the Office of Management and Budget and senior White House officials. The news was later corroborated by other US media outlets.\n\nThe Fair Treatment Act was passed during the first administration of US President Donald Trump, following a 35-day shutdown that lasted from December 2018 to January 2019.\n\nThe Trump administration is now arguing that the wording of the law requires a specific action from Congress rather than an automatic payment to furloughed workers, as the shutdown is due to enter its eighth day on Wednesday.\n\n“Does this law cover all these furloughed employees automatically? The conventional wisdom is: Yes, it does. Our view is: No, it doesn’t,” a senior White House official told Axios.\n\nNot all Republicans agree with the White House strategy.\n\nLouisiana Senator John Kennedy, a Republican, told CBS News that Trump alone could not determine whether federal workers are paid.\n\n“It’s not up to the president. His opinion matters, but Congress has got to appropriate the money,” he said.\n\nAdvertisement\n\n“We’ve always paid back pay to the military and federal workers, and Congress has always appropriated the money, and we will this time,” Kennedy said.\n\nAs many as 750,000 federal workers have been on furlough since the shutdown began on October 1, and their compensation amounts to approximately $400m per day, according to the Congressional Budget Office.\n\nThe Office of Personnel Management, an independent government agency, said in September that retroactive pay would be disbursed “as soon as possible” once the shutdown ends. The US government now owes employees $2.8bn, with no end in sight for the shutdown.\n\nThe threat to furloughed worker pay has been interpreted by US media as a way to force Democrats to negotiate and end the shutdown. Trump previously threatened to use the shutdown to fire federal workers, as well.\n\nMany US parks and museums have closed their doors until the shutdown ends, while non-essential government operations are also suspended.\n\nThe impact of the shutdown is spreading beyond Washington.\n\nThe Hollywood Burbank Airport operated without air-traffic controllers on site for six hours on Monday night due to shutdown-linked staffing problems, according to a local affiliate of ABC News.\n\nAir traffic control was operated remotely by a team from San Diego, but the airport still faced flight cancellations and delays. Other airports have reported similar problems since the shutdown began last week.\n\nDemocrats continue to block a Republican-sponsored spending bill from passing in the US Senate to force Republicans to negotiate on healthcare.\n\nDemocrats want Republicans to reverse cuts to Medicaid assistance and extend expiring healthcare subsidies. Without them, healthcare premiums will more than double in November for many Americans, according to the nonpartisan Kaiser Family Foundation, which works on healthcare policy.\n\nThe Republican bill, which extends government funding until November 21, failed to pass the Senate on Tuesday in a vote of 52-42. A Democratic version of the spending bill, which extends funding through October 31 and makes subsidies permanent, also failed in a vote of 55-45.", "authors": ["Erin Hale"], "published_date": "2025-10-08T00:00:00", "top_image": "https://www.aljazeera.com/wp-content/uploads/2025/10/2025-10-07T200000Z_512466284_RC267HAH3C2F_RTRMADP_3_USA-SHUTDOWN-1759895111.jpg?resize=1920%2C1440", "summary": "The White House is attempting to challenge a legal precedent that grants automatic back pay to hundreds of thousands of furloughed federal workers at the end of a government shutdown, according to media reports.\nAxios reported the news on Tuesday evening in the US, citing a memo from the Office of Management and Budget and senior White House officials.\nOur view is: No, it doesn’t,” a senior White House official told Axios.\nNot all Republicans agree with the White House strategy.\nLouisiana Senator John Kennedy, a Republican, told CBS News that Trump alone could not determine whether federal workers are paid.", "keywords": ["memo", "shutdown", "workers", "report", "trump", "backpay", "pay", "automatic", "house", "white", "according", "federal", "furloughed", "congress"], "success": true, "error": null}}